{"id": "98044a0eaec8448396855b23aa889362", "source": "sw_pdf.pdf", "page": 1, "text": "소프트웨어융합대학 교육과정 요약표(2025) 대학소개 ◩ 소프트웨어융합대학은 4차 산업혁명을 주도할 실천적 소프트웨어 인재 양성을 위해서 컴퓨터공학과와 소프트웨어융합 학과의 2학과 멀티 트랙의 체제로 2018년도 설립한다. 이후 2022년도 인공지능학과의 신설을 계기로, 컴퓨터공학부 (컴퓨터공학과, 인공지능학과)와 소프트웨어융합학과의 체제로 개편되었다. ◩ 소프트웨어융합대학의 STEP(Software Talent Enhancement Program)에 기반 한 심화 소프트웨어 전문가 양성 교육을 컴퓨 터공학과에서 수행한다. 이는 산업계 및 글로벌 스탠다드에 준하는 실습과 프로젝트 교육 강화 등을 통해서 빅데이터, 모바일 /보안, IoT(Internet of Thing), 스마트 콘텐츠 분야의 소프트웨어 전문가를 양성하는 교육을 수행한다. 인공지능학과는 컴퓨터 공학 및 수학 능력을 기반으로, 실세계 문제를 인공지능 기술로 해결하는 실천 능력, 그리고 인간에 대한 이해 및 윤리의식에 바탕을 둔 글로벌 경쟁력을 확보한 인재를 양성하는 교육을 수행한다. ◩ 소프트웨어융합대학의 SWING(SoftWare Industry for Next-Generation)에 기반 한 소프트웨어 신산업 융합 전문가 양성 교육을 소프트웨어융합학과에서 수행한다. 이를 소프트웨어 핵심과 융합 목표 전공을 위한 압축 교육을 통해서 게임 콘텐츠, 데이터 사이언스, 로봇･비전 및 미래를 스스로 설계하고 기획해 갈 수 있는 글로벌 리더 양성을 통한 소프트웨어 신산업 융합 전문가를 양성하는 교육을 수행한다. 1. 교육목적 창의력과 전문성을 갖추고 새로운 산업과 학문을 주도할 실전적 소프트웨어 인재 양성 2. 교육목표 1) 소프트웨어 중심 기업/학계 및 소프트웨어 관련 창업을 주도하기 위하여, 심화 소프트웨어 전문가 교육을 수행함으로써 소프트 웨어 분야 핵심 개발 능력을 보유한 인재를 육성 2) 융합 목표 분야 관련 기업 및 융합 창업을 주도하기 위하여, 소프트웨어 신산업 융합 전문자 교육을 수행함으로써, 융합분야에 특화된 전공지식과 소프트웨어 개발 능력을 보유한 인재를 육성 3) 4차 산업혁명의 중심인 인공지능 분야를 주도하기 위하여, 이론적 지식과 실전적 능력을 모두 함양하는 교육을 수행함으로써 인공지능의 핵심 연구 및 개발 능력을 보유한 인재를 양성 3. 설치학과 가. 컴퓨터공학부 컴퓨터공학과 나. 컴퓨터공학부 인공지능학과 다. 소프트웨어융합학과"}
{"id": "d07df8baf7db4645a5012329154a52b1", "source": "sw_pdf.pdf", "page": 2, "text": "4. 대학 졸업 요건 ※ 교양이수는 후마니타스칼리지 교양교육과정을 따라야 함 ※ 전공이수는 각 전공별 교육과정 시행세칙에서 정한 졸업이수요건을 만족해야 함 ※ 2018학년도 이후 신입생(편입생, 순수외국인 제외)은 소프트웨어 기초지식 습득 및 마인드 함양을 위해, 각 학과에서 정한 SW교육을 이수해야 함 5. 전공별 교육과정 편성 교과목수 ※ 단기현장실습/장기현장실습 과목은 제외한 현황임 6. 졸업능력인증제 소프트웨어융합대학 졸업능력인증제도는 2023학년도부터 폐지한다. 7. 소프트웨어융합대학 전공과목(영어강좌)이수안내 2008학번 이후 신입생은 전공과목의 영어강좌 3과목 이상 이수를 졸업요건으로 충족해야 하며, 편입학생의 경우 전공과목 영어 강좌 1과목 이상을 이수해야 한다. 2 2025학년도 교육과정"}
{"id": "9cf7d76396cf4773968c6c854bc6a2ae", "source": "sw_pdf.pdf", "page": 3, "text": "소프트웨어융합대학 컴퓨터공학과 교육과정 요약표(2025) 학과소개 ◩ 고도의 정보 산업 사회에서는 새로운 학문으로 컴퓨터공학이 근본이 되며 정보가 가장 중요한 자원이 될 것이다. 이들 정보를 수집하고 처리하는데 있어 컴퓨터공학 기술은 필수적이며 핵심적이다. 컴퓨터공학과에서는 정보산업에서 가장 핵심이 되는 빅데이터분석 분야, 모바일 및 보안 분야, IoT 분야, 스마트 컨텐츠 분야 등의 교육을 추구하고 있다. 프로그래밍 능력을 증진 시키는 프로그래밍언어 교육은 매우 중요하고도 기본적이어서 이론 및 실습을 통해 철저히 교육하고 있다. ◩ 졸업 후에는 대학원에 진학하거나 유학을 가며, 국내의 수많은 정보통신, 컴퓨터, 인터넷, 멀티미디어, 게임, 애니메이션, 전자 상거래 관련기업, 산업체, 금융기관, 국공립 연구소에 진출할 수 있다. 그리고 벤처기업을 창업하는 졸업생이 점점 늘고 있다. 향후 정보화 사회가 본격적으로 도래할 것으로 예측됨에 따라 컴퓨터공학 전공자의 수요가 폭발적으로 증가될 것으로 예상 되며, 창의력과 전문성을 가진 컴퓨터공학 전공자들이 국가경쟁력 제고에 큰 역할을 할 것으로 기대된다. 국가적, 사회적, 시대적 요구에 비추어 보아 컴퓨터공학 전공에서 교육하고 다루는 기술은 산업발전의 핵심이자 주체이며, 이러한 점에서 컴퓨터공학 전공의 향후 발전 전망은 매우 밝고 무한하다고 할 수 있다. 1. 교육목적 IT강국을 선도할 수 있는 창의력과 전문성을 갖춘 글로벌 컴퓨터공학 인재 양성 2. 교육목표 1) 컴퓨터공학 전문지식 습득과 정보화 사회에 대한 이해를 바탕으로 글로벌 사회에서 각 분야 리더로서 활동할 수 있는 능력 배양 2) 기초과학의 충실한 학습을 바탕으로 지식기반 사회에서 요구되는 창의적 능력 배양 3) 기술적 문제를 공식화하고, 첨단 공학 도구를 사용하여 실험을 하고 수행함으로써 당면 문제를 체계적으로 해결할 수 있는 능력 배양 4) 공학적 윤리의식을 갖추고 미래가치를 창출하고 산업발전을 선도할 수 있는 능력 배양 3. 학과별 교과목 수 ※ 창업혅장실습, 단기현장실습/장기현장실습 과목은 제외한 현황임 3 Ⅶ. 소프트웨어융합대학 교육과정"}
{"id": "fc336e966f354831bfc8d11b480341f8", "source": "sw_pdf.pdf", "page": 4, "text": "4. 컴퓨터공학과 졸업 요건 1) 교육과정 기본구조표 ※ 교양이수는 교양교육과정을 따름 ※ 전공이수는 컴퓨터공학과 교육과정 시행세칙에서 정한 졸업이수요건을 만족해야 함 ※ 2018학년도 이후 신입생(편입생, 순수외국인 제외)은 소프트웨어 기초지식 습득 및 마인드 함양을 위해, 컴퓨터공학과에서 정한 SW교육을 이수해야 함 2) 졸업논문 컴퓨터공학과의 ‘졸업프로젝트’를 이수하는 것으로 경희대학교 졸업을 위한 “졸업논문” 합격으로 인정한다. 단, “졸업논문(컴퓨터 공학)”을 필히 수강 신청하여야 한다. 4 2025학년도 교육과정"}
{"id": "57887907d6bd42579779d199891108a1", "source": "sw_pdf.pdf", "page": 5, "text": "컴퓨터공학과 교육과정 시행세칙 제 1 장 총 칙 제1조(학과 설치 목적) ① 본 시행세칙은 본교 학칙 제34조, 제36조, 제58조에 의거하여, 컴퓨터공학과의 운영에 관한 사항을 규정함의 목적으로 한다. ② 글로벌 시대에 국제적으로 인정받을 수 있는 엔지니어의 배출을 목표로 소프트웨어중심대학 사업의 기준과 Washington/Seoul Accord의 기준을 준수하기 위함이며, 지식기반시대와 산업변화에 적극적으로 대응하기 위한 순환형 개선 시스템의 도입을 그 목적으로 한다. ③ 이에 따라, 컴퓨터공학과는 컴퓨터공학 분야의 공학지식의 습득과 응용을 거쳐 설계에 이르는 능력을 키우고 미래 공학현장 문제를 해결할 수 있는 공학도로 양성하기 위하여 2017학년도부터 소프트웨어중심대학 사업을 수행하며, 지식기반시대와 산 업변화에 적극적으로 대응하고 이에 부합하는 공학교육을 위하여 순환형 교육개선 시스템을 도입하여 운영한다. ④ 소프트웨어중심대학 사업단은 과학기술정보통신부 및 정보통신기술진흥센터(IITP)에서 주관하는 IT 교육 혁신으로 산업에 부 흥한 인재 양성을 위한 사업이다. 컴퓨터공학과는 글로벌 시대를 맞이하여 국제적으로 인정받을 수 있는 전문인력 양성을 위 해, 소프트웨어중심대학 사업에서 권장하는 커리큘럼을 반영한 컴퓨터공학을 설치･운영한다. 제2조(일반원칙) ① 컴퓨터공학과를 단일전공, 다전공, 부전공으로 이수하고자 하는 학생은 본 시행세칙에서 정하는 바에 따라 교과목을 이수할 수 있다. ② 교과목의 선택은 지도교수와 상의하여 결정한다. ③ 모든 교과목은 [별표1] 교육과정 편성표에 제시된 이수학년과 개설학기에 준해 이수할 것을 권장한다. ④ 전공과목의 선수과목은 [별표4]와 같으며, 선·후수과목의 체계를 준수하여 이수하여야 한다. 선·후수과목의 체계는 전산시스 템에 반영되어있으며 수강신청시 자동으로 적용된다. 제 2 장 교양과정 제3조(교양이수학점) 교양과목은 교양교육과정 기본구조표에서 정한 소정의 교양학점을 취득하여야 한다. 제 3 장 전공과정 제4조(전공 및 트랙과목 이수) ① 컴퓨터공학과의 단일전공과정을 이수하고자 하는 학생은 [표1]에 명시된 전공기초, 전공필수, 산학필수, 전공선택 학점을 이수하여야 한다. 다전공자의 경우는 [표2]에서 지정한 전공기초, 전공필수 교과목을 반드시 이수해 야 하고, 부전공자의 경우는 [표3]에서 지정한 전공필수, 전공선택 교과목을 반드시 이수해야 한다. ② 컴퓨터공학을 단일전공, 다전공, 부전공으로 이수하고자 하는 자는 본 시행세칙에서 지정한 소정의 전공이수학점을 이수하여 야 한다 ③ 2008학번 이후 신입학생의 경우에는 전공과목의 영어강좌 3과목 이상을 이수해야 졸업요건이 충족되며, 편입생의 경우에는 전공과목의 영어강좌 1과목 이상을 이수해야 졸업요건이 충족된다. 단, 전공과목이라 함은 이수구분이 전공기초, 전공필수, 산학필수, 전공선택인 과목을 의미한다. [표1] 단일전공 전공과목 편성표 5 Ⅶ. 소프트웨어융합대학 교육과정"}
{"id": "29207ea1d97d4a0fb2038885f6373b90", "source": "sw_pdf.pdf", "page": 6, "text": "※ 모든 학생은 제 5조의 산학필수 학점을 취득하여야 함 [표2] 다전공 전공과목 편성표 ※ 졸업논문을 제외한 모든 과목은 3학점임 ※ 2020년 1학기부터 컴퓨터공학을 다전공으로 이수하는 학생의 경우, ‘객체지향프로그래밍’은 ‘객체지향프로그래밍및실습’으로 대체할 수 있으며, ‘자료구조’ 는 ‘자료구조및알고리즘’으로 대체할 수 있음 ※ 2023년 1학기부터 컴퓨터공학을 다전공으로 이수하는 학생의 경우, 전공필수 과목인 ‘컴퓨터구조’의 선수과목인 ‘논리회로’를 해제 함 [표3] 부전공 전공과목 편성표 ※ 위 부전공 전공필수/전공선택 과목이 단일전공 및 다전공의 전공기초/전공필수 교과목과 중복되는 경우, 최대 2과목에 한하여 컴퓨터공학과 단일전공의 전공필수/전공선택 교과목으로 대체 이수 가능함 ※ 2023년 1학기부터 컴퓨터공학을 부전공으로 이수하는 학생의 경우, ‘객체지향프로그래밍’은 ‘객체지향프로그래밍및실습’으로 대체할 수 있으며, ‘자료구조’ 는 ‘자료구조및알고리즘’으로 대체할 수 있음 ※ 2023년 1학기부터 컴퓨터공학을 부전공으로 이수하는 학생의 경우, 전공필수 과목인 ‘컴퓨터구조’의 선수과목인 ‘논리회로’를 해제 함 6 2025학년도 교육과정"}
{"id": "5e4cb59b39b24cfb9e28169c4019a986", "source": "sw_pdf.pdf", "page": 7, "text": "제5조(산학필수 이수) 연구연수활동1･2, 단기현장실습/장기현장실습을 포함하여 최신기술콜로키움1, 최신기술콜로키움 2(SWCON), SW스타트업비즈니스, SW스타트업프로젝트, 빅데이터프로그래밍, 빅데이터프로젝트, 클라우드컴퓨팅, 클라우드 프로 젝트, 모바일/웹서비스프로그래밍, 모바일/웹서비스프로젝트, 블록체인, 블록체인프로젝트, 창업현장실습 중 12학점 이상을 이수하 여야 한다. 제6조(대체교과목의 지정) 컴퓨터공학과의 전공과목의 대체과목은 [별표3]과 같다. 제7조(지식창업 트랙 운영) ① 학생들이 스스로 진로를 설계하고 창업과 진로를 열어갈 수 있도록 사회적 문제의 인식과 창의적 문제해결 역량 강화를 위한 지식창업 트랙을 운영한다. ② ‘지식창업 트랙’ 신청자는 지식창업교양 6학점, 지식창업심화교양 6학점, 지식창업심화전공 6학점을 포함하는 18학점을 이수 해야 한다. 지식창업 트랙 교육과정은 [표4]와 같다. [표4] 지식/창업트랙 교육과정 편성표 제8조(대학원 과목의 이수) ① 3학년까지의 평균 평점이 3.5 이상인 학생은 컴퓨터공학과 학부 학과장의 승인을 받아 학부 학생 의 이수가 허용된 대학원 교과목을 통산 6학점까지 이수할 수 있으며, 그 취득학점은 전공선택으로 인정한다. ② 또한, 대학원 시행세칙에 따라 본교의 학사학위과정 재학 중 본교의 일반대학원에서 개설한 교과목을 이수하여 B학점 이상 취득한 경우에는 학사학위 취득에 필요한 학점의 초과분에 한하여 제 1항의 절차를 거쳐 6학점 이내에서 대학원 진학 시에 대학원 학점으로 인정받을 수 있다. 제 4 장 졸업이수요건 제9조(졸업이수학점) ① 컴퓨터공학전공은 최소 졸업이수학점은 130학점이다. ② 교양학점은 후마니타스 교양교육과정을 만족하여야 한다. ③ 졸업논문을 포함하여 해당 졸업이수요건을 충족시켜야 한다. 제10조(컴퓨터공학 졸업이수요건) ① 단일전공과정:컴퓨터공학과 학생으로서 단일전공자는 전공기초 12학점, 전공필수 42학 점, 산학필수 12학점, 전공선택 15학점을 포함하여 전공학점 81학점 이상 이수하여야 한다. 7 Ⅶ. 소프트웨어융합대학 교육과정"}
{"id": "2848806f70834499883b6b6631f7c2a4", "source": "sw_pdf.pdf", "page": 8, "text": "② 다전공과정:컴퓨터공학과 학생으로서 타전공을 다전공과정으로 이수하거나, 타학과 학생으로서 컴퓨터공학전공을 다전공과정으 로 이수하는 학생은 전공기초 9학점, 전공필수 27학점, 전공선택 15학점을 포함하여 전공학점 51학점 이상 이수하여야 한다. ③ 부전공과정:컴퓨터공학전공을 부전공과정으로 이수하고자 하는 자는 전공필수 15학점을 포함하여 전공학점 21학점을 이수 하여야 한다. ④ 전공과목의 영어강좌 3과목 이상 이수를 졸업요건으로 충족해야 한다. 제11조(졸업능력인증제도) 졸업능력인증제도는 폐지하며, 경과조치를 따른다. 제12조(편입생 전공이수학점) ① 편입생은 전적대학에서 이수한 학점 중 본교 학점인정심사에서 인정받은 학점을 제외한 나머지 학점을 추가로 이수하여야 한다. ② 교과목의 선·후수 관련, 편입학생에 한하여 교과목 담당교수가 인터뷰를 통하여 선수과목의 필요 여부를 판단하여 선수과목 미이수 학생에 대하여 수강을 허용할 수 있다. 제13조(영어강좌 이수학점) 2008학번 이후 신입학생의 경우에는 전공과목의 영어강좌 3과목 이상을 이수해야 졸업요건이 충족 되며, 편입생의 경우에는 전공과목의 영어강좌 1과목 이상을 이수해야 졸업요건에 충족된다. 단, 전공과목이라 함은 이수구분이 전공기초, 전공필수, 산학필수, 전공선택인 과목을 의미한다. 제14조(졸업논문) 컴퓨터공학과의 ‘졸업프로젝트’를 이수하는 것으로 경희대학교 졸업을 위한 “졸업논문” 합격으로 인정한다. 단, “졸업논문(컴퓨터공학)”을 필히 수강 신청하여야 한다. 제15조(SW교육 졸업요건) 2018학년도 이후 입학생(편입생, 순수외국인 제외)은 후마니타스칼리지나 단과대학에서 개설되는 SW교양 또는 SW코딩 교과목에서 총 6학점을 이수하여야 한다. SW교양 및 SW코딩 교과목 개설 및 운영에 관한 세부사항은 소프트웨어 교육교과운영시행세칙을 따른다. 제 5 장 기 타 제16조(보칙) 본 내규에 정하지 않는 사항은 컴퓨터공학과 학과회의 의결에 따른다. 제17조(마이크로디그리 이수) 마이크로디그리 과정을 이수하고자 하는 자는 ‘[별표6] 마이크로디그리 이수체계도’에서 지정한 소 정의 학점을 충족하여야 한다. 제18조(외국인 학생의 한국어 능력 취득) 한국어트랙 외국인 학생은 졸업 전까지 한국어능력시험(TOPIK) 4급 이상을 취득하여 야 한다. 부 칙 제1조(시행일) 본 시행세칙은 2025년 3월 1일부터 시행한다. 제2조(경과조치) ① 2010학번 이후 학생 중 컴퓨터공학을 단일전공 또는 다전공하는 학생들은 응용과학대학 교육과정인 ‘물리학 1’ 및 ‘물리학실험’을 ‘물리학및실험1’로 대체 인정한다. ② 2009년 이후 2017년 이전 입학생 중 컴퓨터공학과 단일전공과정과 다전공과정의 졸업 이수 요건을 전공기초 21학점으로 변경한다. ③ 제외된 전공기초 이수교과목(미분적분학2, 물리학및실험2, 일반화학, 일반생물) 대신 전공 교과목의 추가이수를 권장한다. ④ 2017학번 이전 학생 중 전공필수인 ‘시스템분석및설계’를 수강하지 않은 학생은 ‘소프트웨어공학’ 이수를 전공필수로 인정할 수 있다. 8 2025학년도 교육과정"}
{"id": "a3cefc901ffe44939bb4bbd47a411998", "source": "sw_pdf.pdf", "page": 9, "text": "⑤ 2017년도 이전 입학생의 경우, 각 학번별 선수과목 대신 [별표2]의 선수과목 지정표에 따른 선수과목을 따를 수 있다. ⑥ 컴퓨터공학과를 다전공으로 이수하고자 하는 학생은 응용과학대학 교육과정인 ‘미분적분학 1’을 ‘미분적분학’으로 대체 인정한다. ⑦ 컴퓨터공학과에 전과한 학생은 응용과학대학 교육과정인 ‘미분적분학1’을 ‘미분적분학’으로 대체 인정한다. ⑧ 컴퓨터공학과 전공기초 교과목은 타 단과 대학의 다음의 [별표4]의 유사 교과목으로 대체 가능하다. ⑨ 2018학년도 이후 컴퓨터공학과를 부전공으로 이수하고자 하는 학생 중 부전공 전공필수 및 전공선택 교과목이 단일전공 및 다전공의 전공기초 및 전공필수 교과목과 중복되는 경우 최대 2과목에 한하여 컴퓨터공학과 단일전공의 전공필수 및 전공선 택 교과목으로 대체 이수를 인정한다. ⑩ 2023학년도 이전 입학생의 경우, 전공필수 교과목인 IT기술영어1/2/3의 폐지에 따라 미이수자에 한해 임의의 전공선택 교과 목을 IT기술영어1/2/3의 전공필수 대체교과목으로 인정한다. 단, IT기술영어1/2/3을 모두 이수하였을 경우 이에 해당되지 않 으며, 부분 이수한 경우 해당 학점은 전공선택 학점으로 인정한다. ⑪ (졸업능력인증제 폐지에 따른 경과조치) 졸업능력인증제 폐지는 2023학년도부터 모든 재적생에서 적용하되, 2023.03.01. 이전 수료자는 희망자에 한하여 이수면제 처리한다. [표5] 입학년도에 따른 컴퓨터공학과 졸업이수 요건표 [별표] 1. 교육과정 편성표 1부. 2. 선수과목 지정표 1부. 3. 대체과목 일람표 1부. 4. 전공기초 교과목 강좌 대체 이수 인정 교과목 1부. 5. 컴퓨터공학과 교과목 해설 1부. 6. 빅데이터 분석 마이크로디그리 이수체계도 1부. 7. 컴퓨터공학과 전공능력 1부. 8. 자유전공학부 학생을 위한 컴퓨터공학과 전공 권장 이수 체계도 1부. 9 Ⅶ. 소프트웨어융합대학 교육과정"}
{"id": "60cf13cf3ff64079805a7749310512a1", "source": "sw_pdf.pdf", "page": 10, "text": "[별표1] 컴퓨터공학과 교육과정 편성표 10 2025학년도 교육과정"}
{"id": "23890fbc1c3c47779156706dd36a711b", "source": "sw_pdf.pdf", "page": 11, "text": "1) 창업현장실습, 단기현장실습/장기현장실습은 각 활동별로 3학점, 6학점, 9학점, 12학점을 산학필수 학점으로 이수함 ※ 비고의 ‘포’는 포트폴리오 교과목으로서, 반드시 교과목내 결과물을 개발하고, 학부 과정 동안 개인 실적으로서 관리해야 함 11 Ⅶ. 소프트웨어융합대학 교육과정"}
{"id": "de8f47c0e1f347de85318e133f76d193", "source": "sw_pdf.pdf", "page": 12, "text": "[별표2] 컴퓨터공학과 선수과목 지정표 ※ 우측 선수과목 수강 시에 좌측 후수과목 수강을 허용함 12 2025학년도 교육과정"}
{"id": "2dddc5c3536a4a0f9144c47d5aed4418", "source": "sw_pdf.pdf", "page": 13, "text": "[별표3] 대체과목 일람표 13 Ⅶ. 소프트웨어융합대학 교육과정"}
{"id": "46176193b81d446d953217a9bf300789", "source": "sw_pdf.pdf", "page": 14, "text": "[별표4] 전공기초 교과목 강좌 대체 이수 인정 교과목 14 2025학년도 교육과정"}
{"id": "35953a1dc66a4bd9a71dae438e66fb2e", "source": "sw_pdf.pdf", "page": 15, "text": "[별표5] 컴퓨터공학과 교과목 해설 ∙미분방정식 (Differential Equations) Homogeneous와 non-homogeneous Linear Differential Equations의 해, 미분방정식의 응용, Laplace transformation, Inverse transform, Series Solutions of Differential Equations 등을 공부한다. In this course, we will study Differential Equations(in means the ordinary differential equations) and their applications. Moreover, we will consider the elementary course of Fourier Series. ∙선형대수 (Linear Algebra) 역행렬, 선형계, 행렬식, 가우스 소거법, 내적, 벡터공간, 일차독립, 기저, Kernel and range, 선형변환, Eigenvalues and Eigenvectors, 대각화, 최소자승법 등을 공부한다. The course treats linear systems, Gaussian elimination, inverse matrix, determinant, inner product, vector space, linear independence, basis, kernel and range, linear transformations, eigenvalues and eigenvectors, diagonalization, and least-square method. ∙미분적분학 (Calculus) 일변수 함수의 미분, 적분 이론과 그 응용에 대하여 공부한다. In this course, we study the derivatives and integral theories of functions(functions of one variable), the partial derivatives of functions of several variables, and their applications. ∙확률및랜덤변수 (Probability and Random Variables) 전산학에서 응용할 수 있는 제반 기초 이론을 습득하고 실제적인 응용 확률통계와 통계 소프트웨어 패키지를 사용하는 방법을 익힌다. This course studies basic probability and random variable theories that can be used in the field of computer engineering, and also introduces statistics theory and software packages. ∙객체지향프로그래밍 (Object-Oriented Programming) 객체지향 프로그래밍 기초에서 배운 데이터 형, 입출력, 선택문, 반복문, 함수, 배열, 포인터, 문자열 등을 기본으로 하여 클래스, 함수 오버로딩, 연산자 오버로딩, 상속, 가상함수, 템플릿, 네임스페이스 등의 고급 객체지향 프로그래밍 기법을 배우고 이를 실습을 통해 익힌다. Based on the basic knowledge of object-oriented programming such as data type, I/O, selection, iteration, function, array, pointer, string, etc., this course provides advanced techniques on object-oriented programming like class, function overloading, operator overloading, inheritance, virtual function, template, name space. ∙컴퓨터구조 (Computer Architecture) 컴퓨터 구조 설계의 기초 이론으로써 기본적인 컴퓨터 시스템의 구성과 설계에 대한 개념과 기법을 소개한다. 데이터의 표시방법, 레지스터의 전송과 마이크로 동작, 컴퓨터 소프트웨어를 포함하여 연산장치, 제어장치, 입출력장치의 구조와 설계기법을 학습함으로 써 컴퓨터를 설계할 수 있는 지식을 습득하고 명령포맷, CPU 내부구조, 하드 와이어드 제어에 의한 제어 유닛 설계, 마이크로프로그 램 제어에 의한 제어 유닛 설계, 인터럽트, DMA 등에 의한 I/O 처리 기술을 배운다. 이 과목을 수강하기 전에 논리회로를 수강할 것을 권고한다. Basic concepts of computer architecture and organization include data representation, register transfer, micro- operation, system software etc. This course studies on I/O interface techniques which include instruction format, CPU structure, control unit design using hardwired-control and micro-programmed control, interrupt, DMA. 15 Ⅶ. 소프트웨어융합대학 교육과정"}
{"id": "f39383d9ca0b40e38a994dbf5f41a6bf", "source": "sw_pdf.pdf", "page": 16, "text": "∙자료구조 (Data Structures) 자료 추상화, 배열, 리스트, 스택, 큐, 트리, 그래프 등의 자료구조와 그러한 자료구조를 활용할 수 있는 알고리즘을 배운다. 이 과목 을 통해서 학생들은 전산학의 지식을 확대하고 프로그래밍 기술을 향상시킬 수 있다. This course focuses on data abstraction, data structures such as array, list, stack, queue, tree, graph and algorithms that utilize those data structures. From this course, the students can expand their knowledge of computer science and sharpen their programming skills. ∙운영체제 (Computer Operating System) 운영체제는 사용자 프로그램의 수행과 주변장치나 기억공간과 같은 다양한 자원 할당을 감시한다. 이 과목에서는 멀티프로그래밍, 시분할, 그리고 비동기적 프로세서의 개념을 소개한다. 특히 동기화, 스케쥴링, 교착, 메모리관리, 가상메모리관리, 파일 시스템, 디 스크 스케쥴링, 정보공유, 보호/보안 및 분산운영체제와 같은 주제를 중점적으로 학습한다. Operating systems monitor the execution of user programs and the allocation of various resources such as memory space and peripheral devices. In this class, we introduce the basic concepts of multiprogramming, timesharing and asynchronous processes. The course focuses on synchronization, scheduling, deadlock, memory management, virtual memory management, file system, disk scheduling, information sharing, protection and security, and distributed operating system. ∙컴퓨터네트워크 (Computer Networks) 컴퓨터 네트워크를 구성하는 각종 네트워킹 장치들의 계층 모델, 특성, 동작 방법, 그리고 운용 기술에 대하여 학습한다. 또한 이들 장치를 상호 연결한 인터네트워크의 구성과 동작 방법에 대하여 소개한다. 본 과목의 수강을 통하여 컴퓨터 네트워크의 구성과 동작 방법에 대하여 소개한다. 본 과목의 수강을 통하여 컴퓨터 네트워크의 7계층 구조와 인터넷 4계층 구조를 이해할 수 있고, 간단한 LAN(Local Area Network)을 설계할 수 있으며, 계층 모델을 기반으로 한 컴퓨터 네트워크의 이론적 이해 및 분석력을 함양함으로 써 컴퓨터 네트워킹 개념에 대한 이론과 실용 기술을 체득할 수 있다. This course deals with layered models, characteristics, operations and management of networking devices. Also, the course introduces to the internetworking among networked devices. Students through this course can understand about configuration of computer network and its operations. As a core architecture, this course deals with OSI 7 layers and 4 layered architecture for Internet. So, students can obtain the capability to design LANs through theoretical understanding and analytical learning. ∙알고리즘 (Algorithms) 알고리즘의 기본적인 이해를 하고 대표적인 알고리즘의 형태를 배운다. 알고리즘 유형을 divide-and-conquer, dynamic programming, greedy algorithms, branch-and-bound 등으로 분류하고, 각각의 특성을 이해하도록 한다. 아울러 기본적인 복잡 도 문제를 살펴본다. 본 과목을 이수 후 새로운 문제에 대한 해결 알고리즘을 설계할 수 있는 능력을 키운다. Basic understanding of algorithms and characteristics of algorithm types are learned. The types of algorithms are classified into divided-and-conquer, dynamic programming, greedy algorithms, branch-and-bound, searching, etc and each characteristic is understood. In addition, we look at the basic complexity issues. After completing this course, students will develop the ability to design algorithms to new problems. ∙데이터베이스 (Database) 데이터베이스 시스템을 이루는 기본 구성 요소에 대한 이론을 소개하고, ER-모델 및 관계데이터 모델을 중심으로 한 데이터베이스 설계 이론과 동시성 제어, 회복, 트랜잭션 관리와 같은 데이터베이스 관리 시스템을 구현하는 이론을 소개한다. This course is to provide the basic understanding about database systems and introduce database design techniques based on ER-model and relational data model. It also deals with theoretical issues for implementing DBMS(Data Base Management Systems) such as concurrency control, recovery, and transactions managements. 16 2025학년도 교육과정"}
{"id": "25a7e7d271604ecd973b6ebc563b8136", "source": "sw_pdf.pdf", "page": 17, "text": "∙소프트웨어공학 (Software Engineering) 소프트웨어 공학 분야는 프로그램이 방대하고, 오랜 기간 동안 많은 프로그래머들이 참여하는 경우 발생되는 문제를 다룬다. 본 강 좌에서 학습하는 분야는 프로그래밍 프로젝트의 설계와 구성, 시험과 프로그램 신뢰도, 소프트웨어 비용의 성격과 발생원인 인지, 여러 프로그래머간의 협조, 사용자 친화적 인터페이스 설계 및 문서화 등이다. The field of software engineering deals with problems that arise when programs are large, when they involve many programmers, and when they exit over long periods of time. Topics will include organizing and designing a programming project, testing, and program reliability, identifying the nature and sources of software costs, coordinating multiple programmers, documentations and design of friendly use interfaces. ∙졸업논문 (Graduation Thesis) 컴퓨터공학과는 캡스톤디자인과 졸업프로젝트를 이수하는 것으로 졸업을 위한 “졸업논문” 합격 여부를 결정한다. Bachelor of Engineering in Computer Engineering decides acceptance of graduation thesis by completing Capstone Design and Graduation Project. 컴퓨터,멀티미디어,인터넷,인공지능등 컴퓨터 전 분야에 관련된 새롭고 다양한 주제를 개인별로 교수들과 심도 있게 학습할 수 있는 기회를 제공한다.교 과 진행방법은 관심 주제에 대한 세미나,산업 현장 인턴실습,실제 프로젝트 수행,연구논문 작성 등이다.캡스톤디자인 을 수강한 학생들이 다음 학기에 수강하는 과목으로 캡스톤디자인에 이어서 연구 활동을 계속해 나가며,지정된 날 computer, includes the to Design, 컴퓨터,멀티미디어,인터넷,인공지능등 컴퓨터 전 분야에 관련된 새롭고 다양한 주제를 일정 소규모의 학생들이 그룹을 형성하여 교수들과 심도 있게 학습 할 수 있는 기회를 제공한다.교과 진행방법은 관심 주제에 대한 세미나,산업 현장 인턴실습,실제 프로젝트 수행,연 구논문 작성 등이다.이 과목을 효과적으로 수행하기 위해서 학생들은 학기 초에 관심분야에 대한 학업 계획서를 작 computer, course efficiently study ∙논리회로 (Logic Circuit) 디지털 논리회로의 기본요소인 논리소자 특성 이해 및 디지털 논리회로(조합회로, 순서회로)에 대한 설계방법을 익혀 실제적 응용 디지털 회로설계와 컴퓨터의 기본구조 설계에 관해 학습한다. This course introduces design and implementation of digital logic circuits. By understanding of logic device property and design method in digital system, it focuses on basic design for computer architecture and practical digital circuit 17 Ⅶ. 소프트웨어융합대학 교육과정"}
{"id": "356308bf9f8f4f108013310fd44d931d", "source": "sw_pdf.pdf", "page": 18, "text": "using combinational and sequential circuit. ∙웹/파이선프로그래밍 (Web/Python Programming) 웹 프로그래밍과 파이선 프로그래밍의 기초적인 내용을 배우도록 한다. 웹 프로그래밍은 HTML5/CSS3/Javascript를 사용하는 WebApp을 개발함으로서, 클라이언트 개발을 가능하게 한다. 아울러 Node.js를 통한 서버 프로그래밍까지 할 수 있도록 한다. 파이선은 기초 문법에 대한 이해를 수행할 수 있도록 한다. Learn the basics of Web programming and Python programming. Web programming enables client development by developing WebApp using HTML5/CSS3/Javascript. It also allows server programming through Node.js. Python makes it possible to understand basic grammar. ∙오픈소스SW개발방법및도구 (Opensource Software Development Methods and Tools) 소프트웨어 개발을 위한 방법론과 도구에 대해서 오픈소스 소프트웨어를 기반으로 학습하며, 리눅스 운영체제에 대한 프로젝트를 수행한다. 소프트웨어 개발 방법론은 최근에 가장 많이 쓰이고 있는 Agile 개발 방법에 대해서 학습하며, 이를 소프트웨어 산업에서 적용하는 다양한 활용 방법에 대해서 학습한다. 소프트웨어 개발 도구는 오픈소스 소프트웨어를 중심으로 하여, 소프트웨어의 설계, 개발, 시험, 검증, 팀작업 등의 전반적인 부분에서 활용 가능한 도구에 대해서 학습한다. 또한 리눅스 운영체제를 한 학기 동안 직접 설치하고 활용함으로써, 이후 소프트웨어융합학과의 교육과정에서 리눅스를 활용하는 기본 능력을 함양한다. Learn about methodologies and tools for software development, and work on projects for the Linux operating system. The software development methodology learns about the agile development method, which is used most recently, and the various application methods applied to the software industry. Software development tools focus on open source software, and learn about tools that can be used in the overall aspects of software design, development, testing, verification, and team work. In addition, by installing and using the Linux operating system directly for one semester, students will develop the basic ability to use Linux in the course of software convergence. ∙기계학습 (Machine Learning) 기계학습은 지능적인 응용 시스템을 구축할 수 있는 기반이 되었다. 본 과목에서는, 기본적인 기계학습 알고리즘을 소개하는 것을 시작으로, 실제 응용을 중심으로 다양한 기술과 이론을 소개한다. 이러한 알고리즘의 사용 사례와 제한 사항들에 대한 논의를 진행 하고, 프로그래밍을 통해 훈련과 검증 과정을 구현한다. Machine learning has become a pillar on which you can build intelligent applications. This course will begin with the introduction of basic machine learning algorithms, and various techniques and theories are introduced with a focus on practical applications. The use cases and limitations of these algorithms will be discussed, and training and validation will be implemented with programming language. ∙인공지능프로그래밍 (AI Programming) 이 과목에서는 인공지능 수학에서 배우는 인공지능을 위한 수학적 개념을 실제로 컴퓨터로 구현한다. 이를 위해 NumPy, Tensorflow, Pytorch와 같은 기본적인 파이썬 라이브러리를 학습하고, 기본적인 신경망을 구현할 수 있는 능력도 기른다. This course aims at giving how to implement mathematical concepts for artificial intelligence. For this, the students learn basic Python libraries such as NumPy, Tensorflow, and Pytorch, and they also study how to construct some simple neural networks using the libraries. ∙고급딥러닝 (Advanced Deep Learning) 기본적인 CNN, RNN 등의 딥러닝 토픽을 학습한 후, Tansformer 등의 최신 딥러닝 토픽을 배운다. 컴퓨터비전과 자연언어처리에 대한 딥러닝 응용을 통해 실질적 문제 해결에 딥러닝을 적용한다. This course offers hot topics of deep learning such as Transformer after providing some basic topics about deep learning including CNN and RNN. It allows the students to apply the learned deep learning techniques to real world problems in computer vision and natural language processing. 18 2025학년도 교육과정"}
{"id": "94cd338130a2446284219244f230e7a6", "source": "sw_pdf.pdf", "page": 19, "text": "∙빅데이터프로그래밍 (Big Data Programming) 대량의 정형 또는 비정형 데이터의 집합체인 빅데이터의 5V(규모, 다양성, 속도, 정확성, 가치) 요소에 대해 학습하고, 빅데이터로부 터 가치를 추출하고 결과를 분석하기 위한 하둡의 맵리듀싱에 대해 학습한다. Learn 5V elements(Volume, Variety, Velocity, Veracity, Value) of Big Data, a collection of large quantities of structured or unstructured data, and learn Hadoop and MapReducing for extracting values from Big Data and analyzing results. ∙실감미디어컴퓨팅기초 (Immersive Media Computing Fundamental) 본 교과목은 실감미디어 기술 및 콘텐츠 구현을 위해 필요한 컴퓨팅 기술을 대한 기초를 다루는 컴퓨팅 개론 수업이다. 본 수업은 컴퓨터 기반 실감미디어 도구들을 사용하기 위해서 이해해야 하는 컴퓨팅의 기초 지식 및 컴퓨팅적 사고를 기반으로, 실감미디어 도구들에서 사용하는 여러 컴퓨팅 언어들에 대한 개론적인 코딩 학습을 다룬다. This course is an introductory computing class dealing with the basics of computing technology necessary for realizing immersive media technology and contents. This class covers the basic knowledge of computing and computational thinking that must be understood in order to use computer-based immersive media tools as well as an introductory coding training for various computing languages ​​used in the tools. ∙이산구조 (Discrete Structures) 수학적인 관점에서 논리적인 디지털 컴퓨터 구조를 이해하기 위해 형식논리, 알고리즘 증명, 재귀, 집합, 순열과 조합, 이항정리, 이진관계, 함수 및 행렬, 그래프, 트리, 그래프 알고리즘, 프로그램의 검증, 부울 대수와 컴퓨터 논리 등에 관하여 배운다. In order to understand the logical structure of digital computer from mathematical viewpoints, this course is designed to learn formal logic, proof of algorithm, recursion, set, permutation and combination, binomial theorem, binary relation, function and matrix, graph, tree, graph algorithm, program verification, Boolean algebra, and computer logic. ∙UI/UX프로그래밍 (UI/UX Programming) 본 교과목은 UI/UX 프로그래밍에 필요한 모든 과정을 순차적으로 학습하고, 실제 인터페이스 구현에 적용해 보는 수업이다. 우선, UI/UX의 정의 및 최적의 사용자 경험을 제공하기 위한 필요한 요소들에 대한 이론적인 배경을 배우고, 이를 달성하기 위해 따라야 하는 디자인 프로세스에 대한 실습을 수행한다. 또한, 인터페이스 프로그래밍 관련 기초 프로그래밍 기술을 학습하여, 수업 프로젝 트를 통해 학생이 스스로 모든 과정을 직접 겪어보는 학습과정을 거친다. This course aims to learn all the steps required for UI/UX programming sequentially and applies it to real interface implementation. First, students will learn the theoretical background about the definition of UI/UX and the necessary factors to provide the optimal user experience, and conduct a practical training on the design process to achieve this. In addition, students will learn basic programming skills related to interface programming, and through the class project, the student goes through a process of learning all of the processes themselves. ∙컴파일러 (Compiler) 컴퓨터과학의 근간을 이루는 컴파일러의 개념을 배운다. 구체적으로, 어휘분석, 구문분석, 언어의 문법적 표현과 분류, 유한상태 기 계, push-down 자동장치, 정규언어, 파싱 기법의 요소들을 이해하고 응용할 수 있는 능력을 키운다. Students learn the concept of a compiler, which is the basis of computer science. Learn the relationship between compilers and formal languages. Specifically, it develops the ability to understand and apply the elements of lexical analysis, syntax analysis, grammatical expression and classification of language, finite state machine, push-down automata, regular language, and parsing technique. ∙메타버스시스템 (Metaverse System) 메타버스 시스템은 인간의 오감과 관련된 데이터를 처리하는 방법에 대한 기본적인 방법론을 다루는 과정이다. 본 과정은 메타버스 시대에 멀티미디어 데이터를 서로 교환하는 메타버스 시스템을 구현하기 위한 각 기본 기능(이미지, 그래픽, 애니메이션, 비디오, 사운드, 오디오)에 대한 개념적 접근을 수행한다. 19 Ⅶ. 소프트웨어융합대학 교육과정"}
{"id": "cb9098fb4c994f5eae7708e706032506", "source": "sw_pdf.pdf", "page": 20, "text": "Metaverse system is the process of dealing with basic methodologies on how to handle data related to human five senses. This course conducts a conceptual approach to each basic function (image, graphics, animation, video, sound, audio) to implement a metaverse system that exchanges multimedia data with each other, in the metaverse-era. ∙프로그래밍언어론 (Programming Languages) 이 과목은 프로그래밍 언어의 기본적인 개념을 다루는데, 1)다양한 언어 구조에 대한 설계 문제들을 토의하고, 2)그런 구조들을 일 반적인 언어에서는 어떻게 설계 선택을 했는지 조사하며, 3)설계 선택 대안들을 비교하는 내용으로 구성된다. This course treats the fundamental concepts of programming languages by 1) discussing the design issues of the various language constructs, 2) examining the design issues in these constructs, and 3) comparing design alternatives. ∙SW스타트업비즈니스 (SW Start-Up Business) 실리콘벨리의 수많은 성공한 창업가들이 컴퓨터공학과 출신으로 이미 컴퓨터공학은 창업가들로 하여금 가장 핵심적이고 중요한 기 술로 부각되고 있다. 구글, 마이크로소프트, 샤오미 등에서 제시하는 차세대 기술에 대해 연구하고 이러한 기술을 기반으로 한 모의 창업을 통해 졸업 후 사업가 역량을 배양한다. Many successful entrepreneurs major computer engineering from the Silicon Valley. Computer engineering has emerged as the most critical and important skills of entrepreneurs. This course researching on a next-generation technology proposed by Google, Microsoft and Xiaomi. Students simulate a mock business based on research result and improve business skills needed at the company after graduation. ∙딥러닝 (Deep Learning) 딥러닝의 배경지식인 기초 수학(선형대수, 확률, 정보이론)을 리뷰하고, 기본 개념과 다양한 딥러닝 기술의 이론 지식을 학습한다. Basic mathematics(linear algebra, probability, information theory), which is a background knowledge of deep learning, is reviewed. Students learn the concepts and theoretical knowledge of various deep learning technologies. ∙리눅스시스템프로그래밍 (LINUX System Programming) 가장 널리 사용되고 있는 운영체제 중의 하나인 LINUX 환경에서의 프로그램 개발 환경을 습득하여, UNIX 전문가로서의 계기를 제 공한다. LINUX 사용법 및 개발환경에서 시작하여, file I/O, file & directory, process & thread, signal, IPC, synchronization, socket 등의 고급 프로그래밍 기법을 LINUX system call을 직접 사용함으로써 실습한다. This course provides an opportunity for a LINUX expert. First, various development tools in UNIX are presented such as vi, make, gcc, gdb. Next, this course introduces various LINUX system calls and gives a lot of programming practices on file I/O, file & directory, process & thread, signal, IPC, synchronization, and sockets. ∙SW스타트업프로젝트 (SW Start-Up Project) 산업사회가 고도화되면서 창업의 비중이 점차 높아지고 있는 추세이다. 오픈소스SW를 기반으로 창업아이템 선정, 사업기획, 제품샘 플 개발까지의 일련의 과정을 포함한 모의창업을 연계하여 실제 창업 프로세스를 경험한다. As the industrial society becomes more sophisticated, the proportion of start-ups is gradually increasing. Based on open source software, students experience the actual start-up process by linking mock startups including a series of processes from startup item selection, business planning, and product sample development. ∙클라우드컴퓨팅 (Cloud Computing) 클라우드 컴퓨팅의 개념을 이해하고 프로젝트를 진행한다. 가상화 기술(Virtual Machine)의 특징을 이해하고 IaaS, PaaS, SaaS 등 의 개발 프로젝트를 진행한다. 아마존과 구글의 클라우드 서비스 활용 방법과 PaaS(Azure, Openshift, Cloudfoundry)를 이용한 클라우드 서비스의 개발 실습과 OpenStack을 통한 가상 자원의 프로비저닝 및 운영기술에 대한 실무를 배양한다. Understand the concept of cloud computing and proceed with the project. Understand the features of virtual machine and develop projects such as IaaS, PaaS, SaaS. Learn how to use cloud service of Amazon and Google and cloud 20 2025학년도 교육과정"}
{"id": "1245a56ab36c4aae9dead39bdbfece33", "source": "sw_pdf.pdf", "page": 21, "text": "service development practice using PaaS(Azure, Openshift, Cloudfoundry) and cultivate practical skill of provisioning and operating virtual resources through OpenStack. ∙실전기계학습 (Machine Learning in Action) 딥러닝/머신러닝 기본 지식을 실제 문제에 응용할 수 있는 실습 과목이다. 학생들은 머신러닝/딥러닝 기본 모델링 기법을 배우고 프로젝트/competition에 참여하여 다양한 실전 경험을 쌓는다. This course learns how to apply machine learning and deep learning technology to practical applications. The course allows the students to learn basic models and optimization techniques by participating Kaggle-based challenges and performing projects for practical applications. ∙블록체인 프로젝트 (Blockchain Project) 블록체인 강의에서 배웠던 이론을 토대로 실제 서비스화가 가능한 수준의 블록체인 서비스를 개발해봅니다. 지갑과 연결하기, 스마 트 컨트랙트 개발하기, 스마트 컨트랙트와 연결된 웹서비스 제작해보기를 통해 서비스하기 위한 기반 기술에 대해 실습하며, 최종적 으로는 수강생들이 원하는 서비스를 완성해 봅니다. Based on the lessons learned in the previous blockchain lecture, students will develop a production-ready blockchain service. By connecting to a wallet, developing a smart contract, and creating a web service connected to a smart contract, students will practice the basic technology for service, and finally build the service that they want. ∙정보보호 (Information Security) 본 과정에서는 네트워크보안의 기본개념과 암호화 알고리즘, 인터넷보안 메커니즘과 무선망 보안등에 대하여 다룬다. 그리고 국내외 보안기술표준화동향 등에 대해서도 강의한다. Students learn about the basic concepts of network security, Internet security mechanism, and security for wireless networks through this course. In order to provide the opportunity for understanding the state-of-art security technology, this course also introduces the current domestic and international standardization status. ∙영상처리 (Image Processing) 2차원 신호인 디지털영상신호의 표현, 영상신호처리의 기본 단계, 영상신호처리 시스템의 요소, 디지털영상의 기초, 푸리에 변환, FFT, DCT를 포함한 영상변환, 영상신호의 향상 및 영상신호의 복구에 대하여 강의한다. This course teaches representation of 2D digital image signal, basic processing steps of image signal, elements of image signal processing system, image transform including Fourier transform, FFT and DCT, enhancement and restoration of image signal. ∙컴퓨터그래픽스 (Interactive Computer Graphics) 2D와 3D 객체의 생성과 디스플레이를 위한 기본적인 기술들을 소개한다. 주요 강의 내용은 그래픽스를 위한 자료구조, 그래픽 프로 그래밍 언어, 기학학적 변환, shading, 가시화 등을 포함한다. This course introduce techniques for the interactive generation and display of two and three dimensional objects. The topics to be covered will include data structure for graphics, geometric transformation, shading, visualization, and languages for graphics. ∙메타버스데이터처리 (Metaverse Data Processing) 메타버스 시대에는 모든 데이터가 100% 압축된 상태로 서로에게 전달된다. 압축된 데이터 중 가장 큰 데이터는 메가 데이터인 비디오 데이터이다. 비디오 데이터는 2K-4K에서 8K로 매우 사실적인 느낌을 주며 해상도는 NK로 확장된다. 상상할 수 없을 정도 로 많은 양의 데이터를 전송하고 처리하기 위해서는 가장 기본적인 압축을 익힐 필요가 있다. 본 과정은 이미지/오디오/비디오, 손 실/무손실 비디오 압축 방법, JPEG, MPEG 등 국제 표준의 사례 연구 등 메타버스 데이터를 교환하기 위한 기본 알고리즘에 대한 개념적 연구를 수행한다. 21 Ⅶ. 소프트웨어융합대학 교육과정"}
{"id": "9b3a0635f20543a792c6acd7bfe2576a", "source": "sw_pdf.pdf", "page": 22, "text": "In the Metaverse-era, all data is delivered to each other in a 100% compressed state. The largest data among the compressed data is video data as mega data. Video data goes from 2K-4K to 8K for ultra-realistic feel, and resolution is extended to NK. In order to transmit and process an unimaginably large amount of data, it is necessary to learn the most basic compression. This course conducts a conceptual study on the basic algorithms for exchanging metaverse data such as image/audio/video, loss/lossless video compression methods, the case studies of international standards such as JPEG, MPEG, etc. ∙인간-컴퓨터상호작용 (Human-Computer Interaction) 본 과목은 인간-컴퓨터 상호작용 전반에 걸친 기본 원칙들과 그 원칙들의 응용사례들을 소개하는 과목으로 상호작용 가능한 컴퓨터 시스템을 사용자 중심의 방법론 안에서 디자인하는 방법, 그리고 이러한 시스템을 사용성 측면에서 평가하는 방법을 배우게 된다. 특히, 컴퓨터 공학은 물론 인지과학, 사회과학, 상호작용 디자인 등 여러 학문분야가 다양하게 유기적으로 연결되어 있는 학문으로 써, 본 과목에서 다룰 기본 원칙과 방법론들은 상호작용 가능한 모든 소프트웨어 및 하드웨어 시스템에 적용 가능함으로 통신, 협동, 교육, 의료 등 인간들의 삶의 질을 향상시키는데 아주 중요한 역할을 한다고 볼 수 있다. This course aims at introducing basic principles and application examples of human-computer interaction(HCI). The students will learn the way how to design interactive computer systems through a user-centered approach and how to evaluate such systems in terms of usability. The principles, methods, techniques, and tools to be thought in this course are based on diverse areas including computer science, cognitive science, social science, and interaction design. The HCI principles and methods are used in designing and evaluation of most software and hardware systems that interact with human such as education, entertainment, and medical application. ∙빅데이터프로그래밍 (Big Data Programming) 대량의 정형 또는 비정형 데이터의 집합체인 빅데이터의 5V(규모, 다양성, 속도, 정확성, 가치) 요소에 대해 학습하고, 빅데이터로부 터 가치를 추출하고 결과를 분석하기 위한 하둡의 맵리듀싱에 대해 학습한다. Learn 5V elements(Volume, Variety, Velocity, Veracity, Value) of Big Data, a collection of large quantities of structured or unstructured data, and learn Hadoop and MapReducing for extracting values from Big Data and analyzing results. ∙빅데이터프로젝트 (Big Data Project) 전통적으로 우리는 주로 RDBMS에서 구조화된 데이터로 작업해 왔지만, 현재에는 금융, 병원, 범죄, 날씨 등 다양한 분야에서 다양 한 유형의 데이터들이 발생하고 있습니다. 수많은 데이터를 처리하기 위해 데이터 엔지니어 또는 과학자들은 빅데이터 솔루션의 큰 그림을 이해해야 합니다. 빅데이터 솔루션에는 데이터 수집, 데이터 스토리지, 데이터 분석 및 데이터 시각화 등의 몇 가지 단계 가 있습니다. 위의 단계를 이해하기 위해 학생들은 이 수업에서 빅데이터 프로젝트를 설계하고 다양한 관련 프레임워크를 관리하는 방법을 배우게 됩니다. Traditionally, we have been working with structured data mainly from RDBMS, but in this century, at on of different type logs are coming from various fields, e.g., finance, hospital, crime, weather, etc. In order to handle the abundant logs, data engineers or scientists should understand a big picture of a Big Data solution. There are a few of steps in the Big Data solution : Data Acquisition, Data Storage, Data Analysis and Data Visualization. To understand the steps above, students will learn how to design bigdata projects and manage a variety of related frameworks ∙클라우드프로젝트 (Cloud Project) 인공지능의 보편화를 필두로, 4차 산업혁명이 시작 되었습니다. 4차 산업 혁명의 대표적인 기술에는 인공지능, 사물 인터넷, 빅 데 이터, 블럭체인등이 있습니다. 클라우드 컴퓨팅은 위의 기술들이 확장하기 위해서 뿌리가 되는 중요한 기술입니다. 본 수업에서는 클라우드 컴퓨팅 개념을 시작으로, 산업체에서 활발하게 사용하고 있는 클라우드 컴퓨팅 서비스인 아마존 웹 서비스를 실습합니다. 더불어 클라우드 연계 프로젝트를 위해서 IoT (사물 인터넷)등을 활용하여 연계 프로젝트를 진행합니다. With the generalization of artificial intelligence, the 4th industrial revolution has begun. Representative technologies of the 4th industrial revolution include artificial intelligence, the Internet of Things, big data, and block chains. Cloud 22 2025학년도 교육과정"}
{"id": "790ea8f1365f400695a76e2707bbc10e", "source": "sw_pdf.pdf", "page": 23, "text": "computing is an important technology that is the root of the above technologies to expand. In this class, starting with the concept of cloud computing, we practice Amazon Web Service, a cloud computing service that is actively used in industry. In addition, for cloud-linked projects, we use (IoT (Internet of Things) or AI etc) to carry out the linked project. ∙최신기술콜로키움1 (Latest Technology Colloquium 1) 소프트웨어 기반의 융합 분야에 대한 최신 기술을 해당 분야 전문가를 초청하여 듣도록 한다. 트랙별로 학교 내부와 산업체 전문가 를 초청하게 되며, 학생들은 강연에 대한 요약과 함께, 본인의 진로와 연관된 의견을 보고서로 작성하여 제출한다. 성적은 출석과 보고서에 기반하여 Pass 혹은 Fail로 판단된다. Invite experts from the field to hear the latest technology in the field of software-based convergence. Each track will invite school professionals and industry experts. Students will submit a summary of the lecture, along with a report on their career. The grade is judged to be Pass or Fail based on attendance and report. ∙AIoT디지털시스템 (AIoT Digital System) 소프트웨어와 하드웨어를 포함 하는 임베디드 시스템 환경에서 AI 기반 임베디드 응용에 대한 개발 개념과 이를 구현할 수 있는 FPGA 기반 임베디드 레퍼런스 보드 환경의 사용 및 구현 방법을 다룬다. 이 수업에서는 AI 알고리즘과 이를 이용한 응용 기술에 대해 배우고 이를 임베디드 환경내의 구현 방법을 다룬다. This course provides the development concept for AI-based embedded applications in the embedded system environment including software and hardware, and how to use and implement the FPGA-based embedded reference board environment that can implement it. In this class, we learn about AI algorithms and applied technologies using them, and how to implement them in an embedded environment. ∙AIoT소프트웨어 (AIoT Software) 컴퓨터 공학 기초 과목의 이해를 바탕으로 Embedded System에서의 AIoT 프로그램 개발을 경험한다. 아두이노 프로그래밍에서 시작하여, FreeRTOS를 활용한 RTOS를 다루고, 라즈베리파이에서 커널 프로그래밍을 포함한 임베디드 리눅스를 경험한다. With a basic knowledge on computer engineering, this course gives an experience of AIoT on embedded system. In this course, we start with Arduino programming and develop RTOS programs on FreeRTOS. ∙컴퓨터비젼 (Computer Vision) 본 과목은 사람이 시각 정보를 이용하여 지능적인 판단과 행동을 하는 것과 마찬가지로, 컴퓨터(기계)도 사람과 같이 시각 정보를 획득, 처리하고 이를 이용하여 객체 인식 및 행동 인식과 같은 지능적인 일을 수행 할 수 있도록 하는 최신 연구 분야를 공부한다. 기초적인 영상 분석 및 기계 학습 방법들을 활용하여 Feature Extraction, Visual Tracking, Shape Matching, Pattern Detection, Object Recognition, Gesture Recognition, Scene Understanding 및 3D Reconstruction 와 같은 세부 연구 분야 들을 공부한다. Computer vision is an interdisciplinary research field that deals with how computers can be made for gaining high-level understanding from digital images or videos. In this class we study following topics: Feature Extraction, Visual Tracking, Shape Matching, Pattern Detection, Object Recognition, Gesture Recognition, Scene Understanding, 3D Reconstruction. ∙블록체인 (Blockchain) Web3시대를 열어가는 기반기술인 블록체인에 대해 알아본다. 비트코인 부터 시작된 블록체인의 역사와 이더리움을 거쳐 다양한 Web3 application이 어떤 식으로 진화했는지 앞으로 어떻게 발전해 나갈 수 있을지 알아본다. 또한 간단한 블록체인 프로그래밍을 통해 Web3 application개발을 시작해 본다. Learn about blockchain, the underlying technology for the Web3 era. Learn about the history of blockchain, starting with Bitcoin, and how various Web3 applications have evolved through Ethereum, and how they will evolve in the 23 Ⅶ. 소프트웨어융합대학 교육과정"}
{"id": "151270945ab545dc9bb9cc12fc446ade", "source": "sw_pdf.pdf", "page": 24, "text": "future. You will also learn how to start developing Web3 applications through simple blockchain programming. ∙AI네트워킹 (AI Networking) 본 과정에서는 인터넷프로토콜의 핵심 기술을 다룬다. 또한 SVM, CNN, RNN, 강화학습과 같은 머신러닝의 중요기술을 기반으로 네트워킹 응용을 어떻게 구현할 것인가에 대해 강의한다. 그리고 프로젝트를 통해 수강생들은 AI기반 인터넷 응용과 IoT네트워킹에 대한 설계 능력과 구현능력을 배양한다. In this course, student can learn on the key technology of internet Protocol such as TCP/IP. In addition, it introduces the machine learning algorithms such as SVM, CNN, RNN, etc. Also, the network related applications using machine learning will be learned. Through project, the student can obtain the designing and implementing capabilities of AI based internet application and IoT systems. ∙AIoT네트워크 (AI Internet of Things Network) 본 과목은 사물인터넷과 디지털화, 인공지능이라는 세가지 핵심 개념을 통해 디지털 트랜스포메이션이 어떻게 이루어지는지 강의한 다. 이를 위해 IoT 네트워킹 기술과 4차 산업사회를 주도하는 최신 ICT 기술에 대하여 학습한다. AIoT가 무엇인지, AIoT가 무엇을 하는지, 그리고 AIoT를 통한 디지털화가 4차 산업사회에 어떠한 영향을 주는지에 대한 개념을 기술적 측면에서 논한다. This course teaches how digital transformation is realized through three key concepts: the Internet of Things(IoT) and digitization and Artificial Intelligence(AI). The concept of what the AIoT is, what the AIoT does, and how AIoT digitalization affects the fourth industrial society are discussed from technical points of view. ∙모바일/웹서비스프로그래밍 (Mobile/Web Service Programming) 오픈소스 프로그래밍 개발 환경에서 모바일 및 웹서비스 프로그래밍의 기본 개념을 배우고 여러 응용 프로그래밍을 구현 함으로서 실제 업무에 적용 가능한 실무능력을 향상시킨다, This course is designed for learning a fundamental concept of mobile programming and web-service programming based on the open source development environment. ∙모바일/웹서비스프로젝트 (Mobile/Web Service Project) 모바일 프로그래밍의 응용 프로그래밍을 구현함으로서 실제 업무에 적용 가능한 실무능력을 향상시키고, 최신 적용가능 라이브러리 및 테크닉에 대해 학습한다. 또한 HTML/CSS를 기본으로 하여 javascript을 이용한 Node.js 등과 같은 각종 웹 프레임워크를 이용한 웹서비스 백엔드 및 프런트엔드를 개발하는 실전 프로젝트를 진행한다. This course is designed for developing practical applications of mobile programming with the latest libraries and techniques. Also, this course performs practical projects to develop web service front-end and back-end using HTML/CSS, javascrip, and the diverse web frameworks for Node.js. ∙소프트웨어보안 (Software Security) IT시장이 발달함에 따라 소프트웨어의 복잡성과 규모가 나날이 커지고 있다. 소프트웨어의 복잡도가 높아질수록 Use-After-Free 와 같은 메모리 오류, 권한제어등과 관련한 논리적인 취약점 등 다양한 보안 문제점들이 발생할 수 있는데, 본 과목에서는 소프트웨 어의 개발프로세스 및 관리/운영과정을 포함하여 이러한 문제가 발생하는 원인 및 대응방안을 다룬다. 또한 수강생들의 기술적 이해 도를 높이기 위하여 공격자의 입장에서 가상의 보안취약점을 다뤄보는 실습도 병행한다. Software complexity and its development scale is constantly growing as the IT market expands. Software vulnerabilities such as Use-After-Free memory corruption, logic errors are more likely to exist as the software codebase becomes larger and sophisticated. Addressing such recent issues, this class covers a broad spectrum of security problems that could exist in software development and IT operations (DevOps); and how to mitigate them. In addition to theoretical discussion, the class provides various lab exercise regarding software vulnerabilities for practical/technical experiences. ∙웹보안 (Web Security) 24 2025학년도 교육과정"}
{"id": "ab5ecbf867a041aaa7d1b82f196406bc", "source": "sw_pdf.pdf", "page": 25, "text": "최근의 소프트웨어는 클라우드 및 웹 애플리케이션과 연동되는 형태로 개발되는 경우가 많다. 본 과목에서는 Flask/Django 등에 기반하는 웹 애플리케이션부터, Nginx/Apache 와 같은 웹서버, 및 방화벽 시스템들이 웹 브라우저와 함께 어떻게 상호작용하며 구동되는지 이해하고 그러한 시스템에서 존재할 수 있는 보안문제들을 다룬다. 특히 Server Side Request Forgery (SSRF) 와 같은 몇몇 웹 보안 취약점들은 서버들을 대상으로 하는 클라우드 서비스의 규모가 커짐에 따라 그 위험도가 더욱 높아지고 있는데, 이러 한 공격 기술에 관한 실습도 병행한다. Recent software development often involves interaction with web-application and cloud systems. This class covers security problems in web-applications such as Flask/Django, web servers such as Nginx/Apache and network firewalls in terms of their interaction with client-side web browsers. In particular, Server Side Request Forgery (SSRF) is becoming a more serious threat than before due to the prevalence of cloud-based services. Addressing such recent software security trends, this class provides SSRF-related lab exercises. ∙독립심화학습1/2(컴퓨터공학과) (Individual In-Depth Study 1/2) 논문 작성 및 제출, 특허 출원, 소프트웨어 도서 출간, 첨단 기술 백서 출간 등을 설계 및 진행 Students design his/her own course to write, submit and/or publish a technical paper/patent/books on software/technical white-paper. - 특허 출원 (Patent Writing) : 학생은 지도교수의 지도하에, 본인의 아이디어를 특허화하고, 최종 출원하는 절차를 수행해 본다. 특허 작성을 희망하는 학생은 계획서와 실적서를 제출하고, 실질적인 작성 여부 등에 기반하여 지도교수로부터 P/F 중 적합한 학 점을 부여 받는다. Under the supervision of an advisor, the student will patent his ideas and conduct the final application procedure. A student who wishes to write a patent must submit a proposal and an achievement book, and receive appropriate credits from the advisor based on whether he/she is actually writing or not. - 소프트웨어 도서출간 (Software Books Publishing) : 학생이 컴퓨터공학과 학생 혹은 대외 외부인에게 도움을 줄 수 있는 소 프트웨어 도서를 출간하도록 한다. 도서는 전자도서 형태를 지행하며 오픈소스 형태로 배포되어야 한다. 학생은 작성 계획과 작성 한 도서를 지도교수에게 제출하고, 실질적인 작성 여부 등에 기반하여 지도교수로부터 P/F 중 적합한 학점을 부여 받는다. Have students publish a software book that can be used by computer engineering students or outsiders. Books must be distributed in an open-source format and in electronic form. The student will submit the preparation plan and the book he/she has prepared to the supervisor and receive appropriate credits from the supervisor based on whether the essay is actually written or not. - 첨단 기술 백서 출간 (Published High Technology White-Paper) : 학생이 컴퓨터공학과 학생 혹은 대외 외부인에게 도움을 줄 수 있는 첨단 기술에 대한 도서를 출간하도록 한다. 도서는 전자도서 형태를 지행하며 오픈소스 형태로 배포되어야 한다. 학생 은 작성 계획과 작성한 도서를 지도교수에게 제출하고, 실질적인 작성 여부 등에 기반하여 지도교수로부터 P/F 중 적합한 학점을 부여 받는다. Have students publish books on cutting edge technologies that can help computer engineering students or outsiders. Books must be distributed in an open-source format and in electronic form. The student will submit the preparation plan and the book he/she has prepared to the supervisor and receive appropriate credits from the supervisor based on whether the essay is actually written or not. ∙연구연수활동1/2 (Research Internship in Computer Engineering 1/2) 연구실에서 진행하는 연구에 대한 실무 경험을 통해 전공지식을 응용한다. This course gives a chance to apply research knowledges in laboratories. ∙신호와시스템 (Signals and Systems) 연속 및 이산 신호와 시스템의 수학적 표현기법, 분석 및 신호 합성에 관한 기본 개념과 변환기법을 다룬다. Fourier 변환, Z-변환, Laplace 변환 등을 기초로 한 신호와 시스템 분석 방법에 관한 기본이론 및 필터링, 변조 등의 응용 예를 강의한다. 25 Ⅶ. 소프트웨어융합대학 교육과정"}
{"id": "061174b01f0743fe9f8b003771e86ec7", "source": "sw_pdf.pdf", "page": 26, "text": "Signals and Systems provides basic theory for mathematical modeling and analysis of electrical circuits, communications, control, image processing, and electromagnetics. Signals and systems are analyzed in the time and frequency domains. This course covers basic continuous and discrete time signals, system properties, linear time invariant systems, convolution, continuous and discrete time Fourier analysis. ∙디자인적사고 (Design Thinking) 새로운 소프트웨어 개발을 위한 디자인 중심의 창의적 설계 접근방법과 아이디어 발상을 위한 이론적 프로세스를 팀워크를 통해 학습한다. We will learn the design-oriented creative design approach for new software development and the theoretical process for idea development through teamwork. ∙게임프로그래밍입문 (Introduction to Game Programming) [수강 대상 : 프로그래밍 유경험자(Python/C/C++ )] 간단한 GUI(Graphic User Interface) 환경의 기초적인 게임부터 오픈 소스를 활용한 고전적인 아케이드 게임, 플랫폼 게임 등에 대한 코드 레벨을 이해한 후, 직접 설계 및 개발하는 과정을 통하여 게임 개발에 대한 프로세스를 이해한다. 다양한 환경의 게임을 경험하기 위하여, 충돌 검출 및 반응, 게임 물리, 3D 그래픽, 게임 인공 지능 등에 대한 기초를 경험한다. Understand the code level of basic game of simple GUI(Graphic User Interface) environment, classic arcade game, platform game using open source, and understand the process of game development through the process of designing and developing. In order to experience games in various environments, students will learn the basics of collision detection and reaction, game physics, 3D graphics, game artificial intelligence, and so on. ∙게임엔진기초 (Game Engine Basics) [수강 대상 : 기초적인 프로그래밍(C++, C#, Python 등) 경험이 있는 자] 본 수업은 이론 수업과 실습 수업으로 이루어져 있다. 이론 수업의 목적은 게임 엔진의 전체적인 구조와, 이를 이해하기 위해 필요한 기초 이론들을 학습하는 것이 목표이다. 실습 수업의 목적은 상용 엔진을 실제로 사용하면서 엔진에 대한 이해를 심화하는 것이다. This class comprises of theory part and a practice part. Through the theory part, students will understand the architecture of a game engine and the basic theories used in a game engine. Through the practice part, students will deepen their understanding of the game engine by actually using the commercial game engine. ∙마이크로서비스프로그래밍 (Microservice Programming) 데이터센터에서 마이크로서비스를 개발하고 운영하는 개발 방법론과 도구에 대한 이론을 이해하고 실습을 수행한다. 대표적인 기술 로서 클라우드 컴퓨팅, 컨테이너/오케스트레이션 기술, 마이크로 서비스, DevOps에 대해서 이해하고, 실습을 통해서 직접 데이터센 터의 소프트웨어 개발 환경을 구축하고, 시험/운영하는 능력을 함양한다. Understand and practice theories on microservice development methodologies and tools used in data centers. As a representative technology, students will understand cloud computing, container/orchestration technology, microservices, DevOps, and build the ability to directly build and test/operate the software development environment of the data center. ∙회로와신호 (Circuits and Signals) 이 과목을 통해 학생들은 전자회로 기본소자의 동작원리와 기능을 익히고 기초회로 해석 능력을 습득한다. 또한 연속 및 이산 신호 와 시스템의 수학적 표현기법과 변환기법을 배운다. 수업에서 다루는 개념은 전하, 전류, 전압, 저항, Ohm의 법칙, Kirchoff의 법칙, 직렬/병렬회로, RC/RL/RLC 회로, 연속 및 이산 신호의 Fourier 변환, Laplace/z 변환, 샘플링, 양자화, 필터 등을 포함한다. In this course, students learn the basic elements and principles of electric circuits, mathematical representations on continuous and discrete signals and systems, and signal transforms. The course deals with electric charge, currents, voltages, resistance, Ohm’s law, Kirchoff’s law, series/parallel circuits, RC/RL/RLC circuits, Fourier transform of 26 2025학년도 교육과정"}
{"id": "6b62c9c2f8744fd7939cbfc182b36b45", "source": "sw_pdf.pdf", "page": 27, "text": "continuous and discrete signals, Laplace/z transform, sampling, quantization, and filters. ∙최신기술콜로키움2 (Latest Technology Colloquium 2) 소프트웨어 기반의 융합 분야에 대한 최신 기술을 해당 분야 전문가를 초청하여 듣도록 한다. 트랙별로 학교 내부와 산업체 전문가 를 초청하게 되며, 학생들은 강연에 대한 요약과 함께, 본인의 진로와 연관된 의견을 보고서로 작성하여 제출한다. 성적은 출석과 보고서에 기반하여 Pass 혹은 Fail로 판단된다. Invite experts from the field to hear the latest technology in the field of software-based convergence. Each track will invite school professionals and industry experts. Students will submit a summary of the lecture, along with a report on their career. The grade is judged to be Pass or Fail based on attendance and report. ∙게임그래픽프로그래밍 (Game Graphic Programming) [수강 대상 : C++가능자] 디지털 게임 제작에 있어서 가장 기본이 되는 게임 그래픽 개발 능력을 학습한다. 특히 그래픽 관련 선형대 수(투영변환 등), 게임에 사용되는 물리학(이동, 회전, 관성, 충돌) 등의 이론적 지식을 활용하여 관련 라이브러리(OpenGL/DirectX, GLSL/HLSL) 기반으로 실습을 진행한다. In this course, students will learn game graphic development skills which are the most basic in digital game production. In particular, students will use the theoretical knowledge of linear algebra(projection transformation, etc.) related to graphics, and physics(movement, rotation, inertia, collision, etc.) used in games to practice based on related libraries(OpenGL/DirectX, GLSL/HLSL). ∙게임인터랙티브테크놀로지 (Game Interactive Technology) [수강대상 : C++ 가능자] 게임에 활용되는 다양한 입출력 장치의 구동 및 활용에 대해서 학습하고 이를 확장하여 차세대 입출력 장치의 원리와 배경 이론에 대해서 학습한다. 기본적인 마우스 및 키보드와 같은 장치에서 시작하여 얼굴, 몸통, 손의 인식에 의한 입력 장치의 구동원리를 학습하고 인간-컴퓨터 상호작용에서 다루는 관련 이론 및 인터랙션 테크닉에 대해서 학습한다. 기존의 입출 력 장치 외에 더 사실적인 게임 플레이의 경험을 제공하기 위해 도입되고 있는 인식 기술 및 관련 이론을 학습하고 이를 실제 게임 에 적용해본다. 두번째로 시각, 청각, 촉각으로 대표되는 출력 장치들에 대해서 감각별 생체 기작 및 인지 이론을 학습하고 게임에 적용하며 이에 대한 평가를 수행하는 방법을 실습한다. This course introduces the basic operation principles of input and output devices which extends toward the understanding of future I/O devices. Students will learn the fundamental theories of Human-Computer Interaction to design interaction techniques for computing and understand the application of physiological and perceptual backgrounds underneath the software and hardware design. In summary, this course is designed to learn how to provide an optimal experience using motion-based input devices utilizing various sensor technologies, immersive sensory output devices using wearable technology, and input/output devices. ∙가상/증강현실이론및실습 (Virtual and Augmented Reality Programming) (*게임콘텐츠) [수강대상 : C++ 가능자] 디지털 게임 디자인 및 3D 그래픽스 그리고 게임엔진에 대한 이해를 바탕으로 AR(Augmented Reality) 이나 HMD(Head Mount Display) 기반의 VR(Virtual Reality) 콘텐츠 구현을 위한 이론적, 기술적 능력을 배양하고 이를 직접 제 작한다. Culture theoretical and technical skills for the AR(Augmented Reality) and HMD(Head Mount Display) based on VR (Virtual Reality) can be implemented directly and making it. ∙로봇프로그래밍 (Robot Programming) 로봇 운영체제(ROS)를 통해, 로봇의 하드웨어, 소프트웨어 플랫폼, 핵심 기술 애플리케이션 소프트웨어의 구조를 이해하고 직접 다 뤄보도록 한다. 시뮬레이션 기반의 로봇 조작 알고리즘을 학습하고 SLAM을 통한 자율주행 기술의 이론과 실습을 다룬다. In this course, students understand the structure of hardwares, software platforms, and core application softwares of future cars and robots based on Robot Operating System(ROS). Students learn and develop simulation-based robot 27 Ⅶ. 소프트웨어융합대학 교육과정"}
{"id": "b4c2cf373e5d48789003d128d2c5d687", "source": "sw_pdf.pdf", "page": 28, "text": "manipulation algorithms and theory and practice of autonomous driving technology through SLAM. ∙3D데이터처리 (3D Data Processing) 자율 주행 자동차 및 지능 로봇에 활용되는 로봇 비전에 대해서 배운다. 카메라 및 삼차원 라이다등의 비전 센서의 원리 및 획득된 데이터를 처리하는 방식에 대해서 공부한다. 3차원 기하학을 기반하여 영상들 또는 3차원 포인트 클라우드로 부터 특징 추출 및 이를 활용한 3차원 복원 방식들에 대해서 다룬다. In this course, we will deal with 3D robot vision used in autonomous vehicles and intelligent robots. This course will study the principles of vision sensors such as cameras and 3D lidar and how to process the data. Based on 3D geometry, we deal with feature extraction from images or 3D point clouds and 3D reconstruction methods using sensor data. ∙풀스택서비스프로그래밍 (Full-Stack Service Programming) (*공통) 한번 작성한 코드로 다양한 운영체제와 디바이스에서 실행되는 프로그램을 개발하는 크로스 플랫폼(Cross-Platform) 기술을 이용하 여 모바일 앱, 웹 서비스, 데스크탑 어플리케이션 및 서버 프로그램을 개발하는 방법을 배우는 과목이다. 이를 위해서 Dart 언어와 Flutter 프레임워크를 사용하며, 필요시 Adobe-XD를 통한 UI/UX 디자인 결과물을 Flutter 프레임워크와 연동하는 방법을 배우도록 한다. This course is to learn how to develop mobile apps, web services, desktop applications, and server programs using cross-platform technology that develops programs that run on various operating systems and devices with code developed once. For this, Dart language and Flutter framework are used, and if necessary, learn how to link UI/UX design results through Adobe-XD with Flutter framework. ∙인공지능과게임프로그래밍 (AI and Game Programming) 본 강의는 게임 프로그래밍을 통해 게임 요소, 자료 및 신호 분석, 인공지능에 대한 실질적인 프로그래밍 개념들을 소개하고 실습한 다. 신호 및 영상 처리, 데이터 분석, 기계 학습, 게임 비전 등에 대한 기초 이론이 인공지능의 다양한 분야에 어떻게 활용되는지 공부하고 프로그래밍으로 구현 및 분석한다. This course introduces and provides practical programming concepts for game components, data and signal analysis, and artificial intelligence using game programming. It explores fundamental theories of signal and image processing, analysis, machine learning, and game vision, focusing on their applications within diverse fields of artificial intelligence. ∙풀스택서비스네트워킹 (Full-Stack Service Networking) (*공통) 전통적인 컴퓨터네트워크 기술을 학습한 후, 최신 네트워킹 기술을 익힌다. 전통적인 컴퓨터네트워크 기술은 OSI(Open System Interconnection) 7계층 구조에 기반하여, Ethernet, WLAN, TCP/IP 등 인터넷 중심의 기술을 학습한다. 최신 네트워킹 기술은 소프트웨어융합학과 트랙에 맞춰서, 실제 산업에서 사용하는 실용적인 최신 네트워킹 기술을 다룬다. 특히, 트랙별 캡스톤디자인 및 소프트웨어융합 캡스톤디자인 등 네트워킹 기술 개발이 필요한 학생들은 수업을 들으며 실전적인 네트워킹 기술에 대한 조언과 최신 네트워킹 소프트웨어 기술에 대한 설명을 학습할 수 있다. After learning traditional computer network skills, discover the latest networking skills. Traditional computer network technology is based on the OSI(Open System Interconnection) 7-layer structure and understands Internet-oriented technologies such as Ethernet, WLAN, and TCP/IP. In line with the software convergence department and track, the latest networking technology covers the latest practical networking technology used in real industry. In particular, students who need networking, such as capstone design and software convergence by track, can learn advice on practical networking technology and explanations on the latest networking software technology while taking classes. ∙자연언어처리 (Natural Language Processing) (*공통) 이 과목은 자연언어처리(NLP)의 다양한 문제들을 다룬다. 따라서, 띄어쓰기, 형태소 분석 등과 같은 전통적인 자연언어처리 토픽 외에도 감성분석, 요약, 챗봇과 같은 응용 문제들도 다루고자 한다. 이 과목은 기계학습 기반의 자연언어처리 기법에 대하여 학생들 28 2025학년도 교육과정"}
{"id": "95a9c1f885e1474c957d7a0eb0e27b2e", "source": "sw_pdf.pdf", "page": 29, "text": "이 심도 있는 이해를 하게 하여 추후 학생들이 자신만의 문제에 그 기법을 적용할 수 있도록 하는 것을 목표로 한다. This course covers a wide range of tasks in natural language processing(NLP). As well as traditional and basic topics in NLP such as word spacing and morphological analysis, its coverage includes application-related topics such as sentiment analysis, summarization, and chat-bot. This course aims at providing in-depth understanding of recent machine learning-based NLP techniques to allow students to apply the techniques to their own language-related tasks. ∙소프트웨어융합보안(Software Convergence Security) (*공통) 소프트웨어가 적용되는 다양한 분야(웹, 모바일, 인공지능, IoT 등)에서 나타나는 여러 사이버공격 기법과 이를 예방하기 위해 소프트웨어 개발자가 알아두어야 할 사항에 대해 학습한다. 사이버보안과 관련한 주요 개념, 기법, 최신 동향 등에 대해 폭넓 게 다룬다. This course will cover various cyberattack techniques that appear across different software application fields such as web, mobile, artificial intelligence, and IoT, as well as principles that software developers should be aware of to prevent those attacks. The course will also broadly cover key concepts, techniques, and the latest trends related to cybersecurity. ∙강화학습 (Reinforcement Learning) (*로봇·비전) 본 강의에서는 심층 신경망을 이용한 강화학습의 이론에 대해서 공부하고 실습을 통해 직접 구현해본다. 강화학습의 기본 개념, 벨 만 방정식, 마르코프 결정 과정 등을 설명하고, 정책 함수 및 가치 함수 기반의 학습 방식에 대해서 공부한다. 시뮬레이션 기반으로 최신 심층 강화학습 알고리즘을 직접 구현해 본다. In this course, we will study the theory of reinforcement learning using deep neural networks and implement it directly through practice. Basic concepts of reinforcement learning, Bellman's equation, Markov decision process, etc. are explained, and learning methods based on policy functions and value functions are studied. We will cover recent deep reinforcement learning algorithms, and implement them on simulated environments. ∙창업현장실습 (Field Training for Start-up) 학생들이 실제 창업 환경에서 직접 참여해 창업 과정을 경험하고, 창의적 문제 해결 능력과 실전 비즈니스 역량을 키울 수 있도록 돕는다. (창업활동 기간 및 창기간에 따라 학점부여) This couse helps students directly engage in real entrepreneurial environments, allowing them to gain experience in the startup process and develop creative problem-solving skills and practical business capabilities. ∙단기현장실습 (Short-Term Internship) 관련 기업에서 실무 경험을 통해 전공지식을 응용한다.(활동기간에 따라 학점 부여) This course gives a chance to apply theoretical knowledge in a field. ∙장기현장실습 (Long-Term Internship) 관련 기업에서 장기 실무 경험을 통해 전공지식을 응용한다.(활동기간에 따라 학점 부여) This course gives a chance to apply theoretical knowledge in a field through long-term practical experience. 29 Ⅶ. 소프트웨어융합대학 교육과정"}
{"id": "2162f7b219354751b15af2e3dd1fd0bd", "source": "sw_pdf.pdf", "page": 30, "text": "[별표6] 빅데이터 분석 마이크로디그리 이수 체계도 1. 마이크로디그리명(영문): 빅데이터 분석 마이크로디그리 [Bigdata Analysis Micro Degree] 2. 마이크로디그리 목표: 빅데이터 분석에 필요한 데이터마이닝 및 빅데이터 관리를 위한 프로그래밍 전문 인재 양성 3. 마이크로디그리 소개 ① 빅데이터 분석을 위한 기본 개념 습득 ② 빅데이터 마이닝과 머신러닝 기술 및 이러한 기술들을 위한 프로그래밍 ③ 빅데이터의 시각화 기술 및 이를 위한 도구 사용법과 프로그래밍 4. 마이크로디그리 이수 역량과 자격 ① 본인의 아이디어를 조기에 사업화/창업하고 싶은 소프트웨어 비전공자 ② 빅데이터를 위한 프로그래밍에 관심이 있는 소프트웨어 전공자 ③ 소프트웨어융합학과 ‘웹/파이선프로그래밍’ 사전 수강 권장 ④ 2학기 이상 이수한 재학생(편입생은 1학기 이상)에게 마이크로디그리의 신청자격을 부여하며, 마이크로디그리 이수를 희망 하는 자는 학기별 소정의 기간에 신청 후 이수하면 된다. (단, 수업연한 초과자는 신청할 수 없음) ⑤ 마이크로디그리는 최대 3개까지 신청 및 이수할 수 있다. 단, 특정 학부(과) 소속학생의 신청이 제한될 수 있다. ⑥ 이수 중인 마이크로디그리를 포기하고자 하는 자는 학기별 소정의 기간에 마이크로디그리 포기 신청을 해야 한다. ⑦ 최종 이수 확정 된 마이크로디그리는 포기할 수 없다. ⑧ 마이크로디그리 미이수자 중 졸업요건을 충족한 자는 마이크로디그리를 위해 졸업유예를 할 수 없다. 5. 빅데이터 분석 마이크로디그리 이수학점 총계 9 6. 마이크로디그리 이수방법 ① 마이크로디그리 신청자는 신청한 마이크로디그리의 이수체계에 따라 교과목을 이수하여야 한다. ② 마이크로디그리 신청 전에 해당 과목을 이수하였을 경우 이수학점으로 인정한다. ③ 마이크로디그리로 인정된 교과목은 전공 및 교양학점으로 중복 인정한다. ④ 이수 중인 마이크로디그리를 포기할 경우 기 이수한 교과목은 전공 및 교양, 또는 일반선택 학점으로 인정한다. ⑤ 마이크로디그리 이수 후 마이크로디그리 수료증을 발급받을 수 있으며, 성적증명서에 그 사실을 기재한다. 30 2025학년도 교육과정"}
{"id": "8679eee316674a44a12500fa9e315ab3", "source": "sw_pdf.pdf", "page": 31, "text": "메타버스 마이크로디그리 이수 체계도 1. 마이크로디그리명(영문): 메타버스 마이크로디그리 (Metaverse Micro Degree) 2. 마이크로디그리 목표: 메타버스에 필요한 이론 및 영상데이터 관리 전문 인재 양성 3. 마이크로디그리 소개 ① 메타버스 실현을 위한 비디오 데이터 압축 기술 ② 메타버스 시스템 구현을 위한 이미지, 그래픽스, 애니메이션, 비디오, 사운드, 오디오를 포함하는 인간의 오감을 위한 멀티미디어 신호처리 기술 ③ 메타버스의 거대한 데이커를 전달하기 위한 네트워크 기술 4. 마이크로디그리 이수 역량과 자격 ① 본인의 아이디러를 조기에 사업화/창업하고 싶은 소프트웨어 비전공자 ② 메타버스 산업에 관심이 있는 소프트웨어 전공자 ③ 영상데이터 처리 또는 최신 네트워크 기술에 관심 있는 전공/비전공자 ④ 컴퓨터공학과 ‘객체지향프로그래밍’ 사전 수강 권장 ⑤ 2학기 이상 이수한 재학생(편입생은 1학기 이상)에게 마이크로디그리의 신청자격을 부여하며, 마이크로디그리 이수를 희망 하는 자는 학기별 소정의 기간에 신청 후 이수하면 된다. (단, 수업연한 초과자는 신청할 수 없음) ⑥ 마이크로디그리는 최대 3개까지 신청 및 이수할 수 있다. 단, 특정 학부(과) 소속학생의 신청이 제한될 수 있다. ⑦ 이수 중인 마이크로디그리를 포기하고자 하는 자는 학기별 소정의 기간에 마이크로디그리 포기 신청을 해야 한다. ⑧ 최종 이수 확정 된 마이크로디그리는 포기할 수 없다. ⑨ 마이크로디그리 미이수자 중 졸업요건을 충족한 자는 마이크로디그리를 위해 졸업유예를 할 수 없다. 5. 메타버스 마이크로디그리 이수학점 총계 9 6. 마이크로디그리 이수방법 ① 마이크로디그리 신청자는 신청한 마이크로디그리의 이수체계에 따라 교과목을 이수하여야 한다. ② 마이크로디그리 신청 전에 해당 과목을 이수하였을 경우 이수학점으로 인정한다. ③ 마이크로디그리로 인정된 교과목은 전공 및 교양학점으로 중복 인정한다. ④ 이수 중인 마이크로디그리를 포기할 경우 기 이수한 교과목은 전공 및 교양, 또는 일반선택 학점으로 인정한다. ⑤ 마이크로디그리 이수 후 마이크로디그리 수료증을 발급받을 수 있으며, 성적증명서에 그 사실을 기재한다. 31 Ⅶ. 소프트웨어융합대학 교육과정"}
{"id": "c928b89ce9264a878405eb2b224f2d0c", "source": "sw_pdf.pdf", "page": 32, "text": "[별표7] 컴퓨터공학과 전공능력 1. 대·내외 환경분석 2. 주요 요구 내용 - 학생 코딩 능력의 중요성 인식 - 컴퓨터공학 세부 분야에 대한 교과목 확대 - 산업체에서 활용 가능한 소프트웨어 응용분야에 대한 교육 확대 - 산업체 인재에 대한 겸직 교수제 도입 3. 컴퓨터공학과 시사점 도출 - 컴퓨터공학을 활용하는 여러 응용분야에 대한 과목이 확충 되어야 하며, 이를 수행하기 위한 우수 교수진 추가 확보 등 거교적 차원의 계획이 필요함 32 2025학년도 교육과정"}
{"id": "bac95680db3f4dde9e17bf5feec5f146", "source": "sw_pdf.pdf", "page": 33, "text": "4. 컴퓨터공학과 교육목표 및 인재상 학과(전공) 첨단 IT 기술과 우리민족이 지니고 있는 문화적 저력을 접목시켜 새로운 기술문명의 패러다임을 창출하고자 한다. 교육목표 학과(전공) 인재상 5. 컴퓨터공학과 전공능력 6. 전공능력 제고를 위한 전공 교육과정 구성 및 체계도 가. 전공 교육과정 구성표 33 Ⅶ. 소프트웨어융합대학 교육과정"}
{"id": "216eb3fbf5ba4910bad79fd9d2beee7e", "source": "sw_pdf.pdf", "page": 34, "text": "34 2025학년도 교육과정"}
{"id": "4901ffba51434f91a1a8b0defff93b9e", "source": "sw_pdf.pdf", "page": 35, "text": "35 Ⅶ. 소프트웨어융합대학 교육과정"}
{"id": "7a32d441f75f4cf78766ec8fdf7234f6", "source": "sw_pdf.pdf", "page": 36, "text": "나. 권장 이수 체계도 다. 자유전공학부 학생을 위한 컴퓨터공학과 전공 권장 이수 체계도(2학년부터) 36 2025학년도 교육과정"}
{"id": "ffa425b32a234c0b9a9b36053195752c", "source": "sw_pdf.pdf", "page": 37, "text": "소프트웨어융합대학 인공지능학과 교육과정 요약표(2025) 학과소개 ◩ 인공지능학과는 4차 산업혁명 시대가 도래함에 따라 인공지능 전문인력의 집중 양성을 위해 2022년 새로 출범한 학과이다. ◩ 후마니타스(Humanitas) 정신에 기반한 인공지능 인재 양성을 목표로 한다. ◩ 본 학과는 학술연구와 실전연구를 함께 추구해야 하는 인공지능의 특성을 반영한 특화된 교육과정을 통해 글로벌 경쟁력을 갖춘 인재를 양성하고 인공지능 핵심기술을 주도하는 연구를 수행한다. 1. 교육목적 창의력과 전문성 함양을 통해 미래사회를 선도할 인공지능 분야의 글로벌 인재 양성 2. 교육목표 1) 경희대학교의 창학이념인 ‘문화세계창조’를 공학적으로 발전시켜 ‘인간중심의 인공지능’(Humanover AI)을 실현하고 미래 인공 지능 분야를 이끌어 갈 인재 양성을 목표로 한다. 2) 교육목표를 달성하기 위한 세부 목표를 다음과 같이 둔다. - 인공지능의 기반이 되는 컴퓨터공학 및 수학(數學) 능력의 극대화 - 실세계 문제를 인공지능 기술로 해결할 수 있는 실천 능력의 극대화 - 인간에 대한 이해 및 윤리의식에 바탕을 둔 글로벌 경쟁력의 극대화 3. 학과별 교과목 수 ※ 단기현장실습/장기현장실습, 창업현장실습 과목은 제외한 현황임"}
{"id": "2499d09233c44b838ad15132ae9412be", "source": "sw_pdf.pdf", "page": 38, "text": "4. 인공지능학과 졸업 요건 1) 교육과정 기본구조표 ※ 교양이수는 교양교육과정을 따름 2) 졸업논문 컴퓨터공학과의 ‘졸업프로젝트’를 이수하는 것으로 경희대학교 졸업을 위한 “졸업논문” 합격으로 인정한다. 단, “졸업논문(인공 지능)”을 필히 수강 신청하여야 한다. 3) 졸업능력인증제 소프트웨어융합대학 졸업능력 인증제를 따른다. 38 2025학년도 교육과정"}
{"id": "541d330320ad4fca87612d4e3c1f555c", "source": "sw_pdf.pdf", "page": 39, "text": "인공지능학과 교육과정 시행세칙 제 1 장 총 칙 제1조(학과 설치 목적) 인공지능학과는 미래를 선도할 첨단기술인 인공지능 분야의 글로벌 리더를 배출하기 위하여 설치된 학과이 다. 인공지능 학과 설치의 목적을 달성하기 위하여 컴퓨터공학 기초과목에 대한 교육을 바탕으로, 충분한 경험을 통해 인공지능 신기술 개발을 이끌고 실세계 문제를 해결할 수 있는 능력을 갖춘 인재를 양성한다. 제2조(일반원칙) ① 인공지능학과를 단일전공, 다전공으로 이수하고자 하는 학생은 본 시행세칙에서 정하는 바에 따라 교과목을 이수할 수 있다. ② 교과목의 선택은 지도교수와 상의하여 결정한다. ③ 모든 교과목은 [별표1] 교육과정 편성표에 제시된 이수학년과 개설학기에 준해 이수할 것을 권장한다. ④ 전공과목의 선수과목은 [별표2]와 같으며, 선·후수과목의 체계를 준수하여 이수하여야 한다. 선·후수과목의 체계는 전산시스 템에 반영되어 있으며 수강신청시 자동으로 적용된다. 단, 교과목 담당교수와의 상담을 통하여 선수과목의 필요여부를 판단하 여 선수과목 미이수 학생에 대하여 수강을 허용할 수 있다. 제 2 장 교양과정 제3조(교양과목 이수) 교양과목은 본 대학교 교양과정 기본구조표에서 정한 소정의 학점을 취득하여야 한다. 제 3 장 전공과정 제4조(전공 이수) ① 인공지능학과의 단일전공과정을 이수하고자 하는 학생은 [표1]에 명시된 전공기초, 전공필수, 전공선택 교과 목을 반드시 이수하여야 한다. ② 인공지능을 단일전공, 다전공으로 이수하고자 하는 학생은 본 시행세칙에서 지정한 소정의 전공이수학점을 이수하여야 하며, [별표5]에서 제시된 학년별 교육과정 이수체계를 따를 것을 권장한다. ③ 인공지능학과 다전공과정을 이수하는 학생은 [표2]에서 지정한 전공기초, 전공필수 교과목을 반드시 이수하여야 하며, [표3] 에 명시된 타학과 과목들을 인공지능학과 전공기초 과목으로 대체 인정받을 수 있다. 39 Ⅶ. 소프트웨어융합대학 교육과정"}
{"id": "a06ca3b0a6054060a4a13d8df255cc00", "source": "sw_pdf.pdf", "page": 40, "text": "[표1] 단일전공 전공과목 편성표 ※ 모든 학생은 제6조의 산학필수 학점을 취득하여야 함 ※ 이외 학과장이 전공선택으로 승인한 과목 (예 : 전공연수, 교환학생, 학점교류 등)은 SW선택으로 인정함 [표2] 다전공 전공과목 편성표 ※ 모든 학생은 제6조의 산학필수 학점을 취득하여야 함 ※ 이외 학과장이 전공선택으로 승인한 과목 (예 : 교환학생, 학점교류 등)은 SW선택으로 인정함 40 2025학년도 교육과정"}
{"id": "41a5f68414c241c3a6976471d6c40975", "source": "sw_pdf.pdf", "page": 41, "text": "[표3] 전공기초 교과목 대체 이수 인정 교과목 제5조(타전공과목 이수) ① 타전공과목의 이수는 최대 6학점까지 인정하나, 아래 ②항을 만족하는 경우에만 타전공과목 이수로 인정한다. ② [별표1]에 나열되지 않은 과목 중, 컴퓨터공학과와 소프트웨어융합학과에서 개설하는 전공과목에 한해서 SW선택으로 최대 6학점까지 인정한다. 제6조(산학필수 이수) 단기현장실습/장기현장실습을 포함하여 빅데이터프로그래밍, 모바일/웹서비스프로그래밍, 최신기술콜로키 움1, 최신기술콜로키움 2, 캡스톤디자인, 졸업프로젝트, AI최신기술, 블록체인(CSE), 창업현장실습 중 9학점 이상의 산학필수 학점을 이수하여야 한다. 제7조(대학원 과목의 이수) ① 인공지능학과 소속 학생은 인공지능학과 학부 학과장의 승인을 받아 최대 9학점까지 인공지능학 과, 컴퓨터공학과, 소프트웨어융합학과의 대학원 과목을 이수할 수 있으며 그 취득 학점은 전공선택 학점으로 인정한다. ② 대학원 시행세칙에 따라 인공지능학과 소속 학생은 본교의 학사학위과정 재학 중 본교의 일반대학원에서 이수하여 B학점 이상 취득한 경우에는 학사학위 취득에 필요한 학점의 초과분에 한하여 6학점 이내에서 대학원 진학 시 대학원 학점으로 인정받을 수 있다. 제 4 장 졸업이수요건 제8조(졸업이수학점) ① 인공지능학과의 최저 졸업이수학점은 130학점이다. ② 교양학점은 후마니타스 교양교육과정을 만족하여야 한다. ③ 졸업논문을 포함하여 졸업이수요건을 충족시켜야 한다. 제9조(졸업이수요건) ① 단일전공과정: 인공지능학과 학생으로서 단일전공자는 전공기초 12학점, 전공필수 42학점, 전공선택 27학점 이상 이수하여야 한다. 전공필수에서는 SW필수에서 21학점, AI필수에서 21학점 이상을 포함하여야 하며, 전공선택에서 는 SW선택 9학점, AI선택 18학점 이상을 포함하여야 한다. ② 다전공과정: 인공지능학과 학생으로서 타전공을 다전공과정으로 이수하거나, 타학과 학생으로서 인공지능전공을 다전공과정 으로 이수하는 학생은 전공기초 12학점, 전공필수 27학점, 전공선택 18학점 이상 이수하여야 한다. 전공필수에서는 SW필수 9학점, AI필수 18학점 이상을 포함하여야 하며, 전공선택에는 SW선택 3학점, AI선택 15학점 이상을 포함하여야 한다. ③ 인공지능학과의 단일전공과정 및 다전공과정 학생은 제6조의 산학필수 이수를 수행하여야 한다. 제10조(영어강좌 이수학점) 2008학번 이후 신입학생의 경우에는 전공과목의 영어강좌 3과목 이상을 이수해야 졸업요건이 충족 되며, 편입생의 경우에는 전공과목의 영어강좌 1과목 이상을 이수해야 졸업요건에 충족된다. 단, 전공과목이라 함은 이수구분이 전공기초, 전공필수, 전공선택인 과목을 의미한다. 41 Ⅶ. 소프트웨어융합대학 교육과정"}
{"id": "6338cc6f0d61445e812386ac600b4d1b", "source": "sw_pdf.pdf", "page": 42, "text": "제11조(SW교육 졸업요건) 2018학년도 이후 입학생(편입생, 순수외국인 제외)은 후마니타스칼리지나 단과대학에서 개설되는 SW교양 또는 SW코딩 교과목에서 총 6학점을 이수하여야 한다. SW교양 및 SW코딩 교과목 개설 및 운영에 관한 세부사항은 소프트웨어융합대학 교육교과운영시행세칙을 따른다. 제12조(졸업능력인증제도) 졸업능력인증제도는 폐지하며, 경과조치를 따른다. 제 5 장 기 타 제13조(보칙) 본 시행세칙에 규정되지 않은 사항은 컴퓨터공학부 학부회의의 의결을 따른다. 제14조(마이크로디그리 이수) 마이크로디그리 과정을 이수하고자 하는 자는 ‘[별표4] 마이크로디그리 이수체계도’에서 지정한 소 정의 학점을 충족하여야 한다. 제15조(외국인 학생의 한국어 능력 취득) ① 한국어트랙 외국인 학생은 졸업 전까지 한국어능력시험(TOPIK) 4급 이상을 취득하 여야 한다. 부 칙 제1조(시행일) 본 시행세칙은 2025년 3월 1일부터 시작한다. 제2조(경과조치) (졸업능력인증제 폐지에 따른 경과조치) 졸업능력인증제 폐지는 2023학년도부터 모든 재적생에서 적용한다. [별표] 1. 교육과정 편성표 1부. 2. 선수과목 지정표 1부. 3. 인공지능학과 교과목 해설 1부. 4. 인공지능 이론 마이크로디그리 이수체계도 1부. 5. 인공지능학과 전공능력 1부. 42 2025학년도 교육과정"}
{"id": "796c505ed8bd42b4a9290d59389143bb", "source": "sw_pdf.pdf", "page": 43, "text": "[별표1] 인공지능학과 교육과정 편성표 43 Ⅶ. 소프트웨어융합대학 교육과정"}
{"id": "9e08e0bdb0dd4070aeb9681c9c53ac75", "source": "sw_pdf.pdf", "page": 44, "text": "1) 창업현장실습, 단기현장실습/장기현장실습은 각 활동별로 3학점, 6학점, 9학점, 12학점을 산학필수 학점으로 이수함 ※ 비고의 ‘포’는 포트폴리오 교과목으로서, 반드시 교과목내 결과물을 개발하고, 학부 과정 동안 개인 실적으로서 관리해야 함 44 2025학년도 교육과정"}
{"id": "56e214dcd0d147f3b887a4f08545df99", "source": "sw_pdf.pdf", "page": 45, "text": "[별표2] 인공지능학과 선수과목 지정표 45 Ⅶ. 소프트웨어융합대학 교육과정"}
{"id": "dde54e33375b4f02a7027bd6b6d4182d", "source": "sw_pdf.pdf", "page": 46, "text": "[별표3] 인공지능학과 교과목 해설 ∙인공지능개론 (Introduction to Artificial Intelligence) 본 과목은 컴퓨터공학 및 인공지능에 대한 지식이 없는 학생들에게 인공지능 학습에 필요한 기본적인 지식을 전달한다. 이를 위해, 본 과목은 운영체제, 프로그래밍 언어 등의 기초적인 컴퓨터공학 토픽 뿐만 아니라 지식표현, 추론, 기계학습 등의 인공지능 전반에 걸친 토픽을 다룬다. This course delivers fundamental knowledge needed for further study of artificial intelligence to the students who have no knowledge about computer science and artificial intelligence. For this, this course covers various topics of artificial intelligence such as knowledge representation, reasoning, and machine learning as well as the fundamental topics of computer science such as operating systems and programming languages. ∙인공지능수학 (Mathematics for Artificial Intelligence) 이 과목에서는 인공지능 및 기계학습에 필수적인 기초적인 수학 개념을 배운다. 기계학습의 기본이 되는 확률 이론, 정보 이론, 그리 고 선형대수학 등의 수학적 이론과 이를 컴퓨터로 구현할 때 나타나는 이슈 등을 학습한다. This course delivers fundamental mathematical concepts needed for artificial intelligence and machine learning. It includes the topics of probabilistic theory, information theory, linear algebra, and so on. In addition, it also covers the computational issues related to implementing the concepts and the topics. ∙선형대수 (Linear Algebra) 역행렬, 선형계, 행렬식, 가우스 소거법, 내적, 벡터공간, 일차독립, 기저, Kernel and range, 선형변환, Eigenvalues and Eigenvectors, 대각화, 최소자승법 등을 공부한다. The course treats linear systems, Gaussian elimination, inverse matrix, determinant, inner product, vector space, linear independence, basis, kernel and range, linear transformations, eigenvalues and eigenvectors, diagonalization, and least-square method. ∙미분적분학 (Calculus) 일변수 함수의 미분, 적분 이론과 그 응용에 대하여 공부한다. In this course, we study the derivatives and integral theories of functions(functions of one variable), the partial derivatives of functions of several variables, and their applications. ∙이산구조 (Discrete Structures) 수학적인 관점에서 논리적인 디지털 컴퓨터 구조를 이해하기 위해 형식논리, 알고리즘 증명, 재귀, 집합, 순열과 조합, 이항정리, 이진관계, 함수 및 행렬, 그래프, 트리, 그래프 알고리즘, 프로그램의 검증, 부울 대수와 컴퓨터 논리 등에 관하여 배운다. In order to understand the logical structure of digital computer from mathematical viewpoints, this course is designed to learn formal logic, proof of algorithm, recursion, set, permutation and combination, binomial theorem, binary relation, function and matrix, graph, tree, graph algorithm, program verification, Boolean algebra, and computer logic. ∙확률및랜덤변수 (Probability and Random Variables) 이 과목에서는 불가측성이 내재된 시스템의 해석 및 설계를 위하여 확률 이론의 기본적인 내용을 학습한다. 다루게 될 주요내용은 확률기초이론, 랜덤 변수, 확률분포와 밀도함수, 평균과 분산, 상관성과 대역밀도함수, 랜덤 프로세스이다. 이 과목의 학습 내용은 정보 통신, 제어 공학, 반도체, 전산학 등의 분야에 폭넓게 활용될 수 있다. C/C++을 이용하는 과제물을 통해 프로그래밍 능력을 향상시킨다. 46 2025학년도 교육과정"}
{"id": "8c9db37c0653449a9880beeb963c1001", "source": "sw_pdf.pdf", "page": 47, "text": "This course gives an introductory treatment of probability theory for analysis of the system that inherently exhibits randomness. Covered topics include elementary probability theory, random variable, probability distribution and density function, correlation and spectral density function, and random processes. Those topics are applicable to a wide range of electrical engineering fields including information technology, control engineering, semiconductor, computer engineering, etc. Homework is assigned to improve the C/C++ programming skill. ∙인공지능프로그래밍 (AI Programming) 이 과목에서는 인공지능 수학에서 배우는 인공지능을 위한 수학적 개념을 실제로 컴퓨터로 구현한다. 이를 위해 NumPy, Tensorflow, Pytorch와 같은 기본적인 파이썬 라이브러리를 학습하고, 기본적인 신경망을 구현할 수 있는 능력도 기른다. This course aims at giving how to implement mathematical concepts for artificial intelligence. For this, the students learn basic Python libraries such as NumPy, Tensorflow, and Pytorch, and they also study how to construct some simple neural networks using the libraries. ∙고급딥러닝 (Advanced Deep Learning) 기본적인 CNN, RNN 등의 딥러닝 토픽을 학습한 후, Tansformer 등의 최신 딥러닝 토픽을 배운다. 컴퓨터비전과 자연언어처리에 대한 딥러닝 응용을 통해 실질적 문제 해결에 딥러닝을 적용한다. This course offers hot topics of deep learning such as Transformer after providing some basic topics about deep learning including CNN and RNN. It allows the students to apply the learned deep learning techniques to real world problems in computer vision and natural language processing. ∙인공지능과윤리 (AI and Ethics) 인공지능 기술 사용과 연구개발의 윤리적 책임을 이해하고 학습한다. This course provides the ethical responsibility in the use of artificial intelligence technology and research. ∙졸업프로젝트(Graduation Project) 이 과목은 컴퓨터공학과와 인공지능학과가 통합 운영하는 과목으로, 급변하는 컴퓨터, 멀티미디어, 인터넷, 인공지능 등 컴퓨터 전 분야에 관련된 새롭고 다양한 주제를 개인별로 교수들과 심도 있게 학습할 수 있는 기회를 제공한다. 교과 진행방법은 관심 주제에 대한 세미나, 산업 현장 인턴실습, 실제 프로젝트 수행, 연구논문 작성 등이다. 캡스톤디자인을 수강한 학생들이 다음 학기에 수강하 는 과목으로 캡스톤디자인에 이어서 연구 활동을 계속해 나가며, 지정된 날에 연구 결과에 대한 최종 발표를 하고, 보고서를 작성하 여 제출한다. This course offers students an opportunity to study new and various subjects related to computer, multimedia, Internet, and artificial intelligencetechnologies with their supervisor. The course includes seminar, industry internship, project study, and research paper writing. The course is provided for the students who have already completed the Special Topics in Capstone Design. The students are advised to continue their researches and studies based on the mid-result of the Special Topics in Capstone Design, present their final research results, and submit the corresponding reports. 이 과목은 컴퓨터공학과와 인공지능학과가 통합 운영하는 과목으로, 급변하는 컴퓨터, 멀티미디어, 인터넷, 인공지능 등 컴퓨터 전 분야에 관련된 새롭고 다양한 주제를 일정 소규모의 학생들이 그룹을 형성하여 교수들과 심도 있게 학습할 수 있는 기회를 제공한 다. 교과 진행방법은 관심 주제에 대한 세미나, 산업 현장 인턴실습, 실제 프로젝트 수행, 연구논문 작성 등이다. 이 과목을 효과적으 로 수행하기 위해서 학생들은 학기 초에 관심분야에 대한 학업 계획서를 작성하여 관련 교수와 상담을 통해 학습 주제를 결정하도록 되어 있다. This course offers students an opportunity to study new and various subjects related to computer, multimedia, Internet, and artificial intelligencetechnologies as a group with their supervisor. The course includes seminar, industry 47 Ⅶ. 소프트웨어융합대학 교육과정"}
{"id": "c160585229694a1eaac708e3bd7e413e", "source": "sw_pdf.pdf", "page": 48, "text": "internship, project study, and research paper writing. In order to efficiently complete this course, students are advised to determine their own research topics by preparing their study plans and contacting their supervisor in the beginning of the semester. ∙졸업논문 (Graduation Thesis) 인공지능학과는 캡스톤디자인과 졸업프로젝트를 이수하는 것으로 졸업을 위한 “졸업논문” 합격 여부를 결정한다. Bachelor of Engineering in Artificial Intelligence decides acceptance of graduation thesis by completing Capstone Design and Graduation Project. ∙객체지향프로그래밍 (Object-Oriented Programming) 객체지향 프로그래밍 기초에서 배운 데이터 형, 입출력, 선택문, 반복문, 함수, 배열, 포인터, 문자열 등을 기본으로 하여 클래스, 함수 오버로딩, 연산자 오버로딩, 상속, 가상함수, 템플릿, 네임스페이스 등의 고급 객체지향 프로그래밍 기법을 배우고 이를 실습을 통해 익힌다. Based on the basic knowledge of object-oriented programming such as data type, I/O, selection, iteration, function, array, pointer, string, etc., this course provides advanced techniques on object-oriented programming like class, function overloading, operator overloading, inheritance, virtual function, template, name space. ∙자료구조 (Data Structures) 자료 추상화, 배열, 리스트, 스택, 큐, 트리, 그래프 등의 자료구조와 그러한 자료구조를 활용할 수 있는 알고리즘을 배운다. 이 과목 을 통해서 학생들은 전산학의 지식을 확대하고 프로그래밍 기술을 향상시킬 수 있다. This course focuses on data abstraction, data structures such as array, list, stack, queue, tree, graph and algorithms that utilize those data structures. From this course, the students can expand their knowledge of computer science and sharpen their programming skills. ∙운영체제 (Computer Operating System) 운영체제는 사용자 프로그램의 수행과 주변장치나 기억공간과 같은 다양한 자원 할당을 감시한다. 이 과목에서는 멀티프로그래밍, 시분할, 그리고 비동기적 프로세서의 개념을 소개한다. 특히 동기화, 스케쥴링, 교착, 메모리관리, 가상메모리관리, 파일 시스템, 디 스크 스케쥴링, 정보공유, 보호/보안 및 분산운영체제와 같은 주제를 중점적으로 학습한다. Operating systems monitor the execution of user programs and the allocation of various resources such as memory space and peripheral devices. In this class, we introduce the basic concepts of multiprogramming, timesharing and asynchronous processes. The course focuses on synchronization, scheduling, deadlock, memory management, virtual memory management, file system, disk scheduling, information sharing, protection and security, and distributed operating system. ∙알고리즘 (Algorithm) 알고리즘의 기본적인 이해를 하고 대표적인 알고리즘의 형태를 배운다. 알고리즘 유형을 divide-and-conquer, dynamic programming, greedy algorithms, branch-and-bound 등으로 분류하고, 각각의 특성을 이해하도록 한다. 아울러 기본적인 복잡 도 문제를 살펴본다. 본 과목을 이수 후 새로운 문제에 대한 해결 알고리즘을 설계할 수 있는 능력을 키운다. Basic understanding of algorithms and characteristics of algorithm types are learned. The types of algorithms are classified into divided-and-conquer, dynamic programming, greedy algorithms, branch-and-bound, searching, etc and each characteristic is understood. In addition, we look at the basic complexity issues. After completing this course, students will develop the ability to design algorithms to new problems. ∙딥러닝 (Deep Learning) 딥러닝의 배경지식인 기초 수학(선형대수, 확률, 정보이론)을 리뷰하고, 기본 개념과 다양한 딥러닝 기술의 이론 지식을 학습한다. 48 2025학년도 교육과정"}
{"id": "70d44f41584340d9a40f8b0982a3813d", "source": "sw_pdf.pdf", "page": 49, "text": "Basic mathematics(linear algebra, probability, information theory), which is a background knowledge of deep learning, is reviewed. Students learn the concepts and theoretical knowledge of various deep learning technologies. ∙실전기계학습 (Machine Learning Application) 딥러닝/머신러닝 기본 지식을 실제 문제에 응용할 수 있는 실습 과목이다. 학생들은 머신러닝/딥러닝 기본 모델링 기법을 배우고 프로젝트/competition에 참여하여 다양한 실전 경험을 쌓는다. This course learns how to apply machine learning and deep learning technology to practical applications. The course allows the students to learn basic models and optimization techniques by participating Kaggle-based challenges and performing projects for practical applications. ∙디자인적사고 (Design Thinking) 새로운 소프트웨어 개발을 위한 디자인 중심의 창의적 설계 접근방법과 아이디어 발상을 위한 이론적 프로세스를 팀워크를 통해 학습한다. We will learn the design-oriented creative design approach for new software development and the theoretical process for idea development through teamwork. ∙웹/파이선프로그래밍 (Web/Python Programming) 웹 프로그래밍과 파이선 프로그래밍의 기초적인 내용을 배우도록 한다. 웹 프로그래밍은 HTML5/CSS3/Javascript를 사용하는 WebApp을 개발함으로서, 클라이언트 개발을 가능하게 한다. 아울러 Node.js를 통한 서버 프로그래밍까지 할 수 있도록 한다. 파이선은 기초 문법에 대한 이해를 수행할 수 있도록 한다. Learn the basics of Web programming and Python programming. Web programming enables client development by developing WebApp using HTML5/CSS3/Javascript. It also allows server programming through Node.js. Python makes it possible to understand basic grammar. ∙기계학습 (Machine Learning) 기계학습은 지능적인 응용 시스템을 구축할 수 있는 기반이 되었다. 본 과목에서는, 기본적인 기계학습 알고리즘을 소개하는 것으로 시작으로, 실제 응용을 중심으로 다양한 기술과 이론을 소개한다. 이러한 알고리즘의 사용 사례와 제한 사항들에 대한 논의를 진행 하고, 프로그래밍을 통해 훈련과 검증 과정을 구현한다. Machine learning has become a pillar on which you can build intelligent applications. This course will begin with the introduction of basic machine learning algorithms, and various techniques and theories are introduced with a focus on practical applications. The use cases and limitations of these algorithms will be discussed, and training and validation will be implemented with programming language. ∙자연언어처리 (Natural Language Processing) 이 과목은 자연언어처리(NLP)의 다양한 문제들을 다룬다. 따라서, 띄어쓰기, 형태소 분석 등과 같은 전통적인 자연언어처리에 주목 하며, 학생들이 자신만의 문제에 이 기법을 적용할 수 있도록 하는 것을 목표로 한다. This course covers a wide range of tasks in natural language processing (NLP). It covers traditional NLP tasks such as word spacing, morphological analysis, parsing, and so on so that the students can apply these NLP techniques to their own problems. ∙빅데이터마이닝 (Big Data Mining) 빅데이터 마이닝이란 대량의 데이터에서 의미 있는 패턴과 규칙을 발견하기 위해 자동적인 또는 준자동적인 방법에 의해 데이터를 조사하고 분석하는 절차이다. 본 과목은 데이터 마이닝의 기초적인 개념들과 그 적용법들을 제공한다. 주요 논제로 decision trees, classification, association, clustering, statistical modeling, Bayesian classification, k-nearest neighbors, CART 등을 다룬다. 49 Ⅶ. 소프트웨어융합대학 교육과정"}
{"id": "a4d911888a9c46a4a879b1d933fea28e", "source": "sw_pdf.pdf", "page": 50, "text": "Big data mining is the process of examining and analyzing data by automatic or semi-automatic methods to find meaningful patterns and rules in large amounts of data. This course provides basic concepts of data mining and its applications. Topics include decision trees, classification, association, clustering, statistical modeling, Bayesian classification, k-nearest neighbors, and CART. ∙정보검색 (Information Retrieval) 통계적, 언어적, 의미론적인 방법에 의한 검색 기법과 정보검색 시스템의 성능을 결정하는 검색 효율성과 제반 요인에 대한 평가방 법을 다룬다. This course deals with information retrieval techniques by statistical, linguistic and semantic methods. It also introduces the evaluation methods for search efficiency and various factors that determine the performance of information retrieval systems. ∙지식표현및추론 (Knowledge Representation and Inference) 추론의 효용성을 높이기 위해 논리, 프레임 등 인간의 지식을 컴퓨터를 통해 표현하는 방법들을 학습한다. This course aims to introduce how to represent human knowledge through frames and logics to increase the effectiveness of inference. ∙통계적학습이론 (Statistical Learning Theory) Loss, Risk를 포함한 통계적 학습 이론을 학습하여, 최신 딥러닝에 어떻게 활용하는지를 배운다. In this course, the students learn statistical learning theory including loss and risk. In addition, the students also learn how to apply these learning theory concepts to modern deep learnings. ∙설명및신뢰가능한AI (Explainable and Reliable AI) 최근 딥러닝 기술의 발전으로 다양한 분야에서 인공지능 모델이 활용됨에 따라 모델의 의사결정을 얼마나 신뢰할 수 있는지에 대해 이해하고 평가하는 것이 중요해지고 있다. 본 교과목에서는 인간 중심의 인공지능 기술 활용을 위해 인공지능 모델의 해석가능성, 인공지능 모델 설명 기법 및 불확실성 분석 방법 등 신뢰가능한 AI를 위한 방법들에 대해 다룬다. With the recent development of deep learning, it becomes important to understand a learning model and to evaluate the uncertainty of predictions. This course covers the topics for reliable AI including interpretability, model explanation, and uncertainty analysis for human-centered AI. ∙AI최신기술 (Recent Advances in AI) 인공지능 이론 및 응용 세부분야 Top-Tier Conference에서 발표된 최신 논문들을 리뷰하고 최신기술의 추세와 발전 방향에 대한 토론 수업 및 세미나를 주차별로 진행한다. 대학원 진학 및 인공지능 기술연구 진로를 희망하는 수강 학생들은 수업을 통하여 다양 한 분야의 최신 기술을 접하고 연구분야 설정에 도움을 받을 수 있다. In this course, the students pursuing graduate study and research career review the state-of-the-art AI methods introduced at top-tier conferences and participate in open-discussion classes and seminars. ∙독립심화학습(인공지능)1/2 (Individual In-Depth Study 1/2) 학생 1인이 심화학습 및 연구주제를 정하여 전임교수를 지도교수로 지정하여 한 학기동안 지도받아 독립적으로 연구를 수행한다. 제안 한 주제에 관한 보고서를 지도교수에게 제출하여야 하며, 지도교수는 연구과정과 보고서를 평가하여 P/F 중 적합한 학점을 부여한다. A student performs in-depth research for a specific artificial intelligence topic under the supervision of an advisor faculty member. The students should submit a report on the topic and its result, and the advisor evaluates the student as P/F with the report and the academic activities of the student. - 논문 작성 (Article Writing): 학생은 지도교수의 지도하에, 본인의 아이디어를 구현하여 논문을 작성한다. 50 2025학년도 교육과정"}
{"id": "407bfe0fb24d4dc7b038c8a64a787975", "source": "sw_pdf.pdf", "page": 51, "text": "The student implements his/her idea under the supervisoin of an advisor. The result should be written as a technical article. - 특허 출원 (Patent Writing): 학생은 지도교수의 지도하에, 본인의 아이디어를 특허화하고, 최종 출원하는 절차를 수행해 본다. 특허 작성을 희망하는 학생은 계획서와 실적서를 제출하고, 실질적인 작성 여부 등에 기반하여 지도교수로부터 P/F 중 적합한 학 점을 부여받는다. Under the supervision of an advisor, the student will patent his ideas and conduct the final application procedure. A student who wishes to write a patent must submit a proposal and an achievement book, and receive appropriate credits from the advisor based on the actual progress of the student. ∙AI심화학습 (Advanced AI Study) AI의 고급 이론과 실제 응용을 다루는 심화 학습 과정으로서, 해당 교과목을 통해 AI의 기초 지식을 이미 습득한 학생들이 담당교수 지도 아래 더 깊이 있는 주제를 탐구하고, 실제 문제 해결에 적용할 수 있는 능력을 기를 수 있다. As an advanced learning course that deals with the recent theories and practical applications of AI, this subject allows students who have already acquired fundamental AI knowledge to explore more in-depth topics under the guidance of the professor and develop the ability to apply them to real-world problem-solving. ∙이산구조 (Discrete Structures) 수학적인 관점에서 논리적인 디지털 컴퓨터 구조를 이해하기 위해 형식논리, 알고리즘 증명, 재귀, 집합, 순열과 조합, 이항정리, 이진관계, 함수 및 행렬, 그래프, 트리, 그래프 알고리즘, 프로그램의 검증, 부울 대수와 컴퓨터 논리 등에 관하여 배운다. In order to understand the logical structure of digital computer from mathematical viewpoints, this course is designed to learn formal logic, proof of algorithm, recursion, set, permutation and combination, binomial theorem, binary relation, function and matrix, graph, tree, graph algorithm, program verification, Boolean algebra, and computer logic. ∙UI/UX프로그래밍 (UI/UX Programming) 본 교과목은 UI/UX 프로그래밍에 필요한 모든 과정을 순차적으로 학습하고, 실제 인터페이스 구현에 적용해 보는 수업이다. 우선, UI/UX의 정의 및 최적의 사용자 경험을 제공하기 위한 필요한 요소들에 대한 이론적인 배경을 배우고, 이를 달성하기 위해 따라야 하는 디자인 프로세스에 대한 실습을 수행한다. 또한, 인터페이스 프로그래밍 관련 기초 프로그래밍 기술을 학습하여, 수업 프로젝 트를 통해 학생이 스스로 모든 과정을 직접 겪어보는 학습과정을 거친다. This course aims to learn all the steps required for UI/UX programming sequentially and applies it to real interface implementation. First, students will learn the theoretical background about the definition of UI/UX and the necessary factors to provide the optimal user experience, and conduct a practical training on the design process to achieve this. In addition, students will learn basic programming skills related to interface programming, and through the class project, the student goes through a process of learning all of the processes themselves. ∙데이터베이스 (Database) 데이터베이스 시스템을 이루는 기본 구성 요소에 대한 이론을 소개하고, ER-모델 및 관계데이터 모델을 중심으로 한 데이터베이스 설계 이론과 동시성 제어, 회복, 트랜잭션 관리와 같은 데이터베이스 관리 시스템을 구현하는 이론을 소개한다. This course is to provide the basic understanding about database systems and introduce database design techniques based on ER-model and relational data model. It also deals with theoretical issues for implementing DBMS(Data Base Management Systems) such as concurrency control, recovery, and transactions managements. ∙컴파일러 (Compiler) 컴퓨터과학의 근간을 이루는 컴파일러의 개념을 배운다. 구체적으로, 어휘분석, 구문분석, 언어의 문법적 표현과 분류, 유한상태 기 계, push-down 자동장치, 정규언어, 파싱 기법의 요소들을 이해하고 응용할 수 있는 능력을 키운다. 51 Ⅶ. 소프트웨어융합대학 교육과정"}
{"id": "5edb09a8cba248fa8284a2cc98c3a938", "source": "sw_pdf.pdf", "page": 52, "text": "Students learn the concept of a compiler, which is the basis of computer science. Learn the relationship between compilers and formal languages. Specifically, it develops the ability to understand and apply the elements of lexical analysis, syntax analysis, grammatical expression and classification of language, finite state machine, push-down automata, regular language, and parsing technique. ∙메타버스시스템 (Metaverse System) 메타버스 시스템은 인간의 오감과 관련된 데이터를 처리하는 방법에 대한 기본적인 방법론을 다루는 과정이다. 본 과정은 메타버스 시대에 멀티미디어 데이터를 서로 교환하는 메타버스 시스템을 구현하기 위한 각 기본 기능(이미지, 그래픽, 애니메이션, 비디오, 사운드, 오디오)에 대한 개념적 접근을 수행한다. Metaverse system is the process of dealing with basic methodologies on how to handle data related to human five senses. This course conducts a conceptual approach to each basic function (image, graphics, animation, video, sound, audio) to implement a metaverse system that exchanges multimedia data with each other, in the metaverse-era. ∙소프트웨어공학 (Software Engineering) 소프트웨어 공학 분야는 프로그램이 방대하고, 오랜 기간 동안 많은 프로그래머들이 참여하는 경우 발생되는 문제를 다룬다. 본 강 좌에서 학습하는 분야는 프로그래밍 프로젝트의 설계와 구성, 시험과 프로그램 신뢰도, 소프트웨어 비용의 성격과 발생원인 인지, 여러 프로그래머간의 협조, 사용자 친화적 인터페이스 설계 및 문서화 등이다. The field of software engineering deals with problems that arise when programs are large, when they involve many programmers, and when they exit over long periods of time. Topics will include organizing and designing a programming project, testing, and program reliability, identifying the nature and sources of software costs, coordinating multiple programmers, documentations and design of friendly use interfaces. ∙SW스타트업비즈니스 (SW Start-Up Business) 실리콘벨리의 수많은 성공한 창업가들이 컴퓨터공학과 출신으로 이미 컴퓨터공학은 창업가들로 하여금 가장 핵심적이고 중요한 기 술로 부각되고 있다. 구글, 마이크로소프트, 샤오미 등에서 제시하는 차세대 기술에 대해 연구하고 이러한 기술을 기반으로 한 모의 창업을 통해 졸업 후 사업가 역량을 배양한다. Many successful entrepreneurs major computer engineering from the Silicon Valley. Computer engineering has emerged as the most critical and important skills of entrepreneurs. This course researching on a next-generation technology proposed by Google, Microsoft and Xiaomi. Students simulate a mock business based on research result and improve business skills needed at the company after graduation. ∙SW스타트업프로젝트 (SW Start-Up Project) 산업사회가 고도화되면서 창업의 비중이 점차 높아지고 있는 추세이다. 오픈소스SW를 기반으로 창업아이템 선정, 사업기획, 제품샘 플 개발까지의 일련의 과정을 포함한 모의창업을 연계하여 실제 창업 프로세스를 경험한다. As the industrial society becomes more sophisticated, the proportion of start-ups is gradually increasing. Based on open source software, students experience the actual start-up process by linking mock startups including a series of processes from startup item selection, business planning, and product sample development. ∙영상처리 (Image Processing) 2차원 신호인 디지털영상신호의 표현, 영상신호처리의 기본 단계, 영상신호처리 시스템의 요소, 디지털영상의 기초, 푸리에 변환, FFT, DCT를 포함한 영상변환, 영상신호의 향상 및 영상신호의 복구에 대하여 강의한다. This course teaches representation of 2D digital image signal, basic processing steps of image signal, elements of image signal processing system, image transform including Fourier transform, FFT and DCT, enhancement and restoration of image signal. 52 2025학년도 교육과정"}
{"id": "c6592861f80f43fdab357abc6e397285", "source": "sw_pdf.pdf", "page": 53, "text": "∙컴퓨터그래픽스 (Interactive Computer Graphics) 2D와 3D 객체의 생성과 디스플레이를 위한 기본적인 기술들을 소개한다. 주요 강의 내용은 그래픽스를 위한 자료구조, 그래픽 프로 그래밍 언어, 기하학적 변환, shading, 가시화 등을 포함한다. This course introduce techniques for the interactive generation and display of two and three dimensional objects. The topics to be covered will include data structure for graphics, geometric transformation, shading, visualization, and languages for graphics. ∙메타버스데이터처리 (Metaverse Data Processing) 메타버스 시대에는 모든 데이터가 100% 압축된 상태로 서로에게 전달된다. 압축된 데이터 중 가장 큰 데이터는 메가 데이터인 비디오 데이터이다.비디오 데이터는 2K-4K에서 8K로 매우 사실적인 느낌을 주며 해상도는 NK로 확장된다. 상상할 수 없을 정도로 많은 양의 데이터를 전송하고 처리하기 위해서는 가장 기본적인 압축을 익힐 필요가 있다. 본 과정은 이미지/오디오/비디오, 손실/ 무손실 비디오 압축 방법, JPEG, MPEG 등 국제 표준의 사례 연구 등 메타버스 데이터를 교환하기 위한 기본 알고리즘에 대한 개념적 연구를 수행한다. In the Metaverse-era, all data is delivered to each other in a 100% compressed state. The largest data among the compressed data is video data as mega data. Video data goes from 2K-4K to 8K for ultra-realistic feel, and resolution is extended to NK. In order to transmit and process an unimaginably large amount of data, it is necessary to learn the most basic compression. This course conducts a conceptual study on the basic algorithms for exchanging metaverse data such as image/audio/video, loss/lossless video compression methods, the case studies of international standards such as JPEG, MPEG, etc. ∙인간-컴퓨터상호작용 (Human-Computer Interaction) 본 과목은 인간-컴퓨터 상호작용 전반에 걸친 기본 원칙들과 그 원칙들의 응용사례들을 소개하는 과목으로 상호작용 가능한 컴퓨터 시스템을 사용자 중심의 방법론 안에서 디자인하는 방법, 그리고 이러한 시스템을 사용성 측면에서 평가하는 방법을 배우게 된다. 특히, 컴퓨터 공학은 물론 인지과학, 사회과학, 상호작용 디자인 등 여러 학문분야가 다양하게 유기적으로 연결되어 있는 학문으로 써, 본 과목에서 다룰 기본 원칙과 방법론들은 상호작용 가능한 모든 소프트웨어 및 하드웨어 시스템에 적용 가능함으로 통신, 협동, 교육, 의료 등 인간들의 삶의 질을 향상시키는데 아주 중요한 역할을 한다고 볼 수 있다. This course aims at introducing basic principles and application examples of human-computer interaction(HCI). The students will learn the way how to design interactive computer systems through a user-centered approach and how to evaluate such systems in terms of usability. The principles, methods, techniques, and tools to be thought in this course are based on diverse areas including computer science, cognitive science, social science, and interaction design. The HCI principles and methods are used in designing and evaluation of most software and hardware systems that interact with human such as education, entertainment, and medical application. ∙빅데이터프로그래밍 (Big Data Programming) 대량의 정형 또는 비정형 데이터의 집합체인 빅데이터의 5V(규모, 다양성, 속도, 정확성, 가치) 요소에 대해 학습하고, 빅데이터로부 터 가치를 추출하고 결과를 분석하기 위한 하둡의 맵리듀싱에 대해 학습한다. Learn 5V elements(Volume, Variety, Velocity, Veracity, Value) of Big Data, a collection of large quantities of structured or unstructured data, and learn Hadoop and MapReducing for extracting values from Big Data and analyzing results. ∙최신기술콜로키움1 (Latest Technology Colloquium 1) 소프트웨어 기반의 융합 분야에 대한 최신 기술을 해당 분야 전문가를 초청하여 듣도록 한다. 학교 내부와 산업체 전문가를 초청하 게 되며, 학생들은 강연에 대한 요약과 함께, 본인의 진로와 연관된 의견을 보고서로 작성하여 제출한다. 성적은 출석과 보고서에 기반하여 Pass 혹은 Fail로 판단된다. Invite experts from the field to hear the latest technology in the field of software-based convergence. Each track will invite school professionals and industry experts. Students will submit a summary of the lecture, along with a report 53 Ⅶ. 소프트웨어융합대학 교육과정"}
{"id": "e5404cfd50a74fc79af431b5bc6728b3", "source": "sw_pdf.pdf", "page": 54, "text": "on their career. The grade is judged to be Pass or Fail based on attendance and report. ∙컴퓨터비전 (Computer Vision) 본 과목은 사람이 시각 정보를 이용하여 지능적인 판단과 행동을 하는 것과 마찬가지로, 컴퓨터(기계)도 사람과 같이 시각 정보를 획득, 처리하고 이를 이용하여 객체 인식 및 행동 인식과 같은 지능적인 일을 수행 할 수 있도록 하는 최신 연구 분야를 공부한다. 기초적인 영상 분석 및 기계 학습 방법들을 활용하여 Feature Extraction, Visual Tracking, Shape Matching, Pattern Detection, Object Recognition, Gesture Recognition, Scene Understanding 및 3D Reconstruction과 같은 세부 연구 분야 들을 공부한다. Computer vision is an interdisciplinary research field that deals with how computers can be made for gaining high-level understanding from digital images or videos. In this class we study following topics: Feature Extraction, Visual Tracking, Shape Matching, Pattern Detection, Object Recognition, Gesture Recognition, Scene Understanding, 3D Reconstruction. ∙블록체인 (Blockchain) Web3시대를 열어가는 기반기술인 블록체인에 대해 알아봅니다. 비트코인 부터 시작된 블록체인의 역사와 이더리움을 거쳐 다양한 Web3 application이 어떤식으로 진화했는지 앞으로 어떻게 발전해 나갈 수 있을지 알아봅니다. 또한 간단한 블록체인 프로그래밍 을 통해 Web3 application개발을 시작해 봅니다. Learn about blockchain, the underlying technology for the Web3 era. Learn about the history of blockchain, starting with Bitcoin, and how various Web3 applications have evolved through Ethereum, and how they will evolve in the future. You will also learn how to start developing Web3 applications through simple blockchain programming. ∙AI네트워킹 (AI Networking) 본 과정에서는 인터넷프로토콜의 핵심 기술을 다룬다. 또한 SVM, CNN, RNN, 강화학습과 같은 머신러닝의 중요기술을 기반으로 네트워킹 응용을 어떻게 구현할 것인가에 대해 강의한다. 그리고 프로젝트를 통해 수강생들은 AI기반 인터넷 응용과 IoT네트워킹에 대한 설계 능력과 구현능력을 배양한다. In this course, student can learn on the key technology of internet Protocol such as TCP/IP. In addition, it introduces the machine learning algorithms such as SVM, CNN, RNN, etc. Also, the network related applications using machine learning will be learned. Through project, the student can obtain the designing and implementing capabilities of AI based internet application and IoT systems. ∙모바일/웹서비스프로그래밍 (Mobile/Web Service Programming) 오픈소스 프로그래밍 개발 환경에서 모바일 및 웹서비스 프로그래밍의 기본 개념을 배우고 여러 응용 프로그래밍을 구현 함으로서 실제 업무에 적용 가능한 실무능력을 향상시킨다, This course is designed for learning a fundamental concept of mobile programming and web-service programming based on the open source development environment. ∙디자인적사고 (Design Thinking) 새로운 소프트웨어 개발을 위한 디자인 중심의 창의적 설계 접근방법과 아이디어 발상을 위한 이론적 프로세스를 팀워크를 통해 학습한다. We will learn the design-oriented creative design approach for new software development and the theoretical process for idea development through teamwork. ∙ 마이크로서비스프로그래밍 (Microservice Programming) 데이터센터에서 마이크로서비스를 개발하고 운영하는 개발 방법론과 도구에 대한 이론을 이해하고 실습을 수행한다. 대표적인 기술 로서 클라우드 컴퓨팅, 컨테이너/오케스트레이션 기술, 마이크로 서비스, DevOps에 대해서 이해하고, 실습을 통해서 직접 데이터센 54 2025학년도 교육과정"}
{"id": "8f7fb18f52484b5ba2001470822eb5ba", "source": "sw_pdf.pdf", "page": 55, "text": "터의 소프트웨어 개발 환경을 구축하고, 시험/운영하는 능력을 함양한다. Understand and practice theories on microservice development methodologies and tools used in data centers. As a representative technology, students will understand cloud computing, container/orchestration technology, microservices, DevOps, and build the ability to directly build and test/operate the software development environment of the data center. ∙최신기술콜로키움2 (Latest Technology Colloquium 2) 소프트웨어 기반의 융합 분야에 대한 최신 기술을 해당 분야 전문가를 초청하여 듣도록 한다. 학교 내부와 산업체 전문가를 초청하 게 되며, 학생들은 강연에 대한 요약과 함께, 본인의 진로와 연관된 의견을 보고서로 작성하여 제출한다. 성적은 출석과 보고서에 기반하여 Pass 혹은 Fail로 판단된다. Invite experts from the field to hear the latest technology in the field of software-based convergence. Each track will invite school professionals and industry experts. Students will submit a summary of the lecture, along with a report on their career. The grade is judged to be Pass or Fail based on attendance and report. ∙로봇프로그래밍 (Robot Programming) 미래자동차와 로봇의 하드웨어, 소프트웨어 플랫폼, 핵심 기술 애플리케이션 소프트웨어의 구조를 이해하고 직접 다뤄보도록 한다. 자율적으로 움직이거나 판단하는 미래자동차와 로봇을 위한 센서와 컴퓨터/로봇 비전 요소 기술의 이론을 학습하고 실습을 통하여 직접 구현해본다. In this course, students understand the structure of hardwares, software platforms, and core application softwares of future cars and robots. Students learn and develop various sensors and computer/robot vision related technologies for autonomous driving vehicles and mobile robots. ∙인공지능과게임프로그래밍 (AI and Game Programming) 소프트웨어 또는 관련 전공의 학생들을 위하여, 게임 프로그래밍을 통해 게임 요소, 자료 및 신호 분석, 인공지능에 대한 실질적인 프로그래밍 개념들을 소개하고 실습한다. 이 강의는 다음의 요소를 포함한다 : 1)게임 구성 요소 : 렌더링과 게임 물체를 위한 충돌 과 물리, 2)데이터 및 신호 분석 : 주파수 처리, 필터 및 압축, 3)인공지능 : 단층 퍼셉트론, 다층 퍼셉트론, 컨볼루션 신경망 및 검증 This course introduces and practices some concepts of practical programming for game components, data and signal analysis, and AI using game programming for students pursuing in software or related major. It includes the following contents : 1)game components: rendering and collision and physics for game objects, 2)data and signal analysis: frequency processing, filtering and compression, and 3)AI : single perceptron, multi-layer perceptron, convolutional neural networks and validations. ∙자연언어처리 (Natural Language Processing) 이 과목은 자연언어처리(NLP)의 다양한 문제들을 다룬다. 따라서, 띄어쓰기, 형태소 분석 등과 같은 전통적인 자연언어처리에 주목 하며, 학생들이 자신만의 문제에 이 기법을 적용할 수 있도록 하는 것을 목표로 한다. This course covers a wide range of tasks in natural language processing (NLP). It covers traditional NLP tasks such as word spacing, morphological analysis, parsing, and so on so that the students can apply these NLP techniques to their own problems. ∙강화학습 (Reinforcement Learning) (*로봇·비전) 본 강의에서는 심층 신경망을 이용한 강화학습의 이론에 대해서 공부하고 실습을 통해 직접 구현해본다. 강화학습의 기본 개념, 벨 만 방정식, 마르코프 결정 과정 등을 설명하고, 정책 함수 및 가치 함수 기반의 학습 방식에 대해서 공부한다. 시뮬레이션 기반으로 최신 심층 강화학습 알고리즘을 직접 구현해 본다. 55 Ⅶ. 소프트웨어융합대학 교육과정"}
{"id": "e98225ab60064dff8f63864823dd22ce", "source": "sw_pdf.pdf", "page": 56, "text": "In this course, we will study the theory of reinforcement learning using deep neural networks and implement it directly through practice. Basic concepts of reinforcement learning, Bellman's equation, Markov decision process, etc. are explained, and learning methods based on policy functions and value functions are studied. We will cover recent deep reinforcement learning algorithms, and implement them on simulated environments. ∙창업현장실습 (Field Training for Start-up) 학생들이 실제 창업 환경에서 직접 참여해 창업 과정을 경험하고, 창의적 문제 해결 능력과 실전 비즈니스 역량을 키울 수 있도록 돕는다 (창업활동 기간 및 창기간에 따라 학점부여). This couse helps students directly engage in real entrepreneurial environments, allowing them to gain experience in the startup process and develop creative problem-solving skills and practical business capabilities. ∙단기현장실습 (Short-Term Internship) 관련 기업에서 실무 경험을 통해 전공지식을 응용한다. (활동기간에 따라 학점 부여) This course gives the students a chance to apply theoretical knowledge of artificial intelligence to a field application in a short term. ∙장기현장실습 (Long-Term Internship) 관련 기업에서 장기 실무 경험을 통해 전공지식을 응용한다. (활동기간에 따라 학점 부여) This course gives a chance to apply theoretical knowledge of artificial intelligence to a field application through long-term practical experience. 56 2025학년도 교육과정"}
{"id": "6c36a581b48e4561b51aedf861cff756", "source": "sw_pdf.pdf", "page": 57, "text": "[별표4] 인공지능 이론 마이크로디그리 이수 체계도 인공지능 이론 1. 마이크로디그리명(영문): 마이크로디그리 (Artificial Intelligence Theory Micro Degree) 2. 마이크로디그리 목표: 인공지능에 필요한 이론 및 기계학습 전문 인재 양성 3. 마이크로디그리 소개 ① 오픈소스 기반 인공지능 기초 이론 및 실습 ② 인공지능 개발을 위한 머신러닝 및 딥러닝 심화 이론 ③ 인공지능의 기초가 되는 예측 및 모델링의 개념 및 알고리즘 4. 마이크로디그리 이수 역량과 자격 ① 본인의 아이디러를 조기에 사업화/창업하고 싶은 소프트웨어 비전공자 ② 자신만의 인공지능 디자인을 희망하는 전공/비전공자 ③ 인공지능 융합역햑 배양을 희망하는 전공/비전공자 ④ 소프트웨어융합학과 ‘웹/파이선프로그래밍’ 사전 수강 권장 ⑤ 2학기 이상 이수한 재학생(편입생은 1학기 이상)에게 마이크로디그리의 신청자격을 부여하며, 마이크로디그리 이수를 희망 하는 자는 학기별 소정의 기간에 신청 후 이수하면 된다. (단, 수업연한 초과자는 신청할 수 없음) ⑥ 마이크로디그리는 최대 3개까지 신청 및 이수할 수 있다. 단, 특정 학부(과) 소속학생의 신청이 제한될 수 있다. ⑦ 이수 중인 마이크로디그리를 포기하고자 하는 자는 학기별 소정의 기간에 마이크로디그리 포기 신청을 해야 한다. ⑧ 최종 이수 확정 된 마이크로디그리는 포기할 수 없다. ⑨ 마이크로디그리 미이수자 중 졸업요건을 충족한 자는 마이크로디그리를 위해 졸업유예를 할 수 없다. 5. 인공지능 이론 마이크로디그리 이수학점 총계 9 6. 마이크로디그리 이수방법 ① 마이크로디그리 신청자는 신청한 마이크로디그리의 이수체계에 따라 교과목을 이수하여야 한다. ② 마이크로디그리 신청 전에 해당 과목을 이수하였을 경우 이수학점으로 인정한다. ③ 마이크로디그리로 인정된 교과목은 전공 및 교양학점으로 중복 인정한다. ④ 이수 중인 마이크로디그리를 포기할 경우 기 이수한 교과목은 전공 및 교양, 또는 일반선택 학점으로 인정한다. ⑤ 마이크로디그리 이수 후 마이크로디그리 수료증을 발급받을 수 있으며, 성적증명서에 그 사실을 기재한다. 57 Ⅶ. 소프트웨어융합대학 교육과정"}
{"id": "cf3143374a8f4fef80be57756e48197b", "source": "sw_pdf.pdf", "page": 58, "text": "인공지능 실전 마이크로디그리 이수 체계도 1. 마이크로디그리명(영문): 인공지능 실전 마이크로디그리 (Artificial Intelligence Practical Micro Degree) 2. 마이크로디그리 목표: 인공지능에 필요한 실습 및 기계학습 전문 인재 양성 3. 마이크로디그리 소개 ① 인공지능을 위한 자연언어 처리 및 응용기술 ② 딥러닝/기계학습 이론을 실제 문제에 응용할 수 있는 기술 4. 마이크로디그리 이수 역량과 자격 ① 본인의 아이디어를 조기에 사업화/창업하고 싶은 소프트웨어 비전공자 ② 인공지능을 활용하여 자기 전공에 발생하는 문제를 해결하고자 하는 비전공자 ③ 자연어처리를 통한 인공지능 개선에 관심이 있는 전공자/비전공자 ④ 딥러닝 및 기계학습의 실전 응용에 관심이 있는 전공자/비전공자 ⑤ 소프트웨어융합학과 ‘웹/파이선프로그래밍’ 사전 수강 권장 ⑥ 2학기 이상 이수한 재학생(편입생은 1학기 이상)에게 마이크로디그리의 신청자격을 부여하며, 마이크로디그리 이수를 희망 하는 자는 학기별 소정의 기간에 신청 후 이수하면 된다. (단, 수업연한 초과자는 신청할 수 없음) ⑦ 마이크로디그리는 최대 3개까지 신청 및 이수할 수 있다. 단, 특정 학부(과) 소속학생의 신청이 제한될 수 있다. ⑧ 이수 중인 마이크로디그리를 포기하고자 하는 자는 학기별 소정의 기간에 마이크로디그리 포기 신청을 해야 한다. ⑨ 최종 이수 확정 된 마이크로디그리는 포기할 수 없다. ⑩ 마이크로디그리 미이수자 중 졸업요건을 충족한 자는 마이크로디그리를 위해 졸업유예를 할 수 없다. 5. 인공지능 실전 마이크로디그리 이수학점 총계 9 6. 마이크로디그리 이수방법 ① 마이크로디그리 신청자는 신청한 마이크로디그리의 이수체계에 따라 교과목을 이수하여야 한다. ② 마이크로디그리 신청 전에 해당 과목을 이수하였을 경우 이수학점으로 인정한다. ③ 마이크로디그리로 인정된 교과목은 전공 및 교양학점으로 중복 인정한다. ④ 이수 중인 마이크로디그리를 포기할 경우 기 이수한 교과목은 전공 및 교양, 또는 일반선택 학점으로 인정한다. ⑤ 마이크로디그리 이수 후 마이크로디그리 수료증을 발급받을 수 있으며, 성적증명서에 그 사실을 기재한다. 58 2025학년도 교육과정"}
{"id": "5a588357e4b4495aa583a69d06abc24c", "source": "sw_pdf.pdf", "page": 59, "text": "[별표5] 인공지능학과 전공능력 1. 대·내외 환경분석 2. 주요 요구 내용 - 학생 코딩 능력의 중요성 인식 - 인공지능의 세부 분야에 대한 교과목 확대 - 산업체에서 활용 가능한 인공지능 응용분야에 대한 교육 확대 - 산업체 인재에 대한 겸직 교수제 도입 3. 인공지능학과 시사점 도출 - 인공지능을 활용하는 여러 응용분야에 대한 과목이 확충 되어야 하며, 이를 수행하기 위한 우수 교수진 추가 확보 등 거교적 차원의 계획이 필요함 59 Ⅶ. 소프트웨어융합대학 교육과정"}
{"id": "3a99a7a584574fa38d28f60ea2f496ac", "source": "sw_pdf.pdf", "page": 60, "text": "4. 인공지능학과 교육목표 및 인재상 학과(전공) 경희대학교의 창학이념인 ‘문화세계창조’를 공학적으로 발전시켜 교육목표 ‘인간중심의 인공지능’(Humanover AI)을 실현하고 미래 인공지능 분야를 이끌어 갈 인재 양성 목표 학과(전공) 인재상 5. 인공지능학과 전공능력 6. 전공능력 제고를 위한 전공 교육과정 구성 및 체계도 가. 전공 교육과정 구성표 60 2025학년도 교육과정"}
{"id": "2d052dfd2015426f8d01be4bd9a9e9b8", "source": "sw_pdf.pdf", "page": 61, "text": "나. 권장 이수 체계도"}
{"id": "ebc8b4949e494abeae839b941598761b", "source": "sw_pdf.pdf", "page": 62, "text": "다. 인공지능학과 자유전공 예상 이수 체계도 (2학년부터) 62 2025학년도 교육과정"}
{"id": "2e9dc83174bd457b8bed645bdced0f62", "source": "sw_pdf.pdf", "page": 63, "text": "소프트웨어융합대학 교육과정 요약표(2025) 대학소개 ◩ 소프트웨어융합대학은 4차 산업혁명을 주도할 실천적 소프트웨어 인재 양성을 위해서 컴퓨터공학과와 소프트웨어융합학과의 2학과 멀티 트랙의 체제로 2018년도 설립한다. 이후 2022년도 인공지능학과의 신설을 계기로, 컴퓨터공학부(컴퓨터공학과, 인공지능학과)와 소프트웨어융합학과의 체제로 개편되었다. ◩ 소프트웨어융합대학의 STEP(Software Talent Enhancement Program)에 기반 한 심화 소프트웨어 전문가 양성 교육을 컴퓨 터공학과에서 수행한다. 이는 산업계 및 글로벌 스탠다드에 준하는 실습과 프로젝트 교육 강화 등을 통해서 빅데이터, 모바일 /보안, IoT(Internet of Thing), 스마트 콘텐츠 분야의 소프트웨어 전문가를 양성하는 교육을 수행한다. 인공지능학과는 컴퓨터 공학 및 수학 능력을 기반으로, 실세계 문제를 인공지능 기술로 해결하는 실천 능력, 그리고 인간에 대한 이해 및 윤리의식에 바탕을 둔 글로벌 경쟁력을 확보한 인재를 양성하는 교육을 수행한다. ◩ 소프트웨어융합대학의 SWING(SoftWare Industry for Next-Generation)에 기반 한 소프트웨어 신산업 융합 전문가 양성 교육을 소프트웨어융합학과에서 수행한다. 이를 소프트웨어 핵심과 융합 목표 전공을 위한 압축 교육을 통해서 게임 콘텐츠, 데이터 사이언스, 로봇･비전 및 미래를 스스로 설계하고 기획해 갈 수 있는 글로벌 리더 양성을 통한 소프트웨어 신산업 융합 전문가를 양성하는 교육을 수행한다. 1. 교육목적 창의력과 전문성을 갖추고 새로운 산업과 학문을 주도할 실전적 소프트웨어 인재 양성 2. 교육목표 1) 소프트웨어 중심 기업/학계 및 소프트웨어 관련 창업을 주도하기 위하여, 심화 소프트웨어 전문가 교육을 수행함으로써 소프트 웨어 분야 핵심 개발 능력을 보유한 인재를 육성 2) 융합 목표 분야 관련 기업 및 융합 창업을 주도하기 위하여, 소프트웨어 신산업 융합 전문자 교육을 수행함으로써, 융합분야에 특화된 전공지식과 소프트웨어 개발 능력을 보유한 인재를 육성 3) 4차 산업혁명의 중심인 인공지능 분야를 주도하기 위하여, 이론적 지식과 실전적 능력을 모두 함양하는 교육을 수행함으로써 인공지능의 핵심 연구 및 개발 능력을 보유한 인재를 양성 3. 설치학과 가. 컴퓨터공학부 컴퓨터공학과 나. 컴퓨터공학부 인공지능학과 다. 소프트웨어융합학과"}
{"id": "e4b4054fd643438793d39e7db6832a3a", "source": "sw_pdf.pdf", "page": 64, "text": "4. 대학 졸업 요건 ※ 교양이수는 후마니타스칼리지 교양교육과정을 따라야 함 ※ 전공이수는 각 전공별 교육과정 시행세칙에서 정한 졸업이수요건을 만족해야 함 ※ 2018학년도 이후 신입생(편입생, 순수외국인 제외)은 소프트웨어 기초지식 습득 및 마인드 함양을 위해, 각 학과에서 정한 SW교육을 이수해야 함 5. 전공별 교육과정 편성 교과목수 ※ 단기현장실습/장기현장실습 과목은 제외한 현황임 6. 졸업능력인증제 소프트웨어융합대학 졸업능력인증제도는 2023학년도부터 폐지한다. 7. 소프트웨어융합대학 전공과목(영어강좌)이수안내 2008학번 이후 신입생은 전공과목의 영어강좌 3과목 이상 이수를 졸업요건으로 충족해야 하며, 편입학생의 경우 전공과목 영어 강좌 1과목 이상을 이수해야 한다. 64 2025학년도 교육과정"}
{"id": "f783f74e4299463ea3411a8a40a2d74f", "source": "sw_pdf.pdf", "page": 65, "text": "소프트웨어융합대학 소프트웨어융합학과 교육과정 요약표(2025) 학과소개 ◩ 소프트웨어융합학과는 2017년도 경희대학교 소프트웨어융합대학에 설립되어 로봇･비전 트랙(Robot and Vision Track), 데 이터사이언스트랙(Data Science Track), 게임콘텐츠트랙(Game Contents Track) 및 융합리더트랙(Convergence Leader Track)을 개설하며, 향후 사회와 학생의 수요에 맞춘 유연한 트랙 운영을 목표로 한다. ◩ 소프트웨어융합학과는 소프트웨어의 급격한 발전과 인공지능(AI: Artificial Intelligence)의 보편화로 신세계가 만들어지는 제 4차 산업혁명이 시작된 세계적 추이를 반영하여 개설한다. 제4차 산업의 거대한 세계적 흐름을 선도하기 위하여, 신산업과 신학문을 선도하고, 미래 사회를 선도적으로 이끌어 나가는 인재 양성에 교육의 목표를 두고 있다. 소프트웨어융합학과는 소 프트웨어를 기반으로 혁신적으로 발전할 융합 분야를 선정하고, 분야별로 전문화된 융합 전공 지식과 특화된 소프트웨어개발 능력을 교육함으로써, 목표한 융합 분야에서 바로 창업하거나 실무 투입이 가능한 글로벌 리더급 인재를 양성 한다. ◩ 소프트웨어융합학과(Department of Software Convergence)는 학부 졸업자에 공학사(Bachelor of Engineering)을 부여 하며, 다음과 같이 학위명을 표기한다.(단, 트랙 이수 내역은 졸업증명서에만 표기함) - 소프트웨어융합학과 (게임콘텐츠트랙), Bachelor of Software Convergence (Game Contents Track) - 소프트웨어융합학과 (데이터사이언스트랙), Bachelor of Software Convergence (Data Science Track) - 소프트웨어융합학과 (로봇･비전트랙), Bachelor of Software Convergence (Robot and Vision Track) - 소프트웨어융합학과 (융합리더트랙), Bachelor of Software Convergence (Convergence Leader Track) ◩ 소프트웨어융합학과는 다전공 졸업자에 학부 졸업자와 동일한 학위명(학과 및 트랙)을 표기한다. 1. 교육목적 융합목표가 되는 분야에 대한 압축된 전공 지식과 해당 융합목표 분야에 특화된 소프트웨어 전문 지식 및 개발 능력을 토대로 신학문/신산업을 이끌어 나갈 인재 양성에 그 목적이 있다. 2. 교육목표 가) 소프트웨어융합학과는 융합이 기본이 되는 4차 산업분야를 선도할 수 있는 실천적 인재 양성을 목표로 하여, 졸업과 동시에 목표 산업 분야에서 바로 실무와 창업이 가능한 인력을 양성하는 것을 교육 목표로 함. 이를 위하여, 1) 수학적 지식과 2) 융합목표전공(Non-software, Domain Specific Knowledge)에 대한 전문 지식을 기반으로 하여, 3) 융합 분야에 특화된 소 프트웨어의 이론적 지식과 실무적 능력을 확보한 전문 인력 양성을 목표로 함. 이를 위하여 트랙별로 특화된 인재상을 재정립 하여 교육과정을 설계하고 운영하도록 함 나) [게임콘텐츠트랙] 게임이라는 콘텐츠에 대해 인문/예술/공학적인 관점에서 교육하고, 이를 기반으로 창의적인 문화･기술 융합 소프트웨어(VR/AR (Virtual Reality/Augmented Reality) Contents, O2O(Online to Offline) Game, Game & Computer Graphics Algorithm, Game AI, Interaction Technique, Interactive Contents 등)를 만들어 낼 수 있는 인력 양성을 목표로 함 다) [데이터사이언스트랙] 수학과 공학을 배경으로, 데이터의 생성부터 폐기의 전 과정에 대한 통합 실무를 수행할 수 있으며, Data Life-Cycle의 전 과정(기획~폐기)에 대한 실전적 능력을 배양하는 교육 라) [로봇･비전트랙] 스마트 모빌리티의 핵심인 자동차 및 로봇에 대한 소프트웨어를 통합적으로 개발할 수 있으며, 특히 지능형 로봇 및 자율주행의 비전(Vision) 기술을 기반한 인공지능 소프트웨어 구현 능력을 갖춘 인재를 양성함 마) [융합리더트랙] 학생 스스로 미래를 설계하고 새로운 융합분야를 창조해 낼 수 있도록 하는 교육 바) 소프트웨어융합학과의 다전공/부전공 교육과정은 비전공자에 대한 가치실현, 전공에 부합하는 소프트웨어 교육, 그리고 지속 가능한 소프트웨어 역량 교육을 목표로 운영함([그림1] 참조) 65 Ⅶ. 소프트웨어융합대학 교육과정"}
{"id": "6db9efa05940427db8c65e1acea6932e", "source": "sw_pdf.pdf", "page": 66, "text": "[그림 1] 소프트웨어융합학과 다전공/부전공 교육 목표 3. 학과별 교과목 수 ※ 소프트웨어융합학과 교육과정 시행세칙에 명기된, 트랙 참여 타학과의 전공과목 포함임 ※ 현장실습/장기현장실습 과목은 제외한 현황임 4. 소프트웨어융합학과 졸업 요건 1) 교육과정 기본구조표 ※ 교양이수는 교양교육과정 이수구조를 따름 ※ 트랙별 세부적인 전공이수 및 타전공 인정학점 등은 소프트웨어융합학과 교육과정 시행세칙에 따름 2) 졸업논문 소프트웨어융합학과의 ‘소프트웨어융합캡스톤디자인’을 이수하는 것으로 경희대학교 졸업을 위한 “졸업논문” 합격으로 인정한다. 단, ‘졸업논문(소프트웨어융합)’을 필히 수강신청 해야 한다. 66 2025학년도 교육과정"}
{"id": "36bef79592a44d5cbb8cbbfa00f8c51e", "source": "sw_pdf.pdf", "page": 67, "text": "소프트웨어융합대학 소프트웨어융합학과 교육과정 시행세칙(2025) 제 1 장 총 칙 제1조(학과설치목적) ① 소프트웨어융합학과는 소프트웨어의 급격한 발전과 인공지능(AI)의 보편화로 신세계가 만들어지는 제4 차 산업혁명이 시작된 현재의 세계적인 추이를 반영하여 개설한다. 제4차 산업의 거대한 세계적 흐름을 선도하기 위하여, 신산업 과 신학문을 선도하며, 미래 사회를 선도적으로 이끌어 나가는 인재 양성에 교육의 목표를 두고 있다. 소프트웨어융합학과는 소 프트웨어를 기반으로 혁신적으로 발전할 융합 분야를 선정하고, 분야별로 전문화된 융합 전공 지식과 특화된 소프트웨어개발 능 력을 교육함으로써, 목표한 융합 분야에서 바로 창업하거나 실무 투입이 가능한 글로벌 리더 인재를 양성한다. ② 소프트웨어융합학과에는 로봇･비전 트랙, 데이터사이언스트랙, 게임콘텐츠트랙 및 융합리더트랙을 개설하여, 향후 사회와 학 생의 수요에 맞춘 유연한 트랙 운영을 목표로 한다. ③ 게임콘텐츠트랙은 게임이라는 콘텐츠에 대해 인문/예술/공학적인 관점에서 교육하고, 이를 기반으로 창의적인 문화･기술 융합 소프트웨어(VR/AR (Virtual Reality/Augmented Reality) Contents, O2O(Online to Offline) Game, Game & Computer Graphics Algorithm, Game AI, Interaction Technique, Interactive Contents 등)를 만들어 낼 수 있는 인력 양성을 목표로 하는 교육이다. 데이터사이언스트랙은 수학과 공학을 배경으로, 데이터의 생성부터 폐기의 전 과정에 대한 통합 실무를 수행할 수 있으며, Data Life-Cycle의 전 과정(기획~폐기)에 대한 실전적 능력을 배양하는 교육이다. 로봇･비전 트랙은 스마트 모빌리티의 핵심인 자동차 및 로봇에 대한 소프트웨어를 통합적으로 개발할 수 있으며, 특히 지능형 로봇 및 자율주행의 비전(Vision) 기술을 기반한 인공지능 소프트웨어 구현 능력을 갖추는 것을 목표로 하는 교육이다. 융합리더트랙은 학생 스스로 새로운 융합분야를 개척할 수 있도록 하는 교육이다. 제2조(일반원칙) ① 소프트웨어융합학과를 단일전공, 다전공, 부전공으로 이수하고자 하는 학생은 이 시행세칙에서 정하는 바에 따라 교과목을 이수해야 한다. ② 교과목의 선택은 지도교수와 상의하여 결정한다. ③ 모든 교과목은 [별표1] 교육과정 편성표에 제시된 이수학년과 개설학기에 준해 이수할 것을 권장한다. ④ 전공과목의 선수과목지정은 [별표5]와 같으며, 선·후수과목의 체계를 준수하여 이수하여야 한다. 선·후수과목의 체계는 전산 시스템에 반영되어 있으며 수강신청 시 자동으로 적용된다. 단, 교과목 담당교수가 인터뷰를 통하여 선수과목의 필요여부를 판단하여 선수과목 미이수 학생에 대하여 수강을 허용할 수 있다. 제 2 장 교양과정 제3조(교양이수학점) 교양과목은 교양교육과정 기본구조표에서 정한 소정의 교양학점을 취득하여야 한다. 제 3 장 전공과정 제4조(전공 및 트랙과목 이수) ① 소프트웨어융합학과 단일전공과정 졸업을 위해서는 [표1]에 명시된 전공기초, 전공필수(융합필 수, 소프트웨어필수, 산학필수 포함), 전공선택 학점을 이수하여야 한다. ② 게임콘텐츠 트랙을 이수하고자 하는 학생은 [표1]의 전공선택 과목에서, 게임콘텐츠 트랙을 위하여 개설된 ‘트랙필수’ 교과목을 반드시 모두 이수하여야 한다. ③ 데이터사이언스 트랙을 이수하고자 하는 학생은 [표1]의 전공선택 과목에서, 데이터사이언스 트랙을 위하여 개설된 ‘트랙필수’ 교과목을 반드시 모두 이수하여야 한다. ④ 로봇･비전 트랙을 이수하고자 하는 학생은 [표1]의 전공선택 과목에서, 로봇･비전 트랙을 위하여 개설된 ‘트랙필수’ 교과목을 67 Ⅶ. 소프트웨어융합대학 교육과정"}
{"id": "a842ea760e5a4d71a3ef37ecaa52816e", "source": "sw_pdf.pdf", "page": 68, "text": "반드시 모두 이수하여야 한다. ⑤ 융합리더 트랙을 이수하고자 하는 학생은 [표1]의 전공선택 과목에서, 최소 36학점(12과목) 이수하여야 한다. ⑥ 학년별/학기별 교과목 편성은 [별표1]을 참조한다. ⑦ 소프트웨어융합학과를 다전공과정으로 이수하고자 하는 학생은 [표2]에 명시된 전공기초, 전공필수, 전공선택 학점을 이수하 여야 하며, [표3]에 명시된 타학과 과목들을 소프트웨어융합학과 전공과목으로 대체 인정받을 수 있다. ⑧ 소프트웨어융합학과 다전공과정을 이수하는 학생은 [표2]에 명시된 트랙 중 하나를 선택하여, 해당 트랙의 트랙필수 교과목을 반드시 모두 이수하여야 한다. ⑨ 소프트웨어융합학과를 부전공과정으로 이수하고자 하는 학생은 [표4]에 명시된 전공필수, 전공선택 학점을 이수하여야 한다. [표1] 단일전공 전공과목 편성표 ※ 졸업논문(0학점, P/N평가), 캡스톤디자인 교과목, 최신기술콜로키움1/최신기술콜로키움2(2학점, P/N평가), 독립심화학습1/2(3학점, P/N평가), 융합연구 1/2/3/4/5/6(1학점, P/N평가), 사운드디자인(2학점, 등급평가)이며, 상기 과목을 제외한 모든 과목은 3학점, 등급평가임 ※ 과목명에 학수번호 코드가 있는 과목은 소프트웨어융합학과의 트랙에 참여하는 타학과 과목임 (CSE: 컴퓨터공학과, EE: 전자공학과, DC: 디지털콘텐츠학과, IE: 산업경영공학과, ME: 기계공학과, ELC: 글로벌커뮤니케이션학부, ID: 산업디자인학과) ※ 산학필수에 대한 사항은 본 교육과정의 부칙 제3조(산학필수)에 따름 68 2025학년도 교육과정"}
{"id": "b78632db052d4b2c9f1ff76a07f526ed", "source": "sw_pdf.pdf", "page": 69, "text": "[표2] 다전공 전공과목 편성표 ※ 졸업논문(0학점, P/N평가), 캡스톤디자인 교과목, 최신기술콜로키움1/최신기술콜로키움2(2학점, P/N평가), 독립심화학습1/2(3학점, P/N평가), 융합연구 1/2/3/4/5/6(1학점, P/N평가), 사운드디자인(2학점, 등급평가)이며, 상기 과목을 제외한 모든 과목은 3학점, 등급평가임 ※ 과목명에 학수번호 코드가 있는 과목은 소프트웨어융합학과의 트랙에 참여하는 타학과 과목임 (CSE: 컴퓨터공학과, EE: 전자공학과, DC: 디지털콘텐츠학과, IE: 산업경영공학과, ME: 기계공학과) ※ 단기현장실습(소프트웨어융합학)은 최대 6학점 이내에서 인정할 수 있음 [표3] 대체인정과목 일람표 1) 1~4에 대해서, 우측 타학과 과목 수강시에 좌측 소프트웨어융합학과 과목으로 인정함 2) 5~9에 대해서, 소프트웨어융합학과 전공으로 인정하는 타학과 과목의 교과목명/교과목코드 변경에 따른 조치임 3) 소프트웨어융합학과를 다전공 과정으로 이수하고자 하는 학생 대상 4) 소프트웨어융합학과를 단일전공 과정으로 이수하고자 하는 전과생의 경우, 1번 항목을 제외하고 인정함 69 Ⅶ. 소프트웨어융합대학 교육과정"}
{"id": "3131673956324a4ebdbb82d334798401", "source": "sw_pdf.pdf", "page": 70, "text": "[표4] 부전공 전공과목 편성표 ※ 과목명에 학수번호 코드가 있는 과목은 소프트웨어융합학과의 트랙에 참여하는 타학과 과목임(CSE: 컴퓨터공학과) 제5조(타전공과목 이수) 융합리더트랙(단일전공자)에 한하여 전공심화를 위하여 학과장의 승인을 얻어 12학점까지 타전공과목 을 수강할 수 있으며, [별표11] 전공학점 타전공 교과목표에 명시된 과목에 한하여 전공선택학점으로 인정한다. 제6조(대학원 과목의 이수요건과 인정과목) ① 대학원 교과목을 이수하고 싶은 학생은 소프트웨어융합학과 학과장의 승인을 받 아 학과생의 이수가 허용된 대학원 교과목을 통산 6학점까지 이수할 수 있으며, 그 취득 학점은 전공선택 학점으로 인정한다. ② 또한, 대학원 시행세칙에 따라 본교의 학사학위과정 재학 중 본교의 일반대학원에서 개설한 교과목을 이수하여 B학점 이상 취득한 경우에는 학사학위 취득에 필요한 학점의 초과분에 한하여 제 1항의 절차를 거쳐 6학점 이내에서 대학원 진학 시에 대학원 학점으로 인정받을 수 있다. 제 4 장 졸업이수요건 제7조(졸업이수학점) 소프트웨어융합학과의 최저 졸업이수학점은 130학점이다. 제8조(전공 및 트랙이수학점) ① 단일전공과정 : 소프트웨어융합학과의 학생으로서 단일전공자는 전공기초 15학점, 전공필수(융 합필수, 소프트웨어필수, 산학필수 포함) 37학점, 전공선택 36학점을 포함하여 전공학점 88학점 이상을 이수하여야 하며, 소속 한 트랙에 따라 제4조의 ②항, ③항, ④항, ⑤항 중 본인의 트랙에 해당하는 사항을 반드시 이수하여야 한다. ② 다전공과정 : 소프트웨어융합학과 학생으로서 타전공을 다전공으로 이수하거나 타학과 학생으로서 소프트웨어융합전공을 다 전공과정으로 이수하는 학생은 전공기초 15학점, 전공필수 21학점, 전공선택 24학점을 포함하여 전공학점 60학점 이상 이수 하여야 한다. ③ 부전공과정 : 타학과 학생의 소프트웨어융합전공 부전공과정 이수는 제4조의 ⑨항을 따른다. 제9조(편입생 전공이수학점) ① 일반편입생은 전적대학에서 이수한 학점 중 본교 학점인정심사에서 인정받은 학점을 제외한 나 머지 학점을 추가로 이수하여야 한다. ② 학사편입생은 본교 학점인정심사에 의거 전공기초과목을 인정할 수 있다. ③ 학사 및 일반편입생이 융합리더트랙을 선택하는 경우, 전공기초/전공필수/전공선택 교과목에 대해서 학과장(혹은 담당주임 교수)이 과목별 상관성을 1:1로 확인 후, 일괄 인정한다. ④ 학사 및 일반편입생이 융합리더트랙이 아닌 다른 트랙을 선택하는 경우, 트랙필수 교과목은 학점인정하지 않는다. 트랙필수가 아닌 전공기초/전공필수/전공선택 교과목에 대해서는 학과장(혹은 담당주임교수)이 과목별 상관성을 1:1로 확인 후, 일괄 인정 한다. 이는 2017학번 이후 편입생에 대하여 소급 적용하며, 2017-2020학번 학사 및 일반편입생의 경우, 해당 트랙의 트랙필 수와 트랙선택 과목을 합하여 27학점 이상 이수해야 한다. ⑤ 편입생이 인정받을 수 있는 최대 학점은 경희대학교 학칙을 따른다. 제10조(영어강좌 이수학점) 전공과목 중에서 영어강좌를 3과목 이상, 편입생의 경우에는 1과목 이수하여 졸업요건을 충족하여 야 한다. 70 2025학년도 교육과정"}
{"id": "48d1873113ff484d96775b9332df0357", "source": "sw_pdf.pdf", "page": 71, "text": "제11조(졸업논문) 졸업논문(소프트웨어융합) 과목은 ‘소프트웨어융합캡스톤디자인(SWCON401)’ 교과목을 이수한 다음 학기에 수강하며, ‘소프트웨어융합캡스톤디자인(SWCON401)’ 수업의 결과물을 바탕으로 졸업논문을 작성 및 제출한다. 단, ‘졸업논문(소프 트웨어융합)’을 필히 수강신청 해야 한다. 제12조(SW교육 졸업요건) 2018학년도 이후 입학생(편입생, 순수외국인 제외)은 SW교양 또는 SW코딩 교과목에서 총 6학점을 이수하여야 한다. SW교양 및 SW코딩 교과목 개설 및 운영에 관한 세부사항은 소프트웨어 교육교과운영시행세칙을 따른다. 제13조(졸업능력인증제) 졸업능력인증제는 폐지하며, 경과조치를 따른다. 제 5 장 기 타 제14조(졸업논문 제출의무의 대상) 소프트웨어융합학과를 졸업하기 위해서는, 제11조에 의거하여 ‘소프트웨어융합캡스톤디자인 (SWCON401)’ 교과목을 이수한 후, 지도교수가 지정하는 시기에 졸업논문을 제출하여야 한다(다전공자 포함). 단, 소프트웨어 융합을 부전공하는 경우에는 제출의무를 적용하지 아니한다. 제15조(졸업논문 지도교수의 지정) 7학기 이수중에 전공지도교수에게 “졸업논문계획서”를 제출하고 졸업논문 지도교수를 지정 받아야 한다. 제16조(졸업논문 제출자격의 부여) 졸업논문 제출자격은 6학기를 이수한 후 소프트웨어융합학과에서 개최하는 “졸업논문발표 회”에서 1회 이상 발표한 자에게만 부여한다. 제17조(학생상담) 학생상담의 시기, 방법 등 세부사항은 소프트웨어융합학과의 내규를 따른다. 제18조(최초 트랙의 신청) ① 소프트웨어융합학과를 단일전공과정으로 이수하는 학생은 1학년 2학기에, 본인이 참여를 희망하는 트랙을 신청하여야 한다. 신청은 소프트웨어융합학과에서 지정하는 소정의 기간에 신청한다. 신청한 사항은 소프트웨어융합학과 교수회의를 통하여 심사 후 트랙 배정을 실시하는 것으로 한다. 융합리더트랙을 신청하고자 하는 학생은 별도의 “융합리더 학업 계획서”를 작성하여 제출한다. 소프트웨어융합학과 교수회의를 통하여 융합리더트랙 신청 학생을 심의 후 결정한다. 융합리더트랙 신청학생에 대한 학업계획은 교수회의의 권고를 통하여 조정가능하다. 융합리더트랙의 인원은 매년 교수회의를 통하여 결정하도록 한다. ② 소프트웨어융합학과를 다전공 과정으로 이수하고자 하는 학생은 다전공 신청기간에 학교시스템(info21.khu.ac.kr) 신청과 별 개로 오프라인으로 트랙 신청에 대한 양식에 맞춰 트랙 신청 이유를 제시하며, 이를 소프트웨어융합학과 교수회의에서 심의 하여 트랙 참여를 결정한다. ③ 소프트웨어융합학과를 부전공과정으로 이수하고자 하는 학생은 [표4]에 명시된 교육과정을 이수하고, 졸업예정학기에 학교시 스템에 직접 부전공을 신청한다. ④ 소프트웨어융합학과를 전과 혹은 편입으로 이수하고자 하는 학생은 전과/편입 시점에 트랙 신청에 대한 양식에 맞춰서 트랙 신청 이유를 제시하며, 이를 소프트웨어융합학과 교수회의에서 심의하여 트랙 참여를 결정한다. 제19조(트랙의 변경) 소프트웨어융합학과 학생의 트랙 변경은 원칙적으로 불가능 하다. 불가피하게 트랙을 변경하고자 하는 경우 는, 트랙 변경에 대한 사유를 지도교수에게 제출하고, 이에 대한 소프트웨어융합학과 교수회의를 통하여 결정한다. 제20조(복수 트랙의 이수) 소프트웨어융합학과 학생이 본인이 최초 선택한 트랙 외에 소프트웨어융합학과가 개설한 다른 트랙의 이수 조건을 만족한 경우는 복수 트랙에 대한 졸업 자격을 부여한다. 본인이 최초 선택한 트랙외의 추가 트랙에 대한 이수 여부는 제4조의 ②항, ③항, ④항, ⑤항에 따른다. 제21조(보칙) 본 내규에 정하지 않는 사항은 소프트웨어융합학과 회의 의결에 따른다. 71 Ⅶ. 소프트웨어융합대학 교육과정"}
{"id": "570d0f56c44d43b5bc2937839b73602c", "source": "sw_pdf.pdf", "page": 72, "text": "제22조(마이크로디그리 이수) 마이크로디그리 과정을 이수하고자 하는 자는 ‘[별표15] 마이크로디그리 이수체계도’에서 지정한 소정의 학점을 충족하여야 한다. 제23조(외국인 학생의 한국어 능력 취득) 한국어트랙 외국인 학생은 졸업 전까지 한국어능력시험(TOPIK) 4급 이상을 취득하여 야 한다. 부 칙 제1조(시행일) 본 시행세칙은 2025년 3월 1일부터 시행한다. 제2조(경과조치) ① 2017년 입학생 중 로봇･비전 트랙을 선택한 경우는 미분적분학 1(AMTH1002)과 미분적분학2(AMTH1003) 를 수강하는 것을 원칙으로 한다. 2017년 입학생 중 여타 트랙을 선택한 경우는 미분적분학 1(AMTH1002)을 수강하는 것을 원칙으로 한다. ② 소프트웨어융합학과 단일전공과정을 이수하고자 하는 전과생이 미분적분학1(AMTH1002)를 수강한 경우, 미분적분학 2(AMTH1003) 또는 미분적분학(AMTH1009)를 수강해야 한다. 이 경우, 미분적분학1(AMTH1002)은 전공기초로 인정하고, 미분적분학2(AMTH1003) 또는 미분적분학(AMTH1009) 중 1개 과목을 전공선택으로 인정한다. 소프트웨어융합학과 단일 전공과정을 이수하고자 하는 전과생은 [표3]에 명시된 타학과 과목들([표3]의 1번 항목은 제외)을 소프트웨어융합학과 전공 과목으로 대체인정 받을 수 있다. 타학과 교과목 대체인정 시, 중복 인정하지 않는다. 본 내용은 2019학년도 교육과정부터 포함되며, 2018학년도 전과생부터 경과조치한다. ③ 소프트웨어융합학과 다전공과정을 이수하고자 하는 학생은 [표3]에 명시된 타학과 과목들을 소프트웨어융합학과 전공과목으로 대체인정 받을 수 있다. 다전공자의 타학과 교과목 대체인정 시, 중복 인정하지 않는다. 본 내용은 2019학년도 교육과정부터 포함되며, 2018학년도 다전공자부터 경과조치한다. ④ 2017년 입학생(단일전공, 다전공, 편입생, 전과생 모두 포함)은 [별표5]에 명시된 소프트웨어융합학과 선수과목 지정표를 따 른다. ⑤ 2017년 입학생(단일전공, 다전공, 편입생, 전과생 모두 포함)은 [별표6]에 명시된 신규개설 및 대체된 교육과정을 따른다. ⑥ 2018년 입학생(단일전공, 다전공, 편입생, 전과생 모두 포함)은 [별표7]에 명시된 신규개설 및 대체된 교육과정을 따른다. ⑦ 2019년 입학생(단일전공, 다전공, 편입생, 전과생 모두 포함)은 [별표8]에 명시된 신규개설 및 대체된 교육과정을 따른다. ⑧ 2020년 입학생(단일전공, 다전공, 편입생, 전과생 모두 포함)은 [별표9]에 명시된 신규개설 및 대체된 교육과정을 따른다. ⑨ 2021년 이후 입학생(단일전공, 다전공, 편입생, 전과생 모두 포함)은 [별표10]에 명시된 신규개설 및 대체된 교육과정을 따 른다. ⑩ 융합리더 트랙(단일전공자)에 한하여 제5조(타전공과목 이수) 규정을 따르고 [별표11]에 명시된 교과목에 한하여 전공선택 학점으로 인정받을 수 있다. ⑪ 소프트웨어융합학과 다전공과정에 관한 제4조 8항이 추가되었다. 본 내용은 2020학년도 교육과정부터 포함되며 2018학년도 다전공자부터 경과조치 한다. ⑫ [표3] 대체인정교과목과 [별표5] 선수과목 지정표가 수정되었다. 본 내용은 2020학년도 교육과정부터 수정되었으며 2017년 부터 2019년 입학생(단일전공, 다전공, 편입생, 전과생 모두 포함)에 대하여 경과조치 한다. ⑬ 2017년 입학생(단일전공, 편입생, 전과생 포함)은 [표1]에 명시된 전공필수 14개 과목을 모두 이수해야 한다. 편입생의 경우, 제9조에 따라 대체인정 받을 수 있다. ⑭ [표1]과 [표2] 가 수정되어 졸업이수에 필요한 전공과목이 변경되었다. 본 내용은 2025학년도 교육과정부터 포함되며 2017 년부터 2024년 입학생(단일전공, 다전공, 편입생, 전과생 포함)은 본인의 입학년도를 기준함을 원칙으로 하나, 입학 이후 교 육과정 기본구조 변경시 본인의 입학년도~최종학년도 교육과정 중 원하는 교육과정에 따라 졸업이수조건을 만족할 수 있다. ⑮ 트랙이수내역(단일전공, 다전공, 편입생, 전과생 포함)은 졸업시 적용한 교과과정에 따라 표기한다. ⑯ (졸업능력인증제 폐지에 따른 경과조치) 졸업능력인증제 폐지는 2023학년도부터 모든 재적생에게 적용하되, 2023.02.28. 이전 수료자는 희망자에 한하여 이수면제 처리한다. 72 2025학년도 교육과정"}
{"id": "9f1a9dce540341a68ebb1ba7000c846c", "source": "sw_pdf.pdf", "page": 73, "text": "제3조(산학필수) 산학필수는 최신기술 콜로키움 1(CSE438, 2학점), 최신기술 콜로키움2(SWCON302, 2학점), 소프트웨어융합 캡스톤디자인(SWCON401, 3학점)과 각 트랙별 캡스톤디자인 과목 3학점(데이터분석캡스톤디자인(SWCON321), 게임콘텐츠캡 스톤디자인(SWCON367), 로봇･비전캡스톤디자인(SWCON332) 중 1과목), 현장실습/장기현장실습을 포함하여 총 10학점 이상 을 이수하여야 한다. 제4조(캡스톤디자인 교과목 수강 원칙) ① 트랙별 캡스톤디자인 교과목(로봇･비전캡스톤디자인, 데이터분석캡스톤디자인, 게임 콘텐츠캡스톤디자인)은 3학년 2학기 수강을 원칙으로 한다. 이를 수강한 경우에 대해서만 소프트웨어융합캡스톤디자인의 수강 을 허용하는 것을 원칙으로 한다. ② 로봇･비전캡스톤디자인/데이터분석캡스톤디자인/게임콘텐츠캡스톤디자인과 소프트웨어융합캡스톤디자인을 동시 수강할 수 밖에 없는 경우는, 학과의 심사를 거쳐 구제할 수 있다. ③ 트랙별 캡스톤디자인 교과목과 소프트웨어융합캡스톤디자인을 동시 수강하고자 하는 경우는, 해당 교과목의 수강을 희망하고 자 하는 학기의 개강 2달 전 (1월초, 7월초) 학과장에 사유서를 제출하여야 함. 사유서에 대해서, 학과 교수님(들) 간의 논의, 그리고 (필요시) 해당 학생과 학과 교수님들의 면담을 실시하여, 동시 수강 수용 여부를 허용할 수 있다. ④ 트랙별 캡스톤디자인과 소프트웨어융합캡스톤디자인을 동시에 진행하는 경우에 대해서, 두 과목에서 수행하는 내용은 절대로 겹치는 부분이 있어서는 안 됨. 종강시 교수님들의 심의를 통해서, 중복성이 있다고 판단되는 경우는, 수행 내용과 결과물을 고려하여, 두 과목 중 한 과목에 대해서 Fail 판정을 하는 것을 원칙으로 한다. [별표] 1. 교육과정 편성표 1부. 2. 소프트웨어융합학과 게임콘텐츠트랙 교육과정 이수체계도 1부. 3. 소프트웨어융합학과 데이터사이언스트랙 교육과정 이수체계도 1부. 4. 소프트웨어융합학과 로봇･비전트랙 교육과정 이수체계도 1부. 5. 선수과정 지정표 1부. 6. 2017학년도 교육과정 경과조치 1부. 7. 2018학년도 교육과정 경과조치 1부. 8. 2019학년도 교육과정 경과조치 1부. 9. 2020학년도 교육과정 경과조치 1부. 10. 2021/2022/2023/2024학년도 교육과정 경과조치 1부. 11. 전공학점인정 타전공 교과목표 1부. 12. 대체과목 지정표 1부. 13. 소프트웨어융합학과 교과목 해설 1부. 14. 단일전공 융합리더트랙 예시 1부. 15. 소프트웨어융합학과 마이크로디그리 이수체계도 1부. 16. 소프트웨어융합학과 전공능력 1부. 17. 자유전공학부 학생을 위한 소프트웨어융합학과 전공 이수체계도 1부. 73 Ⅶ. 소프트웨어융합대학 교육과정"}
{"id": "943357c347584988b279fa309e592a8d", "source": "sw_pdf.pdf", "page": 74, "text": "[별표1] 교육과정 편성표 74 2025학년도 교육과정"}
{"id": "58f069ee43ef410ea76d5fefaa1c2f35", "source": "sw_pdf.pdf", "page": 75, "text": "75 Ⅶ. 소프트웨어융합대학 교육과정"}
{"id": "bfaf32466a7540849ae00e25acb414de", "source": "sw_pdf.pdf", "page": 76, "text": "※ 1) 독립심화학습1/2(소프트웨어융합학과): 논문 작성 및 제출, 특허 출원, 소프트웨어 도서 출간, 첨단 기술 백서 출간 등을 설계 및 진행 ※ 2) 융합연구1/2/3/4/5/6 : 전공과목 멘토링, 외국인 학생 프렌드십, 프로그래밍 재능기부, 오픈소스 기여, 프로그램 앱스토어 등록 등을 설계 및 진행하 거나 소프트웨어 공모전, 창업 공모전, 프로그래밍 경진대회, 학술 공모전 등을 참가 및 출품 ※ 3) 현장실습/장기현장실습은 각 활동별로 3학점, 6학점, 12학점을 산학필수 학점으로 이수함 ※ 개설학기의 ‘△’ 표기는 강사의 사정 및 수강 인원을 감안하여, 선택적으로 개설이 될 수 있는 학기임 ※ 비고의 ‘포’는 포트폴리오 교과목으로서, 반드시 교과목내 결과물을 개발하고, 학부 과정 동안 개인 실적으로서 관리해야 함 76 2025학년도 교육과정"}
{"id": "560982cd637742f99119d9e4c43e517d", "source": "sw_pdf.pdf", "page": 77, "text": "[별표2] 소프트웨어융합학과 게임콘텐츠트랙 교육과정 이수체계도 77 Ⅶ. 소프트웨어융합대학 교육과정"}
{"id": "f8867f4a06964c45b5b4813fb86a47dc", "source": "sw_pdf.pdf", "page": 78, "text": "[별표3] 소프트웨어융합학과 데이터사이언스트랙 교육과정 이수체계도 78 2025학년도 교육과정"}
{"id": "6e96766ed39b4c24bc4f42663b038bc7", "source": "sw_pdf.pdf", "page": 79, "text": "[별표4] 소프트웨어융합학과 로봇·비전트랙 교육과정 이수체계도 79 Ⅶ. 소프트웨어융합대학 교육과정"}
{"id": "dd0fbf86ee9a47faaa0092cbc3158ece", "source": "sw_pdf.pdf", "page": 80, "text": "[별표5] 선수과목 지정표 ※ 우측 선수과목 수강시에 좌측 후수과목 수강을 허용함 ※ 교과목 담당교수가 수강 희망 학생과의 인터뷰를 통하여 선수과목 수준의 전공 이해 능력을 확인한 후, 선수과목의 필요가 없다고 판단한 경우에는, 선수 과목 미이수 학생에 대해서도 해당 과목의 수강을 허용할 수 있음 ※ 선수과목에 복수의 과목이 있는 경우는, 두 과목 중 한 과목을 수강하는 것을 의미함 80 2025학년도 교육과정"}
{"id": "9185d161a4bc4bbdb024ebea41b63ca5", "source": "sw_pdf.pdf", "page": 81, "text": "[별표6] 2017학년도 교육과정 경과조치 81 Ⅶ. 소프트웨어융합대학 교육과정"}
{"id": "ddad997aeef54918a52d63160f828525", "source": "sw_pdf.pdf", "page": 82, "text": "82 2025학년도 교육과정"}
{"id": "183f975528e74fb7b2111b3dee21a6cd", "source": "sw_pdf.pdf", "page": 83, "text": "※ 1) 현장실습/장기현장실습은 각 활동별로 3학점, 6학점, 12학점을 산학필수 학점으로 이수함 83 Ⅶ. 소프트웨어융합대학 교육과정"}
{"id": "cb20b05d5f574805b453442a7dd369db", "source": "sw_pdf.pdf", "page": 84, "text": "[별표7] 2018학년도 교육과정 경과조치 84 2025학년도 교육과정"}
{"id": "75c3f480cb5347b78564f4948f4b27b8", "source": "sw_pdf.pdf", "page": 85, "text": "85 Ⅶ. 소프트웨어융합대학 교육과정"}
{"id": "ab86b043111f47f2ad422960fb37fffe", "source": "sw_pdf.pdf", "page": 86, "text": "[별표8] 2019학년도 교육과정 경과조치 86 2025학년도 교육과정"}
{"id": "0d372c5b855b4033a0b2a918056dfc79", "source": "sw_pdf.pdf", "page": 87, "text": "87 Ⅶ. 소프트웨어융합대학 교육과정"}
{"id": "158690ee82954d51b144d9895d089cff", "source": "sw_pdf.pdf", "page": 88, "text": "[별표9] 2020학년도 교육과정 경과조치 88 2025학년도 교육과정"}
{"id": "79b01cf05a22453fbd7ac976b9e13be2", "source": "sw_pdf.pdf", "page": 89, "text": "89 Ⅶ. 소프트웨어융합대학 교육과정"}
{"id": "b722ed17c1374d0d95afc7c129e65175", "source": "sw_pdf.pdf", "page": 90, "text": "[별표10] 2021/2022/2023/2024학년도 교육과정 경과조치 90 2025학년도 교육과정"}
{"id": "691d9bf2536a4f5196815e6c73f07a31", "source": "sw_pdf.pdf", "page": 91, "text": "[별표11] 전공학점인정 타전공 교과목표 ※ 융합리더트랙(단일전공자)에 한하여, 다음의 타전공 교과목의 전공학점(전공선택)을 인정함 ※ 타전공 교과목의 최대 전공학점(전공선택) 인정 학점은, 본 교육과정의 관련 조항에 준함 91 Ⅶ. 소프트웨어융합대학 교육과정"}
{"id": "db32237e3e744fe291dea8e7eae81ff1", "source": "sw_pdf.pdf", "page": 92, "text": "[별표12] 대체과목 지정표 92 2025학년도 교육과정"}
{"id": "b2a94214d11e4651966a54a4c8d2ae09", "source": "sw_pdf.pdf", "page": 93, "text": "[별표13] 소프트웨어융합학과 교과목 해설 [전공 기초] ∙미분방정식 (Differential Equations) Homogeneous와 non-homogeneous Linear Differential Equations의 해, 미분방정식의 응용, Laplace transformation, Inverse transform, Series Solutions of Differential Equations 등을 공부한다. In this course, we will study Differential Equations(in means the ordinary differential equations) and their applications. Moreover, we will consider the elementary course of Fourier Series. ∙선형대수 (Linear Algebra) 역행렬, 선형계, 행렬식, 가우스 소거법, 내적, 벡터공간, 일차독립, 기저, Kernel and range, 선형변환, Eigenvalues and Eigenvectors, 대각화, 최소자승법 등을 공부한다. The course treats linear systems, Gaussian elimination, inverse matrix, determinant, inner product, vector space, linear independence, basis, kernel and range, linear transformations, eigenvalues and eigenvectors, diagonalization, and least-square method. ∙미분적분학 (Calculus) 일변수 함수의 미분, 적분 이론과 그 응용에 대하여 공부한다. In this course, we study the derivatives and integral theories of functions(functions of one variable), the partial derivatives of functions of several variables, and their applications. ∙물리학및실험1 (Physics and Laboratory 1) 통년과목의 전반부로 물리학 전반에 대한 기본 개념을 이해시키고, 기본적인 실험을 통해 학습한다. 주로 역학, 열물리, 파동 현상을 다룬다. First part of learning and understanding basic concept of physics and physical thinking through lecture and experimental laboratory concentrating on mechanics, waves and thermodynamics. ∙확률및랜덤변수 (Probability and Random Variables) 이 과목에서는 불가측성이 내재된 시스템의 해석 및 설계를 위하여 확률 이론의 기본적인 내용을 학습한다. 다루게 될 주요내용은 확률기초이론, 랜덤 변수, 확률분포와 밀도함수, 평균과 분산, 상관성과 대역밀도함수, 랜덤 프로세스이다. 이 과목의 학습 내용은 정보 통신, 제어 공학, 반도체, 전산학 등의 분야에 폭넓게 활용될 수 있다. C/C++을 이용하는 과제물을 통해 프로그래밍 능력을 향상시킨다. This course gives an introductory treatment of probability theory for analysis of the system that inherently exhibits randomness. Covered topics include elementary probability theory, random variable, probability distribution and density function, correlation and spectral density function, and random processes. Those topics are applicable to a wide range of electrical engineering fields including information technology, control engineering, semiconductor, computer engineering, etc. Homework is assigned to improve the C/C++ programming skill. [전공 필수] ∙객체지향프로그래밍 (Object Oriented Programming) 기초적인 C++ 프로그래밍을 익히는 것이다. 이를 위해, C++ 프로그램의 기본적인 구조, 데이터 형, 변수, 함수, 분기문, 반복문, 93 Ⅶ. 소프트웨어융합대학 교육과정"}
{"id": "2f8d99d7c3fc434597e514680fae295f", "source": "sw_pdf.pdf", "page": 94, "text": "재귀 프로그래밍, 문자 입출력, 배열, 포인터, Class, 유전의 법칙 등 고급 C++ 프로그래밍을 위한 기초를 배운다. 교재는 많은 예제 프로그램을 포함하여, 초보자도 쉽게 프로그래밍에 친숙해질 수 있고, 이론과 실습을 병행함으로써 컴퓨터 공학을 비롯한 소프트웨 어융합대학에서 필요한 기초적인 프로그래밍 능력을 배양한다. Learning basic C++ programming. To do this, you will learn the fundamentals of advanced C++ programming, including the basic structure of a C++ program, data types, variables, functions, branch statements, looping statements, recursive programming, character input and output, arrays, pointers, classes and rules of inheritance. The textbook includes a lot of example programs, it is easy for beginners to become familiar with programming, and the theory and practice are combined to cultivate the basic programming ability necessary for computer science and other electronic information colleges. ∙자료구조 (Data Structure) 자료 추상화, 배열, 리스트, 스택, 큐, 트리, 그래프 등의 자료구조와 그러한 자료구조를 활용할 수 있는 알고리즘을 배운다. 이 과목 을 통해서 학생들은 전산학의 지식을 확대하고 프로그래밍 기술을 향상시킬 수 있다. Learn data structures such as data abstraction, arrays, lists, stacks, queues, trees, graphs, and algorithms that can leverage such data structures. This course allows students to expand their knowledge of computer science and improve their programming skills. ∙운영체제 (Computer Operating System) 운영체제는 사용자 프로그램의 수행과 주변장치나 기억공간과 같은 다양한 자원 할당을 감시한다. 이 과목에서는 멀티프로그래밍, 시분할, 그리고 비동기적 프로세서의 개념을 소개한다. 특히 동기화, 스케쥴링, 교착, 메모리관리, 가상메모리관리, 파일 시스템, 디 스크 스케쥴링, 정보공유, 보호/보안 및 분산운영체제와 같은 주제를 중점적으로 학습한다. The operating system monitors the execution of user programs and various resource allocations such as peripherals and memory space. This course introduces the concept of multiprogramming, time-sharing, and asynchronous processors. Topics include synchronization, scheduling, deadlock, memory management, virtual memory management, file system, disk scheduling, information sharing, protection/security and distributed operating systems. ∙알고리즘 (Algorithm) 알고리즘의 기본적인 이해를 하고 대표적인 알고리즘의 형태를 배운다. 알고리즘 방법을 divide-and-conquer, dynamic programming, greedy algorithms, branch-and-bound 등으로 분류하고, 각각의 특성을 이해하도록 한다. 아울러 기본적인 복잡도 문제를 살펴본다. 본 과목을 이수 후 새로운 문제에 대한 해결 방법을 도출할 수 있는 능력을 키운다. Students will have a basic understanding of algorithms and learn the types of representative algorithms. We classify algorithm methods into divide-and-conquer, dynamic programming, greedy algorithms, and branch-and-bound. We also look at basic complexity issues. After completing this course, students develop the ability to find solutions to new problems. ∙데이터베이스 (Database) 데이터베이스 시스템을 이루는 기본 구성 요소에 대한 이론을 소개하고, ER-모델 및 관계데이터 모델을 중심으로 한 데이터베이스 설계 이론과 동시성 제어, 회복, 트랜잭션 관리와 같은 데이터베이스 관리 시스템을 구현하는 이론을 소개한다. This course introduces the theory of basic components of database system, introduces database design theory based on ER-model and relational data model, and theory that implements database management system such as concurrency control, recovery, and transaction management. ∙소프트웨어공학 (Software Engineering) 소프트웨어 공학 분야는 프로그램이 방대하고, 오랜 기간 동안 많은 프로그래머들이 참여하는 경우 발생되는 문제를 다룬다. 본 강 좌에서 학습하는 분야는 프로그래밍 프로젝트의 설계와 구성, 시험과 프로그램 신뢰도, 소프트웨어 비용의 성격과 발생원인 인지, 94 2025학년도 교육과정"}
{"id": "90030cbe6d77492ab4cd06c3a8f5f1e9", "source": "sw_pdf.pdf", "page": 95, "text": "여러 프로그래머간의 협조, 사용자 친화적 인터페이스 설계 및 문서화 등이다. The field of software engineering deals with problems that arise when programs are vast and involve a lot of programmers for a long time. Topics covered in this course include design and configuration of programming projects, test and program reliability, nature and causes of software costs, coordination among various programmers, and user-friendly interface design and documentation. ∙최신기술콜로키움1 (Latest Technology Colloquium 1) 소프트웨어 기반의 융합 분야에 대한 최신 기술을 해당 분야 전문가를 초청하여 듣도록 한다. 트랙별로 학교 내부와 산업체 전문가를 초청하게 되며, 학생들은 강연에 대한 요약과 함께, 본인의 진로와 연관된 의견을 보고서로 작성하여 제출한다. 성적은 출석과 보고 서에 기반하여 Pass 혹은 Fail로 판단된다. Invite experts from the field to hear the latest technology in the field of software-based convergence. Each track will invite school professionals and industry experts. Students will submit a summary of the lecture, along with a report on their career. The grade is judged to be Pass or Fail based on attendance and report. ∙소프트웨어융합개론 (Introduction to Software Convergence Engineering) 소프트웨어융합에 대한 기초적인 지식을 트랙별 개론 및 콜로키움 형태로 학습한다. 먼저 소프트웨어에 대한 기초적인 배경을 습득 한 후, 소프트웨어융합학과를 구성하는 3가지 트랙에 대한 역사와 기초지식 이론적 지식을 학습한다. 트랙에 참여하는 전임/겸직 교수님들과 관련 기업체 초청강사님을 통한 트랙별 콜로키움을 수행하여, 트랙에 대한 산업 및 학술에 대한 최신 현황을 학습하여, 추후 트랙의 선택에 대한 실무적 배경을 제공한다. 특별히 게임콘텐츠 트랙에 대해서는 게임에 대한 역사를 통한 해당 분야 이해와 함께 보드 게임 개발을 통한 게임의 이해를 수행한다. Learn basic knowledge of software convergence by track and colloquium type. After acquiring basic background of software, students will learn the history and basic knowledge of the three tracks that make up the software convergence course. Perform track-by-track colloquiums with full-time/part-time professors participating in the track and invited lecturers from related companies to learn the current status of industry and academic track and provide a practical background for future track selection. Especially, for the game content track, we understand the field through game history and understand the game through board game development. ∙디자인적사고 (Design Thinking) 새로운 소프트웨어 개발을 위한 디자인 중심의 창의적 설계 접근방법과 아이디어 발상을 위한 이론적 프로세스를 팀워크를 통해 학습한다. We will learn the design-oriented creative design approach for new software development and the theoretical process for idea development through teamwork. ∙웹/파이선프로그래밍 (Web and Python Programming) 파이선을 이용하여 프로그래밍의 기초와 함께 논리적 사고 방법과 구현을 배우는 과목이다. 웹 프로그래밍은 HTML5/CSS3/ Javascript를 사용하는 Web Application을 이해함으로서, 클라이언트 개발을 가능하게 하고, Node.js를 통한 간단한 서버 프로그 래밍을 다룬다. The objective of this course is to introduce the basic concept of programming and computational thinking using Python. Students will also learn basic HTML, CSS, Javascript, and a simple web server implementation which are fundamental skills to realize their own ideas into reality. ∙오픈소스SW개발방법및도구 (Opensource Software Development Methods and Tools) 소프트웨어 개발을 위한 방법론과 도구에 대해서 오픈소스 소프트웨어를 기반으로 학습하며, 리눅스 운영체제에 대한 프로젝트를 수행한다. 소프트웨어 개발 방법론은 최근에 가장 많이 쓰이고 있는 Agile 개발 방법에 대해서 학습하며, 이를 소프트웨어 산업에서 적용하는 다양한 활용 방법에 대해서 학습한다. 소프트웨어 개발 도구는 오픈소스 소프트웨어를 중심으로 하여, 소프트웨어의 설계, 95 Ⅶ. 소프트웨어융합대학 교육과정"}
{"id": "cafbd53726554b549b52927edf8278e9", "source": "sw_pdf.pdf", "page": 96, "text": "개발, 시험, 검증, 팀작업 등의 전반적인 부분에서 활용 가능한 도구에 대해서 학습한다. 또한 리눅스 운영체제를 한 학기 동안 직접 설치하고 활용함으로써, 이후 소프트웨어융합학과의 교육과정에서 리눅스를 활용하는 기본 능력을 함양한다. Learn about methodologies and tools for software development, and work on projects for the Linux operating system. The software development methodology learns about the agile development method, which is used most recently, and the various application methods applied to the software industry. Software development tools focus on open source software, and learn about tools that can be used in the overall aspects of software design, development, testing, verification, and team work. In addition, by installing and using the Linux operating system directly for one semester, students will develop the basic ability to use Linux in the course of software convergence. ∙최신기술콜로키움2 (Latest Technology Colloquium 2) 소프트웨어 기반의 융합 분야에 대한 최신 기술을 해당 분야 전문가를 초청하여 듣도록 한다. 트랙별로 학교 내부와 산업체 전문 가를 초청하게 되며, 학생들은 강연에 대한 요약과 함께, 본인의 진로와 연관된 의견을 보고서로 작성하여 제출한다. 성적은 출석과 보고서에 기반하여 Pass 혹은 Fail로 판단된다. Invite experts from the field to hear the latest technology in the field of software-based convergence. Each track will invite school professionals and industry experts. Students will submit a summary of the lecture, along with a report on their career. The grade is judged to be Pass or Fail based on attendance and report. ∙소프트웨어융합캡스톤디자인 (Capstone Design in Software Convergence Engineering) 소프트웨어융합전문프로그램의 졸업을 위한 합격여부를 결정한다. 트랙별 주제에 부합하는 소프트웨어의 개발, 졸업 논문 작성 및 심사 발표를 수행한다. 결과물은 개인의 공식 포트폴리오로 관리하도록 한다. Decide whether to pass for graduation from the Software Convergence Program. Develop software that meets track-specific themes, write graduation theses, and present audition announcements. The results should be managed by an individual's official portfolio. ∙졸업논문(소프트웨어융합) (Graduation Thesis:Software Convergence) 소프트웨어융합학과는 ‘소프트웨어융합캡스톤디자인’을 이수하고, 결과물을 소프트웨어융합학과가 제시한 양식의 연구논문 형태로 제출하는 것으로 “졸업논문” 합격 여부를 결정한다. The Software Convergence Department decides whether or not to pass the “Graduation Thesis” by completing the “Software Convergence Capstone Design” and submitting the results in the form of research papers presented by the Software Convergence Department. [전공 선택] ∙이산구조 (Discrete Structures) (*공통) 수학적인 관점에서 논리적인 디지털 컴퓨터 구조를 이해하기 위해 형식논리, 알고리즘 증명, 재귀, 집합, 순열과 조합, 이항정리, 이진관계, 함수 및 행렬, 그래프, 트리, 그래프 알고리즘, 프로그램의 검증, 부울 대수와 컴퓨터 논리 등에 관하여 배운다. In order to understand the logical structure of digital computer from mathematical viewpoints, this course is designed to learn formal logic, proof of algorithm, recursion, set, permutation and combination, binomial theorem, binary relation, function and matrix, graph, tree, graph algorithm, program verification, Boolean algebra, and computer logic. ∙컴퓨터네트워크 (Computer Networks) (*공통) 컴퓨터 네트워크를 구성하는 각종 네트워킹 장치들의 계층 모델, 특성, 동작 방법, 그리고 운용 기술에 대하여 학습한다. 또한 이들 장치를 상호 연결한 인터넷의 구성과 동작 방법에 대하여 소개한다. 본 과목의 수강을 통하여 컴퓨터 네트워크의 구성과 동작 방법에 대하여 소개한다. 본 과목의 수강을 통하여 컴퓨터 네트워크의 7계층 구조와 인터넷 4계층 구조를 이해할 수 있고, 간단한 LAN(Local Area Network)을 설계할 수 있으며, 계층 모델을 기반으로 한 컴퓨터 네트워크의 이론적 이해 및 분석력을 함양함 96 2025학년도 교육과정"}
{"id": "8cd381047b0c4524ae500917bbe47c45", "source": "sw_pdf.pdf", "page": 97, "text": "으로써 컴퓨터 네트워킹 개념에 대한 이론과 실용 기술을 체득할 수 있다. This course deals with hierarchical models, characteristics, operating methods, and operating techniques of various networking devices that make up a computer network. In addition, we introduce the configuration and operation method of internet connecting these devices. This course introduces the structure and operation of computer network. Through this course, students will be able to understand the seven-layer structure of the computer network and the four-layer structure of the Internet, design a simple LAN(Local Area Network), and develop the theoretical understanding and analysis ability of the computer network based on the layer model You can learn the theory and practical techniques of computer networking concepts. ∙SW스타트업비지니스 (Software Start-Up Business) (*공통) 실리콘밸리의 수많은 성공한 창업가들이 컴퓨터공학 출신이다. 이미 컴퓨터공학은 창업가들로 하여금 가장 핵심적이고 중요한 기술로 부각되고 있다. 구글, 마이크로소프트, 샤오미 들에서 제시하는 차세대 기술에 대해 연구하고, 이러한 기술을 기반으로 하는 모의 창업을 통해서, 졸업 후 사업자 역량을 배운다. Many successful entrepreneurs in Silicon Valley are from computer engineering. Computer technology has already become the most important and important technology for entrepreneurs. We study the next generation technologies presented by Google, Microsoft and Xiaomi, and learn business capabilities after graduation through mock-ups based on these technologies. ∙딥러닝 (Deep Learning) (*공통) 딥러닝의 배경지식인 기초 수학(선형대수, 확률, 정보이론)을 리뷰하고, 기본 개념과 다양한 딥러닝 기술의 이론 지식을 학습한다. Basic mathematics(linear algebra, probability, information theory), which is a background knowledge of deep learning, is reviewed. Students learn the concepts and theoretical knowledge of various deep learning technologies. ∙리눅스시스템프로그래밍 (LINUX System Programming) (*공통) 가장 널리 사용되고 있는 운영체제 중의 하나인 LINUX 환경에서의 프로그램 개발 환경을 습득하여, UNIX 전문가로서의 계기를 제 공한다. LINUX 사용법 및 개발환경에서 시작하여, file I/O, file & directory, process & thread, signal, IPC, synchronization, socket 등의 고급 프로그래밍 기법을 LINUX system call을 직접 사용함으로써 실습한다. This course provides an opportunity for a LINUX expert. First, various development tools in UNIX are presented such as vi, make, gcc, gdb. Next, this course introduces various LINUX system calls and gives a lot of programming practices on file I/O, file & directory, process & thread, signal, IPC, synchronization, and sockets. ∙클라우드컴퓨팅 (Cloud Computing) (*공통) 클라우드 컴퓨팅의 개념을 이해하고 프로젝트를 진행한다. 가상화 기술(Virtual Machine)의 특징을 이해하고 IaaS, PaaS, SaaS 등의 개발 프로젝트를 진행한다. 아마존과 구글의 클라우드 서비스 활용 방법과 PaaS(Azure, Openshift, Cloudfoundry)를 이용한 클라 우드 서비스의 개발 실습과 OpenStack을 통한 가상 자원의 프로비저닝 및 운영기술에 대한 실무를 배양한다. Understand the concept of cloud computing and proceed with the project. Understand the features of virtual machine and develop projects such as IaaS, PaaS, SaaS. Learn how to use cloud service of Amazon and Google and cloud service development practice using PaaS(Azure, Openshift, Cloudfoundry) and cultivate practical skill of provisioning and operating virtual resources through OpenStack. ∙실전기계학습 (Machine Learning Application) (*공통) 딥러닝/머신러닝 기본 지식을 실제 문제에 응용할 수 있는 실습 과목이다. 학생들은 머신러닝/딥러닝 기본 모델링 기법을 배우고 프로젝트/competition에 참여하여 다양한 실전 경험을 쌓는다. This course learns how to apply machine learning and deep learning technology to practical applications. The course allows the students to learn basic models and optimization techniques by participating Kaggle-based challenges and 97 Ⅶ. 소프트웨어융합대학 교육과정"}
{"id": "a711e963908d46299f11a25208a09ee8", "source": "sw_pdf.pdf", "page": 98, "text": "performing projects for practical applications. ∙정보보호 (Information Security) (*공통) 본 과정에서는 네트워크보안의 기본개념과 암호화 알고리즘, 인터넷보안 메커니즘과 무선망 보안 등에 대하여 다룬다. 그리고 국내 외 보안기술표준화동향 등에 대해서도 강의한다. Students learn about the basic concepts of network security, Internet security mechanism, and security for wireless networks through this course. In order to provide the opportunity for understanding the state-of-art security technology, this course also introduces the current domestic and international standardization status. ∙영상처리 (Image Processing) (*로봇·비전) 2차원 신호인 디지털영상신호의 표현, 영상신호처리의 기본 단계, 영상신호처리 시스템의 요소, 디지털영상의 기초, 푸리에 변환, FFT, DCT를 포함한 영상변환, 영상신호의 향상 및 영상신호의 복구에 대하여 강의한다. This course teaches representation of 2D digital image signal, basic processing steps of image signal, elements of image signal processing system, image transform including Fourier transform, FFT and DCT, enhancement and restoration of image signal. ∙빅데이터프로그래밍 (Big Data Programming) (*공통) 대량의 정형 또는 비정형 데이터의 집합체인 빅데이터의 5V(규모, 다양성, 속도, 정확성, 가치) 요소에 대해 학습하고, 빅데이터로부 터 가치를 추출하고 결과를 분석하기 위한 하둡의 맵리듀싱에 대해 학습한다. Learn 5V elements(Volume, Variety, Velocity, Veracity, Value) of Big Data, a collection of large quantities of structured or unstructured data, and learn Hadoop and MapReducing for extracting values from Big Data and analyzing results. ∙AIoT소프트웨어 (AIoT Software) (*로봇·비전) 컴퓨터 공학 기초 과목의 이해를 바탕으로 Embedded System에서의 응용 프로그램 개발을 경험한다. 즉, Intel PXA255 기반의 Embedded System Toolkit을 사용하여, cross-compilation 개발 환경을 구축하고 Embedded Linux kernel porting, 각종 device control 등을 통해 Embedded System 개발 능력을 갖춘 후, 팀을 이루어 창의적인 응용 프로그램을 개발한다. Based on the understanding of basic subjects in computer engineering, students will experience developing application programs in embedded systems. Using the Intel PXA255-based Embedded System Toolkit, we will build a cross-compilation development environment, develop Embedded Linux kernel porting and various device controls to develop embedded systems, and then team up to develop creative applications. ∙컴퓨터비젼 (Computer Vision) (*공통) 본 과목은 사람이 시각 정보를 이용하여 지능적인 판단과 행동을 하는 것과 마찬가지로, 컴퓨터(기계)도 사람과 같이 시각 정보를 획득, 처리하고 이를 이용하여 객체 인식 및 행동 인식과 같은 지능적인 일을 수행 할 수 있도록 하는 최신 연구 분야를 공부한다. 기초적인 영상 분석 및 기계 학습 방법들을 활용하여 Feature Extraction, Visual Tracking, Shape Matching, Pattern Detection, Object Recognition, Gesture Recognition, Scene Understanding 및 3D Reconstruction 와 같은 세부 연구 분야 들을 공부한다. Computer vision is an interdisciplinary research field that deals with how computers can be made for gaining high-level understanding from digital images or videos. In this class we study following topics: Feature Extraction, Visual Tracking, Shape Matching, Pattern Detection, Object Recognition, Gesture Recognition, Scene Understanding, 3D Reconstruction. ∙블록체인 (Blockchain) (*공통) Web3시대를 열어가는 기반기술인 블록체인에 대해 알아본다. 비트코인부터 시작된 블록체인의 역사와 이더리움을 거쳐 다양한 Web3 application이 어떤 식으로 진화했는지 앞으로 어떻게 발전해 나갈 수 있을지 알아본다. 또한 간단한 블록체인 프로그래밍을 98 2025학년도 교육과정"}
{"id": "fc63e2f173ea4977bfa484c69330d37e", "source": "sw_pdf.pdf", "page": 99, "text": "통해 Web3 application개발을 시작해 본다. Learn about blockchain, the underlying technology for the Web3 era. Learn about the history of blockchain, starting with Bitcoin, and how various Web3 applications have evolved through Ethereum, and how they will evolve in the future. You will also learn how to start developing Web3 applications through simple blockchain programming. ∙모바일/웹서비스프로그래밍 (Mobile Programming) (*공통) 오픈소스 프로그래밍 개발 환경에서 모바일 및 웹서비스 프로그래밍의 기본 개념을 배우고 여러 응용 프로그래밍을 구현함으로서 실제 업무에 적용 가능한 실무능력을 향상시킨다, This course is designed for learning a fundamental concept of mobile programming and web-service programming based on the open source development environment. ∙로봇제어공학 (Robotics Engineering) (*로봇·비전) 센서, 액츄에이터, 지능의 융합으로 이루어진 로봇의 제어를 위해서 요구되는 경로계획, 피드백 제어기 구성 및 로봇 시뮬레이션 방법을 학습한다. 또한 로봇제작에 사용되는 센서와 구동기 및 비전시스템 등에 대하여 소개한다. This class is about navigation, feedback control and robot simulation, which are the key topics to develop a robot system. Also, it includes the brief introduction about sensor, actuator and intelligence. ∙세계신화읽기 (Reading World Myth) (*게임콘텐츠) 이 과목은 현대 소설, 영화, 애니메이션, 게임의 원천 콘텐츠를 구성하는 세계 여러 지역의 신화(그리스 로마신화와 북유럽신화)와 그 현대적 변용형태들을 함께 읽어봄으로써 신화의 현대적 의미와 창조적 변형가능성을 탐구해 보고자 한다. This course is designed to read various myths of the world(Greek-Roman and North European myths) and their modified forms constituting original source of contemporary fiction, film, animation, and game, and investigate their cultural meaning and their transformative possibilities. ∙테크놀로지와디지털콘텐츠 (Technology and Digital Contents) (*게임콘텐츠) 이 과목은 21세기의 핵심역량인 언어 활용능력과 테크놀로지 활용능력을 동시에 고취시키데 목적을 두고 있다. 이 과목에서는 가상 현실, 증강현실, 기계번역, 모바일 앱, 게임기반 학습, 미디어 제작 등 다양한 테크놀로지를 활용하여 영어학습을 경험하고 교육에서 테크놀로지가 어떻게 활용되는지에 대하여 배운다. This course is designed to help students experience technology-supported language learning and learn how technology can be effectively integrated into education. The course includes diverse technologies, such as virtual reality, augmented reality, game-based learning, machine translation, mobile apps and creation of media contents. ∙UX디자인 (User Experience Design) (*게임콘텐츠) 광범위한 조사과정 및 분석 방법을 바탕으로 사용자의 경험을 중점적으로 연구 제안한다. 이를 위하여 연구방법 및 이론에 대한 이해와 새로운 컨셉 전개와 개발을 중점적으로 학습한다. Based on broad research process and analyzing methods, this course focuses on exploring and researching user's experience. For that purpose students learn to understand research methods and theories of new concept development. ∙응용통계학 (Applied Statistics) 통계학이론 중에서 확률통계이론의 응용력을 확대할 수 있는 기법과 확장된 이론을 체득할 수 있도록 한다. 다루어지는 내용은 시료 분포, 추정, 검정, 중선형 및 곡선회귀, 직교다항식, 샘플링방법, 요인배치법, 교락법, 직교배열법, 파라메터 및 허용차 설계 방법 등이다. Students will be able to learn techniques and techniques for expanding the application of probability statistical theory in statistical theory. The topics covered include sample distribution, estimation, calibration, midline and curve 99 Ⅶ. 소프트웨어융합대학 교육과정"}
{"id": "1fd69b3d179348dbb2249c4010d459d1", "source": "sw_pdf.pdf", "page": 100, "text": "regression, orthogonal polynomials, sampling methods, factoring, delineation, orthogonal arraying, and parameter and tolerance design methods. ∙데이터사이언스 (Data Science) 본 과목은 학생들에게 데이터 사이언스의 기본 원칙들을 소개한다. 또한 기업이 수집한 데이터로부터 유용한 지식과 비즈니스 가치를 추출하는 데 필요한 “데이터 분석 사고”를 강의한다. 이러한 원칙들은 데이터 마이닝 기술을 통해 비즈니스 문제를 해결하는 데 필요한 프로세스와 전략을 뒷받침하게 된다. This course introduces students to the fundamental principles of data science and walks them through the “data-analytic thinking” necessary for extracting useful knowledge and business value from the data enterprises collect. These principles underpin the processes and strategies necessary to solve business problems through data mining techniques. ∙경영과학1 (Management Science 1) (*데이터사이언스) 계량적 방법을 통하여 어떻게 최선의 의사결정을 내릴 수 있는지 수강자들에게 관련된 이론을 체계적으로 소개하고 이를 현실사회의 문제에 실제로 적용할 수 있도록 훈련시킨다. 선형계획법 및 그 응용분야가 주로 다루어진다. An introduction to deterministic models in operations research with special emphasis on linear programming. Topics include simplex algorithm, transportation and assignment algorithms and their engineering applications. ∙경영과학2 (Management Science 2) (*데이터사이언스) 계량적 방법을 통하여 어떻게 최선의 의사결정을 내릴 수 있는지 수강자들에게 관련된 이론을 체계적으로 소개하고 이를 현실사회의 문제에 실제로 적용할 수 있도록 훈련시킨다. 주요 논제는 네트워크이론, 동적계획법, 정수계획법, 게임이론, 의사결정이론, 예측 이론 등이다. How to make the best decision through quantitative method Introduce the theories related to the learners systematically and train them to apply them to the problems of real society. Linear programming and its application areas are mainly covered. ∙데이터마이닝 (Data Mining) (*데이터사이언스) 데이터 마이닝이란 대량의 데이터에서 의미 있는 패턴과 규칙을 발견하기 위해 자동적인 또는 준자동적인 방법에 의해 데이터를 조사하고 분석하는 절차이다. 본 과목은 데이터 마이닝의 기초적인 개념들과 그 적용법들을 제공한다. 주요 논제로 decision trees, classification, association, clustering, statistical modeling, Bayesian classification, k-nearest neighbors, CART 등을 다룬다. Data mining is the process of examining and analyzing data by automatic or semi-automatic methods to find meaningful patterns and rules in large amounts of data. This course provides basic concepts of data mining and its applications. Topics include decision trees, classification, association, clustering, statistical modeling, Bayesian classification, k-nearest neighbors, and CART. ∙금융공학 (Financial Engineering) (*데이터사이언스) 미래의 금융환경에 대한 불확실성의 증대 속에, 투자자의 다양한 투자전략수립, 고객의 니즈에 맞는 신상품의 지속적인 개발, 금융 자산에 대한 위험관리에 관한 수학적, 공학적 이론에 관한 학습을 한다. The goal of this course is to develop leading-edge skills and provide new information on financial engineering. Topics such as deterministic cash flow analysis, single-period random cash flow analysis, and derivative securities will be discussed. ∙서비스데이터사이언스 (Service Data Science) (*데이터사이언스) 서비스 경영은 서비스 사회의 서비스 경제를 유지하고 창출하는 경영전략을 수립하고 이행하는 학문이라 할 수 있다. 이에 따른 주요 내용은 서비스 마케팅, 확장된 서비스 마케팅, 서비스 생산성, 서비스 수행도, 서비스 품질, 서비스 관계마케팅, 서비스 인터넷 100 2025학년도 교육과정"}
{"id": "5b147b4838ae4ccd90881f014fa47273", "source": "sw_pdf.pdf", "page": 101, "text": "마케팅 등을 다루게 된다. Service Management is a disciplined business strategy to create and sustaining service economy for service society. Major topics include service marketing, service mixed marketing, service productivity, service performance, service quality, service relationship marketing, service internet marketing. ∙동역학 (Dynamics) (*로봇·비전) 기계역학의 기초가 되는 운동학과 운동역학을 주로 취급하여 힘의 효과와 운동에 대한 해석과 기초역학의 이해능력을 다룬다. This course deals with the basic principles of mechanics, such as kinematics and kinematics. It deals with the effects of force, motion, and understanding of fundamental mechanics. ∙메카트로닉스 (Mechatronics) (*로봇·비전) 기계와 전자가 결합된 형태를 메카트로닉스라 하고 있으며 필연적으로 전산에 대한 부분도 포함되고 있다. 기구학, 전장용소, 열부 품 그리고 유체부품 등을 기계부분으로 강의 되며, 이에 대한 제어부분인 전자와 소프트웨어 및 그 기계와의 인터페이스에 대한 학습을 제공한다. 수강생들은 실습을 통하여 각자 자유 제목으로 선정될 수 있는 학기 프로젝트를 완성해야 한다. The combination of machine and electron is called mechatronics, and inevitably includes part of computerization. Mechanics, electric field, heat parts and fluid parts are taught in the mechanical part, and the control part of electronics, software and interface with the machine are provided. Students are required to complete a semester project that can be selected as a free title through hands-on training. ∙자동제어 (Automatic Controls) (*로봇·비전) 선형 자동제어계에 대한 기본 개념에서부터 회로 제어이론과 그 응용을 다룬다. With recent developments in electronic industry automatic control becomes one of the most important subjects in modern engineering education. This course deals with be basic mathematical and computational tools for modeling and analysis of dynamic system to be controlled and s unified methodology to identify, model, analyze, design, and simulate dynamic systems in various engineering disciplines. Based on these foundations principal concepts of linear feedback control will be taught. MATLAB will be introduced and used as a practical computation tool. It is desired that students have minimum background in dynamics, and ordinary differential equations. ∙시스템동역학 (System Dynamics) (*로봇·비전) 역학시스템의 수학적 모델링과 응답을 다루는 본 교과는 역학시스템의 모델링과 해석을 완벽히 다루고 제어시스템의 해석 및 설 계를 위한 개론을 제시한다. 제어 및 역학시스템의 해석적 연구를 위한 내용으로 구성되어 있으며 이 과목을 듣기 위해서는 수강 생들은 미분방적식, 행렬-벡터 해석 그리고 회로해석에 대한 기본적인 지식이 요구된다. This course deals with the mathematical modeling and response of dynamics systems and presents an overview for the analysis and design of control systems. It is composed of content for analytical study of control and dynamics systems. Students are required to have basic knowledge of differential equation, matrix-vector analysis and circuit analysis. ∙로봇공학 (Introduction to Robotics) (*로봇·비전) 로봇 매니퓰레이터를 위주로 로봇 동작과 제어에 관련된 수학적 도구와 알고리즘 등을 학습하고 이를 현실에서의 사용하기 위한 응용기법을 학습한다. 구체적으로 본 과목에서는 좌표계 설정, Homogeneous Transform, Forward/Inverse Kinematics, Forward/Inverse Dynamics, 위치 및 컴플라이언스 제어, 경로설정, 장애물 회피, 여유자유도 로봇과 같은 기초적 개념과 응용 기법 등을 학습한다. Students will learn mathematical tools and algorithms related to robot operation and control, focusing on robot manipulators, and learn application techniques for their use in real life. In this course, basic concepts and application methods such as coordinate system setting, homogeneous transform, forward/inverse kinematics, forward/inverse dynamics, position and compliance control, path setting, obstacle avoidance and redundancy robot are studied. 101 Ⅶ. 소프트웨어융합대학 교육과정"}
{"id": "7b2b628a04c845108099c8780d59ffea", "source": "sw_pdf.pdf", "page": 102, "text": "∙수치해석프로그래밍 (Numerical Programming) Analysis 본 강의는 수치 해석의 기본이론과 분석 기법을 이용해 선형 시스템, 수치 미분 및 경사 하강법, 차원 축소, 확률적 모델링, 병렬 컴퓨팅, 인공지능 응용에 대해 공부하고 이에 대해 프로그래밍으로 구현 및 성능을 분석한다. 수치해석 이론이 인공지능과 기계학 습의 다양한 분야에서 모델링, 최적화, 데이터 전처리, 딥러닝 알고리즘 등에 어떻게 활용되는지 다룬다. Programming the foundational principles and analytical techniques of numerical analysis, focusing on linear systems, numerical differentiation, gradient descent, dimensionality reduction, probabilistic modeling, parallel computing, and analyzing their performance. This course also examines how numerical analysis theory is utilized in various aspects of artificial intelligence and machine learning. ∙게임프로그래밍입문 (Introduction to Game Programming) [수강 대상 : 프로그래밍 유경험자(Python/C/C++)] 간단한 GUI(Graphic User Interface) 환경의 기초적인 게임부터 오픈 소스를 활용한 고전적인 아케이드 게임, 플랫폼 게임 등에 대한 코드 레벨을 이해한 후, 직접 설계 및 개발하는 과정을 통하여 게임 개발에 대한 프로세스를 이해한다. 다양한 환경의 게임을 경험하기 위하여, 충돌 검출 및 반응, 게임 물리, 3D 그래픽, 게임 인공 지능 등에 대한 기초를 경험한다. Understand the code level of basic game of simple GUI(Graphic User Interface) environment, classic arcade game, platform game using open source, and understand the process of game development through the process of designing and developing. In order to experience games in various environments, students will learn the basics of collision detection and reaction, game physics, 3D graphics, game artificial intelligence, and so on. ∙게임엔진기초 (Game Engine Basics) [수강 대상 : 기초적인 프로그래밍(C++, C#, Python 등) 경험이 있는 자] 본 수업은 이론 수업과 실습 수업으로 이루어져 있다. 이론 수업의 목적은 게임 엔진의 전체적인 구조와, 이를 이해하기 위해 필요한 기초 이론들을 학습하는 것이 목표이다. 실습 수업의 목적은 상용 엔진을 실제로 사용하면서 엔진에 대한 이해를 심화하는 것이다. This class comprises of theory part and a practice part. Through the theory part, students will understand the architecture of a game engine and the basic theories used in a game engine. Through the practice part, students will deepen their understanding of the game engine by actually using the commercial game engine. ∙마이크로서비스프로그래밍 (Microservice Programming) 데이터센터에서 마이크로서비스를 개발하고 운영하는 개발 방법론과 도구에 대한 이론을 이해하고 실습을 수행한다. 대표적인 기술 로서 클라우드 컴퓨팅, 컨테이너/오케스트레이션 기술, 마이크로 서비스, DevOps에 대해서 이해하고, 실습을 통해서 직접 데이터센 터의 소프트웨어 개발 환경을 구축하고, 시험/운영하는 능력을 함양한다. Understand and practice theories on microservice development methodologies and tools used in data centers. As a representative technology, students will understand cloud computing, container/orchestration technology, microservices, DevOps, and build the ability to directly build and test/operate the software development environment of the data center. ∙융합연구1/2/3/4/5/6 (Convergence Research 1/2/3/4/5/6) (*공통) 전공 과목 멘토링, 외국인 학생 프렌드십, 프로그래밍 재능기부, 오픈소스 기여, 프로그램 앱스토어 등록 등을 설계 및 진행하거나 소프트웨어 공모전, 창업 공모전, 프로그래밍 경진대회, 학술 공모전 등을 참가 및 출품 Students design his/her own course about Subject Mentoring, Foreign Student Friendhood, Programming Talent Donation, Open Source Contribution, Program AppStore Registration, Software Competition, Entrepreneurial Competition, Programming Competition, Academic Competition. - 전공 과목 멘토링 (Subject Mentoring) : 학생이 이미 수강한 과목을 듣는 후배를 멘토링 한다. 멘토를 신청하는 학생은 해당 과목에 대해서 A- 이상의 학점을 받아야 한다. 멘토는 멘토링에 대한 계획서와 실적서를 제출하고, 실질적인 성적 향상 여부에 102 2025학년도 교육과정"}
{"id": "bcfbbfe191354d93a3dcc891ac4c1628", "source": "sw_pdf.pdf", "page": 103, "text": "기반하여 지도교수로부터 P/F 중 적합한 학점을 부여 받는다. Mentor the junior who listens to the class that the student has already taken. Students who apply for a mentor must receive an A- or higher credit for the subject. The mentor submits plans and achievements for mentoring, and receives appropriate credits from P/F from the advisor based on actual improvement in grades. - 외국인 학생 프렌드십 (Foreign Student Friendhood) : 학생은 소프트웨어융합학과 소속의 외국인 학생의 학업/프로그래밍기술 학습/전공수업적응에 대한 기여를 하거나 멘토링을 수행한다. 멘토는 멘토링에 대한 계획서와 실적서를 제출하고, 실질적인 외국 인 학생에 대한 기여 여부에 기반하여 지도교수로부터 P/F 중 적합한 학점을 부여 받는다. The student contributes to the adaptation of the academic/programming skill learning/major instruction of the foreign student belonging to the Software Convergence Department and performs the mentoring. The mentor submits plans and achievements for mentoring and receives appropriate credits from P/F from the advisor based on whether he or she actually contributes to the foreign student. - 프로그래밍 재능기부 (Programming Talent Donation) : 학생은 본인이 확보한 소프트웨어 수요처 혹은 학교에서 제공하는 소프 트웨어 수요처의 문제를 해결하는 소프트웨어를 개발하여 주는 방법으로 재능기부를 수행한다. 지역사회 초중고등학교 학생에 대한 프로그래밍 교육도 고려할 수 있다. 신청하는 학생은 계획서와 실적서를 제출하고, 실질적인 기여에 기반하여 지도교수로부터 P/F 중 적합한 학점을 부여 받는다. A student donates talent in a way that develops software that solves the problem of the software demanded by the user or the demand of the software provided by the school. Programming education for elementary, middle and high school students in the community can also be considered. Applicants are required to submit a proposal and an achievement form, and receive appropriate credits from P/F from their advisor on a practical contribution basis. - 오픈소스 기여 (Open Source Contribution) : 학생은 지도교수의 지도하에, 본인이 희망하거나 지도교수가 권장하는 오픈소스 커뮤니티에 소프트웨어 코드를 기여하도록 한다. 오픈소스 소프트웨어에 코드를 기여하기를 희망하는 학생은 계획서와 실적서를 제출하고, 실질적인 기여 여부 등에 기반하여 지도교수로부터 P/F 중 적합한 학점을 부여 받는다. Under the guidance of your supervisor, the student will be asked to contribute the software code to the open source community that he or she would like or recommended by the professor. A student who wishes to contribute code to open source software must submit a proposal and an achievement report and be eligible for an P/F credit from an advisor based on actual contribution. - 프로그램 앱스토어 등록 (Program AppStore Registration) : 학생은 지도교수의 지도하에, 본인이 만든 소프트웨어를 앱스토어를 통하여 판매하는 과정을 거치도록 한다. 소프트웨어 판매를 희망하는 학생은 계획서와 실적서를 제출하고, 실질적인 앱스토어 등록 여부 및 결과에 기반하여 지도교수로부터 P/F 중 적합한 학점을 부여 받는다. Under the supervision of the supervisor, the student goes through the process of selling the software he created through the App Store. Students who wish to sell software are required to submit a proposal and an achievement book, and receive appropriate credits from P/F from their advisor based on the actual App Store registration and results. - 소프트웨어 공모전 (Software Competition) : 학생은 지도교수가 제시하는 공모전들 혹은 본인이 희망하는 공모전에 응모하는 과정을 통하여 실질적인 포트폴리오를 확보하도록 한다. 공모전을 신청하는 학생은 계획서와 실적서를 제출하고, 실질적인 공모 여부 및 결과에 기반하여 지도교수로부터 P/F 중 적합한 학점을 부여 받는다. The student will have to obtain a substantial portfolio through the process of applying for the contest presented by the advisor or his/her desired competition. Students who apply for the competition must submit a proposal and an achievement book, and receive appropriate credits from the advisor based on whether they are actually participating in the competition or not. - 창업 공모전 (Entrepreneurial Competition) : 학생은 지도교수가 제시하는 공모전들 혹은 본인이 희망하는 공모전에 응모하는 과정을 통하여 실질적인 포트폴리오를 확보하도록 한다. 공모전을 신청하는 학생은 계획서와 실적서를 제출하고, 실질적인 공모 여부 및 결과에 기반하여 지도교수로부터 P/F 중 적합한 학점을 부여 받는다. 103 Ⅶ. 소프트웨어융합대학 교육과정"}
{"id": "dc9ea4f53ff247cbb5d271c7c1b1dd33", "source": "sw_pdf.pdf", "page": 104, "text": "The student will have to obtain a substantial portfolio through the process of applying for the contest presented by the advisor or his/her desired competition. Students who apply for the competition must submit a proposal and an achievement book, and receive appropriate credits from the advisor based on whether they are actually participating in the competition or not. - 프로그래밍 경진대회 (Programming Competition) : 학생은 지도교수가 제시하는 경진대회들 혹은 본인이 희망하는 경진대회에 참여하는 과정을 통하여 본인의 실력을 향상하는 기회를 갖도록 한다. 경진대회에 참가하는 학생은 계획서와 실적서를 제출하고, 실질적인 참여 여부 및 결과에 기반하여 지도교수로부터 P/F 중 적합한 학점을 부여 받는다. The student will have the opportunity to improve his/her ability through the competitions presented by the advisor or through the process of participating in the contest that he/she wants. Students participating in the competition will submit a proposal and an achievement report, and will be given appropriate credits from P/F based on their actual participation and results. - 학술 공모전 (Academic Competition) : 학생은 지도교수가 제시하는 공모전들 혹은 본인이 희망하는 공모전에 논문을 응모하는 과정을 통하여 실질적인 포트폴리오를 확보하도록 한다. 공모전을 신청하는 학생은 계획서와 실적서를 제출하고, 실질적인 공모 여부 및 결과에 기반하여 지도교수로부터 P/F 중 적합한 학점을 부여 받는다. The student has to obtain a substantial portfolio through the process of submitting the papers to the contest presented by the advisor or the contest he/she wants. Students who apply for the competition must submit a proposal and an achievement book, and receive appropriate credits from the advisor based on whether they are actually participating in the competition or not. ∙기계학습 (Machine Learning) 기계학습은 지능적인 응용 시스템을 구축할 수 있는 기반이 되었다. 본 과목에서는, 기본적인 기계학습 알고리즘을 소개하는 것을 시작으로, 실제 응용을 중심으로 다양한 기술과 이론을 소개한다. 이러한 알고리즘의 사용 사례와 제한 사항들에 대한 논의를 진행 하고, 프로그래밍을 통해 훈련과 검증 과정을 구현한다. Machine learning has become a pillar on which you can build intelligent applications. This course will begin with the introduction of basic machine learning algorithms, and various techniques and theories are introduced with a focus on practical applications. The use cases and limitations of these algorithms will be discussed, and training and validation will be implemented with programming language. ∙회로와신호 (Circuits and Signals) 이 과목을 통해 학생들은 전자회로 기본소자의 동작원리와 기능을 익히고 기초회로 해석 능력을 습득한다. 또한 연속 및 이산 신호와 시스템의 수학적 표현기법과 변환기법을 배운다. 수업에서 다루는 개념은 전하, 전류, 전압, 저항, Ohm의 법칙, Kirchoff의 법칙, 직렬/병렬회로, RC/RL/RLC 회로, 연속 및 이산 신호의 Fourier 변환, Laplace/z 변환, 샘플링, 양자화, 필터 등을 포함한다. In this course, students learn the basic elements and principles of electric circuits, mathematical representations on continuous and discrete signals and systems, and signal transforms. The course deals with electric charge, currents, voltages, resistance, Ohm’s law, Kirchoff’s law, series/parallel circuits, RC/RL/RLC circuits, Fourier transform of continuous and discrete signals, Laplace/z transform, sampling, quantization, and filters. ∙게임그래픽프로그래밍 (Game Graphic Programming) [수강 대상 : C++가능자] 디지털 게임 제작에 있어서 가장 기본이 되는 게임 그래픽 개발 능력을 학습한다. 특히 그래픽 관련 선형 대수(투영변환 등), 게임에 사용되는 물리학(이동, 회전, 관성, 충돌) 등의 이론적 지식을 활용하여 관련 라이브러리 (OpenGL/DirectX, GLSL/HLSL) 기반으로 실습을 진행한다. In this course, students will learn game graphic development skills which are the most basic in digital game production. In particular, students will use the theoretical knowledge of linear algebra(projection transformation, etc.) related to graphics, and physics(movement, rotation, inertia, collision, etc.) used in games to practice based on related 104 2025학년도 교육과정"}
{"id": "64f08c9d43684369a88fc9f0dcf0c3d3", "source": "sw_pdf.pdf", "page": 105, "text": "libraries(OpenGL/DirectX, GLSL/HLSL). ∙게임인터랙티브테크놀로지 (Game Interactive Technology) [수강대상 : C++ 가능자] 게임에 활용되는 다양한 입출력 장치의 구동 및 활용에 대해서 학습하고 이를 확장하여 차세대 입출력 장치의 원리와 배경 이론에 대해서 학습한다. 기본적인 마우스 및 키보드와 같은 장치에서 시작하여 얼굴, 몸통, 손의 인식에 의한 입력 장치의 구동원리를 학습하고 인간-컴퓨터 상호작용에서 다루는 관련 이론 및 인터랙션 테크닉에 대해서 학습한다. 기존의 입출력 장치 외에 더 사실적인 게임 플레이의 경험을 제공하기 위해 도입되고 있는 인식 기술 및 관련 이론을 학습하고 이를 실제 게임에 적용해본다. 두번째로 시각, 청각, 촉각으로 대표되는 출력 장치들에 대해서 감각별 생체 기작 및 인지 이론을 학습하고 게임에 적용하며 이에 대한 평가를 수행하는 방법을 실습한다. This course introduces the basic operation principles of input and output devices which extends toward the understanding of future I/O devices. Students will learn the fundamental theories of Human-Computer Interaction to design interaction techniques for computing and understand the application of physiological and perceptual backgrounds underneath the software and hardware design. In summary, this course is designed to learn how to provide an optimal experience using motion-based input devices utilizing various sensor technologies, immersive sensory output devices using wearable technology, and input/output devices. ∙가상/증강현실이론및실습 (Virtual and Augmented Reality Programming) (*게임콘텐츠) [수강대상 : C++ 가능자] 디지털 게임 디자인 및 3D 그래픽스 그리고 게임엔진에 대한 이해를 바탕으로 AR(Augmented Reality) 이나 HMD(Head Mount Display) 기반의 VR(Virtual Reality) 콘텐츠 구현을 위한 이론적, 기술적 능력을 배양하고 이를 직접 제 작한다. Culture theoretical and technical skills for the AR(Augmented Reality) and HMD(Head Mount Display) based on VR (Virtual Reality) can be implemented directly and making it. ∙게임공학 (Game Engineering) [수강대상 : C++, 언리얼 (Unreal) 가능자] 이 과목은 게임 제작 및 개발에 사용되는 다양한 심화 이론들을 깊게 파고들며, 게임 산업에서 주목받는 최신 기술과 그 기술을 구현하기 위한 수학적 기반까지 탐구한다. 예를 들어, 게임 캐릭터들이 플레이어의 행동에 따라 실시간으로 다양한 반응을 보여주는 초지능 NPC 기술, 물리법칙을 정확히 따르며 움직이는 캐릭터를 구현하는 역기 구학, 게임 내에서 캐릭터들이 학습하고 진화하는 데 사용되는 딥러닝 및 강화학습 기술, 최적화 이론을 통한 문제 해결, 그리고 결정 트리를 통한 행동 계획 등을 포함한다. 본 수업은 학부 수준에서 다룰 수 있는 최고 수준의 이론을 다룬다. This course delves deeply into various advanced theories used in game production and development, exploring the latest technologies in the gaming industry and the mathematical foundations needed to implement them. For example, it covers superintelligent NPC technology, which allows game characters to react in real-time to the player's actions, inverse kinematics to create characters that move in accordance with physical laws, deep learning and reinforcement learning technologies used for characters to learn and evolve within the game, and optimization theory for problem solving and decision trees for behavior planning. This class covers the highest level of theory that can be addressed at the undergraduate level. Enjoy. ∙데이터분석캡스톤디자인 (Data Analysis Capstone Design) 데이터 분석의 전주기적인 과정을 실질적인 데이터를 통해서, 이해하고 실습하도록 한다. Students will understand and practice the whole process of data analysis through practical data. ∙고급데이터마이닝 (Advanced Data Mining) (*데이터사이언스) 기초 데이터마이닝 이후의 고급 과정에 대해서 다룬다. 학생들은 고급 과정에 해당하는 이론 내용과 함께 Case-Study를 통한 실제 사례의 이해와 실제 문제의 해결을 직접 해보도록 한다. This course deals with advanced processes after basic data mining. Students will be able to understand the actual 105 Ⅶ. 소프트웨어융합대학 교육과정"}
{"id": "f6b73cc5f72f419ca82564bc914db72e", "source": "sw_pdf.pdf", "page": 106, "text": "cases through the case-study, as well as the theoretical content corresponding to the advanced course, and solve the actual problems directly. ∙로봇프로그래밍 (Robot Programming) 로봇 운영체제(ROS)를 통해, 로봇의 하드웨어, 소프트웨어 플랫폼, 핵심 기술 애플리케이션 소프트웨어의 구조를 이해하고 직접 다 뤄보도록 한다. 시뮬레이션 기반의 로봇 조작 알고리즘을 학습하고 SLAM을 통한 자율주행 기술의 이론과 실습을 다룬다. In this course, students understand the structure of hardwares, software platforms, and core application softwares of future cars and robots based on Robot Operating System(ROS). Students learn and develop simulation-based robot manipulation algorithms and theory and practice of autonomous driving technology through SLAM. ∙로봇･비전캡스톤디자인 (Robot and Vision Capstone Design) 로봇과 비전 시스템에 대하여 학습한 내용을 기반으로, 직접 로봇/비전에 관련된 주제를 정하여 하드웨어 또는 소프트웨어를 설계하 고 개발한다. 본 교과에서 개발하는 결과물은 추후 소프트웨어융합 캡스톤디자인의 기반으로 활용한다. Based on the experience and study on robots vision systems, students design and develop car or robot related research topics and implement the related hardwares and/or softwares. The results of this course can be used as a basis for the course of Capstone Design in Software Convergence Engineering in next semester. ∙독립심화학습1/2(소프트웨어융합학과) (Individual In-Depth Study 1/2) (*공통) 논문 작성 및 제출, 특허 출원, 소프트웨어 도서 출간, 첨단 기술 백서 출간 등을 설계 및 진행한다. Students design his/her own course to write, submit and/or publish a technical paper/patent/books on software/technical white-paper. - 특허 출원 (Patent Writing) : 학생은 지도교수의 지도하에, 본인의 아이디어를 특허화하고, 최종 출원하는 절차를 수행해 본다. 특허 작성을 희망하는 학생은 계획서와 실적서를 제출하고, 실질적인 작성 여부 등에 기반하여 지도교수로부터 P/F 중 적합한 학 점을 부여 받는다. Under the supervision of an advisor, the student will patent his ideas and conduct the final application procedure. A student who wishes to write a patent must submit a proposal and an achievement book, and receive appropriate credits from the advisor based on whether he/she is actually writing or not. - 소프트웨어 도서출간 (Software Books Publishing) : 학생이 소프트웨어융합학과 학생 혹은 대외 외부인에게 도움을 줄 수 있는 소프트웨어 도서를 출간하도록 한다. 도서는 전자도서 형태를 지행하며 오픈소스 형태로 배포되어야 한다. 학생은 작성 계획과 작성한 도서를 지도교수에게 제출하고, 실질적인 작성 여부 등에 기반하여 지도교수로부터 P/F 중 적합한 학점을 부여 받는다. Have students publish a software book that can be used by software convergence students or outsiders. Books must be distributed in an open-source format and in electronic form. The student will submit the preparation plan and the book he/she has prepared to the supervisor and receive appropriate credits from the supervisor based on whether the essay is actually written or not. - 첨단 기술 백서 출간 (Published High Technology White-Paper) : 학생이 소프트웨어융합학과 학생 혹은 대외 외부인에게 도 움을 줄 수 있는 첨단 기술에 대한 도서를 출간하도록 한다. 도서는 전자도서 형태를 지행하며 오픈소스 형태로 배포되어야 한다. 학생은 작성 계획과 작성한 도서를 지도교수에게 제출하고, 실질적인 작성 여부 등에 기반하여 지도교수로부터 P/F 중 적합한 학 점을 부여 받는다. Have students publish books on cutting edge technologies that can help software convergence students or outsiders. Books must be distributed in an open-source format and in electronic form. The student will submit the preparation plan and the book he/she has prepared to the supervisor and receive appropriate credits from the supervisor based on whether the essay is actually written or not. 106 2025학년도 교육과정"}
{"id": "394c30ff223c4b77a15d59aed728262c", "source": "sw_pdf.pdf", "page": 107, "text": "∙3D데이터처리 (3D Data Processing) 자율 주행 자동차 및 지능 로봇에 활용되는 로봇 비전에 대해서 배운다. 카메라 및 삼차원 라이다 등의 비전 센서의 원리 및 획득된 데이터를 처리하는 방식에 대해서 공부한다. 3차원 기하학을 기반하여 영상들 또는 3차원 포인트 클라우드로부터 특징 추출 및 이를 활용한 3차원 복원 방식들에 대해서 다룬다. In this course, we will deal with 3D robot vision used in autonomous vehicles and intelligent robots. This course will study the principles of vision sensors such as cameras and 3D lidar and how to process the data. Based on 3D geometry, we deal with feature extraction from images or 3D point clouds and 3D reconstruction methods using sensor data. ∙게임콘텐츠캡스톤디자인 (Game Contents Captsone Design) 다양한 기술들을 융합하여 사용자에게 새로운 경험을 줄 수 있는 게임을 만들거나, 게임에 쓰일 수 있는 기술 및 콘텐츠를 실습, 제작해 본다. Develop a game, technology, or content that can give gamers a new experience. ∙풀스택서비스프로그래밍 (Full-Stack Service Programming) (*공통) 한번 작성한 코드로 다양한 운영체제와 디바이스에서 실행되는 프로그램을 개발하는 크로스 플랫폼(Cross-Platform) 기술을 이용 하여 모바일 앱, 웹 서비스, 데스크탑 어플리케이션 및 서버 프로그램을 개발하는 방법을 배우는 과목이다. 이를 위해서 Dart 언어와 Flutter 프레임워크를 사용하며, 필요시 Adobe-XD를 통한 UI/UX디자인 결과물을 Flutter 프레임워크와 연동하는 방법을 배우도록 한다. This course is to learn how to develop mobile apps, web services, desktop applications, and server programs using cross-platform technology that develops programs that run on various operating systems and devices with code developed once. For this, Dart language and Flutter framework are used, and if necessary, learn how to link UI/UX design results through Adobe-XD with Flutter framework. ∙디자인프로그래밍 (Design Programming) (*공통) 디자인 및 예술을 지망하는 학생들이 필요로 하는 컴퓨터와 소프트웨어, 프로그래밍 지식을 총체적으로 다루는 교과목이다. 디자인과 예술 분야의 수요를 반영한, HTML/CSS/JS 기반 Web, Arduino와 Raspberry Pi 기반 Physical Computing, Dart/Flutter 기반 AR/VR/MR 등 컴퓨터 기술을 활용하여 디자인과 예술 결과물을 만드는 방법론에 대해서 배우도록 한다. It is a course that comprehensively deals with computer, software, and programming knowledge required by students aspiring to design and art. Learn about the methodology of creating design and art results using computers such as HTML/CSS/JS-based Web, Arduino and Raspberry Pi-based Physical Computing, Dart/Flutter-based AR/VR/MR collected through demand survey. ∙응용데이터분석 (Applied Data Analysis) 본 과목에서는 다양한 데이터 분석 기법과 통계 기법을 활용하여 현실의 다양한 문제를 해결할 수 있는 인사이트 도출 과정을 학습 한다. 트랜잭션 데이터, 사용자 로그 데이터 등의 실제 데이터를 이용한 데이터 기반 인사이트 도출 사례를 학습하고, 이를 통해 데이터 기반의 의사결정을 위한 비판적 사고 능력을 함양할 수 있다. In this course, students will learn various data analysis and statistical techniques to extract insights and solve real-world problems. Through the use of data, such as transaction data and user log data, students will study cases of insight extraction based on data and develop critical thinking skills for data-driven decision-making. ∙프로세스마이닝 (Process Mining) (*데이터사이언스) 프로세스 마이닝은 누적된 로그 데이터로부터 프로세스를 도출하고, 분석 및 개선하기 위한 기법이다. 제조, 서비스, 인터넷 등의 정보시스템의 다양한 데이터를 바탕으로 비즈니스 운영 과정을 분석하는 방법을 학습한다. Process mining is a technology for discovering, analyzing, and improving process from historical log data. Students are 107 Ⅶ. 소프트웨어융합대학 교육과정"}
{"id": "e322278c6a64498e9da1f0ce98cb74c8", "source": "sw_pdf.pdf", "page": 108, "text": "taught how to analyze operational procedures based on various data that have been accumulated in manufacturing, service, and internet information systems. ∙금융데이터분석 (Financial Data Analysis) (*데이터사이언스) 금융공학의 다양한 기법을 기반으로 금융시장의 데이터를 분석하는 방법을 익힌다. 주식시장 데이터와 경제지표 데이터 등의 분석을 위해 사용되는 MS Excel, R, Python, Matlab을 중점적으로 학습하여 다양한 금융데이터 분석모델을 구현하게 된다. This course introduces students to analyzing financial data based on various financial engineering models. Students will learn how to implement various techniques for analyzing stock market data and economic data using MS Excel, R, Python, and Matlab. ∙데이터사이언스및시각화 (Data Science and Visualization) (*데이터사이언스) 데이터 분석 결과를 쉽게 이해할 수 있도록 시각적으로 표현하고 전달하는 방법론에 대해서 학습한다. 특히 빅데이터의 시각화 측면 에서, 모든 데이터를 살펴보는 것에 제약이 따르므로, 시각화의 기술적인 요소와 더불어 데이터를 요약하고, 한 눈에 살펴볼 수 있도록 돕는 시각화 방법론적 요소에 대한 이론과 실습을 수행한다. 데이터 시각화를 위한 데이터 기본구조를 이해하고, 계산에 효율적인 데이터 형식으로부터 사람의 지각, 인지, 그리고 커뮤니케이션에 효율적인 형식으로 정보를 변환하는 시각화 이론과 방 법에 대해서 학습한다. The world is awash with increasing amounts of data, and we must keep afloat with our relatively constant perceptual and cognitive abilities. Visualization provides one means of combating information overload, as a well-designed visual encoding can supplant cognitive calculations with simpler perceptual inferences and improve comprehension, memory, and decision making. Furthermore, visual representation may help engage more diverse audiences in the process of analytic thinking. This course introduces and practices a wide range of techniques for creating effective visualizations based on principles from graphic design, perceptual psychology, and cognitive science. The course is targeted towards students interested in building better visualization tools and systems. ∙인공지능과게임프로그래밍 (AI and Game Programming) 본 강의는 게임 프로그래밍을 통해 게임 요소, 자료 및 신호 분석, 인공지능에 대한 실질적인 프로그래밍 개념들을 소개하고 실습 한다. 신호 및 영상 처리, 데이터 분석, 기계 학습, 게임 비전 등에 대한 기초 이론이 인공지능의 다양한 분야에 어떻게 활용되는지 공부하고 프로그래밍으로 구현 및 분석한다. This course introduces and provides practical programming concepts for game components, data and signal analysis, and artificial intelligence using game programming. It explores fundamental theories of signal and image processing, analysis, machine learning, and game vision, focusing on their applications within diverse fields of artificial intelligence. ∙풀스택서비스네트워킹 (Full-Stack Service Networking) (*공통) 전통적인 컴퓨터네트워크 기술을 학습한 후, 최신 네트워킹 기술을 익힌다. 전통적인 컴퓨터네트워크 기술은 OSI(Open System Interconnection) 7계층 구조에 기반하여, Ethernet, WLAN, TCP/IP 등 인터넷 중심의 기술을 학습한다. 최신 네트워킹 기술은 소프트웨어융합학과 트랙에 맞춰서, 실제 산업에서 사용하는 실용적인 최신 네트워킹 기술을 다룬다. 특히, 트랙별 캡스톤디자인 및 소프트웨어융합 캡스톤디자인 등 네트워킹 기술 개발이 필요한 학생들은 수업을 들으며 실전적인 네트워킹 기술에 대한 조언과 최신 네트워킹 소프트웨어 기술에 대한 설명을 학습할 수 있다. After learning traditional computer network skills, discover the latest networking skills. Traditional computer network technology is based on the OSI(Open System Interconnection) 7-layer structure and understands Internet-oriented technologies such as Ethernet, WLAN, and TCP/IP. In line with the software convergence department and track, the latest networking technology covers the latest practical networking technology used in real industry. In particular, students who need networking, such as capstone design and software convergence by track, can learn advice on practical networking technology and explanations on the latest networking software technology while taking classes. 108 2025학년도 교육과정"}
{"id": "476ef850204d4920a2c967b60e44e840", "source": "sw_pdf.pdf", "page": 109, "text": "∙자연언어처리 (Natural Language Processing) (*공통) 이 과목은 자연언어처리(NLP)의 다양한 문제들을 다룬다. 따라서, 띄어쓰기, 형태소 분석 등과 같은 전통적인 자연언어처리 토픽 외에도 감성분석, 요약, 챗봇과 같은 응용 문제들도 다루고자 한다. 이 과목은 기계학습 기반의 자연언어처리 기법에 대하여 학생들이 심도 있는 이해를 하게 하여 추후 학생들이 자신만의 문제에 그 기법을 적용할 수 있도록 하는 것을 목표로 한다. This course covers a wide range of tasks in natural language processing(NLP). As well as traditional and basic topics in NLP such as word spacing and morphological analysis, its coverage includes application-related topics such as sentiment analysis, summarization, and chat-bot. This course aims at providing in-depth understanding of recent machine learning-based NLP techniques to allow students to apply the techniques to their own language-related tasks. ∙강화학습 (Reinforcement Learning) (*로봇·비전) 본 강의에서는 심층 신경망을 이용한 강화학습의 이론에 대해서 공부하고 실습을 통해 직접 구현해본다. 강화학습의 기본 개념, 벨만 방정식, 마르코프 결정 과정 등을 설명하고, 정책 함수 및 가치 함수 기반의 학습 방식에 대해서 공부한다. 시뮬레이션 기반으로 최신 심층 강화학습 알고리즘을 직접 구현해 본다. In this course, we will study the theory of reinforcement learning using deep neural networks and implement it directly through practice. Basic concepts of reinforcement learning, Bellman's equation, Markov decision process, etc. are explained, and learning methods based on policy functions and value functions are studied. We will cover recent deep reinforcement learning algorithms, and implement them on simulated environments. ∙영상분석과패턴인식 (Image Analysis and Pattern Recognition) 본 강의는 디지털 영상 분석과 패턴 인식을 다루며, 점처리, 컬러처리, 영상 분할, 형태학적 처리, 영상 필터, 콘볼루션, 크기공간 특징, 영상 정합, 영상 매칭의 내용을 포함한다. 또한 패턴 인식의 기본 알고리즘인 통계적, 구조적, 신경망의 방법을 학습한다. This course is an introduction to digital image analysis and pattern recognition. It includes topics such as point operations, color processing, image segmentation, morphological image processing, image filtering, convolution, scale-space features, image registration, and image matching. This course includes foundations of pattern recognition algorithms such as statistical, structural, and neural network methods. ∙현장실습/장기현장실습 (Internship in Software Convergence) 관련 기업에서 실무 경험을 통해 전공지식을 응용한다.(활동기간에 따라 산학필수 3학점, 6학점, 12학점) This course gives a chance to apply theoretical knowledges in a field. ∙데이터분석입문 (Introduction to Data Analytics) (*공통) 본 과목에서는 데이터 분석을 할 때 알아두어야할 중요한 개념, 기법, 기본 원칙 등에 대해 소개한다. 데이터의 수집에서부터 처리, 분석하여 문제 해결을 위한 통찰을 도출하는 전반적인 과정에 대해 학습하고 실습을 통해 적용력을 강화한다. This course introduces important concepts, techniques, and fundamental principles to understand when conducting data analysis. Students will learn the entire process, from data collection to processing, analysis, and deriving insights to solve problems, while improving practical skills through hands-on practice. ∙소프트웨어융합보안(Software Convergence Security) (*공통) 소프트웨어가 적용되는 다양한 분야(웹, 모바일, 인공지능, IoT 등)에서 나타나는 여러 사이버공격 기법과 이를 예방하기 위해 소프 트웨어 개발자가 알아두어야 할 사항에 대해 학습한다. 사이버보안과 관련한 주요 개념, 기법, 최신 동향 등에 대해 폭넓게 다룬다. This course will cover various cyberattack techniques that appear across different software application fields such as web, mobile, artificial intelligence, and IoT, as well as principles that software developers should be aware of to prevent those attacks. The course will also broadly cover key concepts, techniques, and the latest trends related to cybersecurity. 109 Ⅶ. 소프트웨어융합대학 교육과정"}
{"id": "c705c8ef5f614957abab8a0d5bca1e77", "source": "sw_pdf.pdf", "page": 110, "text": "[별표14] 소프트웨어융합학과 융합리더트랙 예시 (클라우드 컴퓨팅 융합리더트랙 : 2018학번 차수환 제안) 제1조(융합리더트랙 목적) 클라우드 컴퓨팅 트랙은 Cloud Native Application을 설계(architecture)하고, Cloud Native 환경에 서 Application을 개발(develope) 할 수 있는 인재를 양성하는 것을 목적으로 둔다. 제2조(전공 및 트랙과목 이수) 클라우드 컴퓨팅 융합리더트랙을 단일전공과정으로 졸업하기 위해서는 [표]의 전공선택 과목을 최 소 36학점(12과목) 이수하여야 한다. 융합리더트랙의 졸업을 위한 전공 및 트랙과목 이수 요건은 소프트웨어융합학과 교육과정의 제2장 제4조(전공 및 트랙과목 이수)에 준 한다. 타전공 교과목에 대해서는 [별표9]에 명시한 타전공 교과목의 전공학점(전공선 택)을 인정하며, 타전공 교과목의 최대 전공학점(전공선택) 인정 학점은 본 교육과정의 제3장 제5조(타전공과목 이수)에 준하므로, 졸업학점 산출시 유의한다. 소프트웨어융합학과 융합리더트랙 예시 (HCI 융합리더트랙 : 2018학번 장재윤 제안) 제1조(융합리더트랙 목적) HCI 융합리더트랙은 하드웨어, 소프트웨어, 산업 디자인, 인간 공학 등의 복합적인 학습을 통해 HCI 의 기획, 디자인 및 개발의 전 과정을 진행할 수 있는 역량을 기르고 다양한 분야에 HCI를 접목시킬 수 있도록 시야를 확장시키 는 것을 목표로 한다. 제2조(전공 및 트랙과목 이수) HCI 융합리더트랙을 단일전공과정으로 졸업하기 위해서는 [표]의 전공선택 과목을 최소 36학점 (12과목) 이수하여야 한다. 융합리더트랙의 졸업을 위한 전공 및 트랙과목 이수 요건은 소프트웨어융합학과 교육과정의 제2장 제4조(전공 및 트랙과목 이수)에 준한다. 타전공 교과목에 대해서는 [별표9]에 명시한 타전공 교과목의 전공학점(전공선택)을 인정 하며, 타전공 교과목의 최대 전공학점(전공선택) 인정 학점은 본 교육과정의 제3장 제5조(타전공과목 이수)에 준하므로, 졸업학 점 산출시 유의한다. 110 2025학년도 교육과정"}
{"id": "4475f83d339c4693837040f8fbcc42c5", "source": "sw_pdf.pdf", "page": 111, "text": "[별표15] 디자인 소프트웨어 마이크로디그리 이수체계도 1. 마이크로디그리명(영문): 디자인 소프트웨어 마이크로디그리 (Design Software Micro Degree) 2. 마이크로디그리 목표: 디자인과 소프트웨어를 융합하여 예술과 기술의 경계를 넘어서는 인재 양성 3. 마이크로디그리 소개 ① Computational Thinking 고취를 위한 기초 프로그래밍 ② 모바일앱과 웹서비스 (서버, UI/UX) 개발을 위한 Full-Stack 프로그래밍 ③ 디자인과 예술 분야의 수요를 반영한 컴퓨터/소프트웨어 기반 지식 4. 마이크로디그리 이수 역량과 자격 ① 본인의 아이디어를 조기에 사업화/창업하고 싶은 소프트웨어 비전공자 ② 예술/디자인 산업에 관심이 있는 소프트웨어 전공자 ③ 소프트웨어융합학과 ‘웹파이선프로그래밍’ 사전 수강 권장 ④ 2학기 이상 이수한 재학생(편입생은 1학기 이상)에게 마이크로디그리의 신청자격을 부여하며, 마이크로디그리 이수를 희망 하는 자는 학기별 소정의 기간에 신청 후 이수하면 된다.(단, 수업연한 초과자는 신청할 수 없음) ⑤ 마이크로디그리는 최대 3개까지 신청 및 이수할 수 있다. 단, 특정 학부(과) 소속학생의 신청이 제한될 수 있다. ⑥ 이수 중인 마이크로디그리를 포기하고자 하는 자는 학기별 소정의 기간에 마이크로디그리 포기 신청을 해야 한다. ⑦ 최종 이수 확정 된 마이크로디그리는 포기할 수 없다. ⑧ 마이크로디그리 미이수자 중 졸업요건을 충족한 자는 마이크로디그리를 위해 졸업유예를 할 수 없다. 5. 디자인 소프트웨어 마이크로디그리 이수학점 총계 9 (필수이수:2교과, 선택이수[택1]:1교과) 6. 마이크로디그리 이수방법 ① 마이크로디그리 신청자는 신청한 마이크로디그리의 이수체계에 따라 교과목을 이수하여야 한다. ② 마이크로디그리 신청 전에 해당 과목을 이수하였을 경우 이수학점으로 인정한다. ③ 마이크로디그리로 인정된 교과목은 전공 및 교양학점으로 중복 인정한다. ④ 이수 중인 마이크로디그리를 포기할 경우 기 이수한 교과목은 전공 및 교양, 또는 일반선택 학점으로 인정한다. ⑤ 마이크로디그리 이수 후 마이크로디그리 수료증을 발급받을 수 있으며, 성적증명서에 그 사실을 기재한다. 111 Ⅶ. 소프트웨어융합대학 교육과정"}
{"id": "37a27add5b304878922aa5f43046cac5", "source": "sw_pdf.pdf", "page": 112, "text": "로봇 소프트웨어 마이크로디그리 이수체계도 1. 마이크로디그리명(영문): 로봇 소프트웨어 마이크로디그리 (Robot Software Micro Degree) 2. 마이크로디그리 목표: 로봇에 필요한 이론 및 소프트웨어 전문 인재 양성 3. 마이크로디그리 소개 ① ROS(Robot Operating System)을 기반으로 하는 로봇 개발 기술 ② 오픈소스 기반의 로봇 소프트웨어 개발 기술 ③ 로봇에 필요한 다양한 센서에 대한 이해 및 센서 데이터 처리를 위한 딥러닝 기초 및 합성곱 신경망 기술 ④ 다양한 센서를 바탕으로한 로봇 제어, 로봇 자율주행 기술 실습 및 구현 4. 마이크로디그리 이수 역량과 자격 ① 본인의 아이디어를 반영한 로봇을 개발하고자 하는 소프트웨어 비전공자 ② 로봇 개발 및 제어에 관심이 있는 소프트웨어 전공자 ③ 컴퓨터공학과 ‘객체지향프로그래밍’ 사전 수강 권장 ④ 2학기 이상 이수한 재학생(편입생은 1학기 이상)에게 마이크로디그리의 신청자격을 부여하며, 마이크로디그리 이수를 희망 하는 자는 학기별 소정의 기간에 신청 후 이수하면 된다. (단, 수업연한 초과자는 신청할 수 없음) ⑤ 마이크로디그리는 최대 3개까지 신청 및 이수할 수 있다. 단, 특정 학부(과) 소속학생의 신청이 제한될 수 있다. ⑥ 이수 중인 마이크로디그리를 포기하고자 하는 자는 학기별 소정의 기간에 마이크로디그리 포기 신청을 해야 한다. ⑦ 최종 이수 확정 된 마이크로디그리는 포기할 수 없다. ⑧ 마이크로디그리 미이수자 중 졸업요건을 충족한 자는 마이크로디그리를 위해 졸업유예를 할 수 없다. 5. 로봇 소프트웨어 마이크로디그리 이수학점 총계 9 6. 마이크로디그리 이수방법 ① 마이크로디그리 신청자는 신청한 마이크로디그리의 이수체계에 따라 교과목을 이수하여야 한다. ② 마이크로디그리 신청 전에 해당 과목을 이수하였을 경우 이수학점으로 인정한다. ③ 마이크로디그리로 인정된 교과목은 전공 및 교양학점으로 중복 인정한다. ④ 이수 중인 마이크로디그리를 포기할 경우 기 이수한 교과목은 전공 및 교양, 또는 일반선택 학점으로 인정한다. ⑤ 마이크로디그리 이수 후 마이크로디그리 수료증을 발급받을 수 있으며, 성적증명서에 그 사실을 기재한다. 112 2025학년도 교육과정"}
{"id": "c7507aac840c4b45b9319111eea3575e", "source": "sw_pdf.pdf", "page": 113, "text": "[별표16] 소프트웨어융합학과 전공능력 1. 소프트웨어융합학과 교육목표 및 인재상 학과(전공) 압축된 소프트웨어 전공지식과 융합목표 분야에 특화된 소프트웨어 전문 지식 및 개발 능력 교육 교육목표 학과(전공) 인재상 2. 소프트웨어융합학과 전공능력 3. 전공능력 제고를 위한 전공 교육과정 구성 및 체계도 정립 가. 전공 교육과정 구성표 113 Ⅶ. 소프트웨어융합대학 교육과정"}
{"id": "7141623863fd41fe8c4d418f8898d3ef", "source": "sw_pdf.pdf", "page": 114, "text": "114 2025학년도 교육과정"}
{"id": "340d8f1e1f93445e813bedb5baaee22e", "source": "sw_pdf.pdf", "page": 115, "text": "나. 전공 교육과정 체계도 115 Ⅶ. 소프트웨어융합대학 교육과정"}
{"id": "bb9818de186e41139f56b2e0ce055e0c", "source": "sw_pdf.pdf", "page": 116, "text": "[별표17] 자유전공학부 학생을 위한 소프트웨어융합학과 전공 이수체계도 1. 자유전공학부 학생을 위한 소프트웨어융합학과 게임콘텐츠트랙 이수체계도(2학년부터) 2. 자유전공학부 학생을 위한 소프트웨어융합학과 데이터사이언스트랙 이수체계도(2학년부터) 116 2025학년도 교육과정"}
{"id": "b9d0a1295439470884f86d71570fe04b", "source": "sw_pdf.pdf", "page": 117, "text": "3. 자유전공학부 학생을 위한 소프트웨어융합학과 로봇·비전트랙 이수체계도(2학년부터) 117 Ⅶ. 소프트웨어융합대학 교육과정"}
